# Comparing `tmp/bioconsertinc-1.0.3-cp38-cp38-manylinux_2_5_x86_64.manylinux1_x86_64.whl.zip` & `tmp/bioconsertinc-2.0.0-cp38-cp38-manylinux_2_5_x86_64.manylinux1_x86_64.whl.zip`

## zipinfo {}

```diff
@@ -1,10 +1,10 @@
-Zip file size: 32380 bytes, number of entries: 8
-drwxrwxr-x  2.0 unx        0 b- stor 23-Jul-21 13:42 bioconsertinc.libs/
-drwxrwxr-x  2.0 unx        0 b- stor 23-Jul-21 13:42 bioconsertinc-1.0.3.dist-info/
--rwxrwxr-x  2.0 unx    74128 b- defN 23-Jul-21 13:42 bioconsertinc.cpython-38-x86_64-linux-gnu.so
--rw-rw-r--  2.0 unx       14 b- defN 23-Jul-21 13:42 bioconsertinc-1.0.3.dist-info/top_level.txt
--rw-rw-r--  2.0 unx     1070 b- defN 23-Jul-21 13:42 bioconsertinc-1.0.3.dist-info/LICENSE
--rw-rw-r--  2.0 unx      340 b- defN 23-Jul-21 13:42 bioconsertinc-1.0.3.dist-info/METADATA
--rw-rw-r--  2.0 unx      144 b- defN 23-Jul-21 13:42 bioconsertinc-1.0.3.dist-info/WHEEL
--rw-rw-r--  2.0 unx      524 b- defN 23-Jul-21 13:42 bioconsertinc-1.0.3.dist-info/RECORD
-8 files, 76220 bytes uncompressed, 31186 bytes compressed:  59.1%
+Zip file size: 33333 bytes, number of entries: 8
+drwxrwxr-x  2.0 unx        0 b- stor 23-Jul-21 14:34 bioconsertinc.libs/
+drwxrwxr-x  2.0 unx        0 b- stor 23-Jul-21 14:34 bioconsertinc-2.0.0.dist-info/
+-rwxrwxr-x  2.0 unx    76632 b- defN 23-Jul-21 14:34 bioconsertinc.cpython-38-x86_64-linux-gnu.so
+-rw-rw-r--  2.0 unx       14 b- defN 23-Jul-21 14:34 bioconsertinc-2.0.0.dist-info/top_level.txt

-    <43>   DW_AT_name        : (strp) (offset: 0x20e9): long unsigned int
+    <43>   DW_AT_name        : (strp) (offset: 0x2130): long unsigned int
  <1><47>: Abbrev Number: 2 (DW_TAG_base_type)
     <48>   DW_AT_byte_size   : (data1) 4
     <49>   DW_AT_encoding    : (data1) 7	(unsigned)
-    <4a>   DW_AT_name        : (strp) (offset: 0x20ee): unsigned int
+    <4a>   DW_AT_name        : (strp) (offset: 0x2135): unsigned int
  <1><4e>: Abbrev Number: 4 (DW_TAG_const_type)
     <4f>   DW_AT_type        : (ref4) <0x47>, unsigned int
  <1><53>: Abbrev Number: 5 (DW_TAG_pointer_type)
     <54>   DW_AT_byte_size   : (data1) 8
  <1><55>: Abbrev Number: 2 (DW_TAG_base_type)
     <56>   DW_AT_byte_size   : (data1) 1
     <57>   DW_AT_encoding    : (data1) 8	(unsigned char)
-    <58>   DW_AT_name        : (strp) (offset: 0x9f2): unsigned char
+    <58>   DW_AT_name        : (strp) (offset: 0xa11): unsigned char
  <1><5c>: Abbrev Number: 4 (DW_TAG_const_type)
     <5d>   DW_AT_type        : (ref4) <0x55>, unsigned char
  <1><61>: Abbrev Number: 2 (DW_TAG_base_type)
     <62>   DW_AT_byte_size   : (data1) 2
     <63>   DW_AT_encoding    : (data1) 7	(unsigned)
-    <64>   DW_AT_name        : (strp) (offset: 0x145d): short unsigned int
+    <64>   DW_AT_name        : (strp) (offset: 0x1489): short unsigned int
  <1><68>: Abbrev Number: 2 (DW_TAG_base_type)
     <69>   DW_AT_byte_size   : (data1) 1
     <6a>   DW_AT_encoding    : (data1) 6	(signed char)
-    <6b>   DW_AT_name        : (strp) (offset: 0x9f4): signed char
+    <6b>   DW_AT_name        : (strp) (offset: 0xa13): signed char
  <1><6f>: Abbrev Number: 2 (DW_TAG_base_type)
     <70>   DW_AT_byte_size   : (data1) 2
     <71>   DW_AT_encoding    : (data1) 5	(signed)
-    <72>   DW_AT_name        : (strp) (offset: 0x26ed): short int
+    <72>   DW_AT_name        : (strp) (offset: 0x2734): short int
  <1><76>: Abbrev Number: 6 (DW_TAG_base_type)
     <77>   DW_AT_byte_size   : (data1) 4
     <78>   DW_AT_encoding    : (data1) 5	(signed)
     <79>   DW_AT_name        : (string) int
  <1><7d>: Abbrev Number: 3 (DW_TAG_typedef)
-    <7e>   DW_AT_name        : (strp) (offset: 0x1e31): __uint32_t
-    <82>   DW_AT_decl_file   : (data1) 6
+    <7e>   DW_AT_name        : (strp) (offset: 0x1e78): __uint32_t
+    <82>   DW_AT_decl_file   : (data1) 7
     <83>   DW_AT_decl_line   : (data1) 42
     <84>   DW_AT_decl_column : (data1) 22
     <85>   DW_AT_type        : (ref4) <0x47>, unsigned int
  <1><89>: Abbrev Number: 2 (DW_TAG_base_type)
     <8a>   DW_AT_byte_size   : (data1) 8
     <8b>   DW_AT_encoding    : (data1) 5	(signed)
-    <8c>   DW_AT_name        : (strp) (offset: 0x23f9): long int
+    <8c>   DW_AT_name        : (strp) (offset: 0x2440): long int
  <1><90>: Abbrev Number: 3 (DW_TAG_typedef)
-    <91>   DW_AT_name        : (strp) (offset: 0x1055): __uint64_t
-    <95>   DW_AT_decl_file   : (data1) 6
+    <91>   DW_AT_name        : (strp) (offset: 0x1074): __uint64_t
+    <95>   DW_AT_decl_file   : (data1) 7
     <96>   DW_AT_decl_line   : (data1) 45
     <97>   DW_AT_decl_column : (data1) 27
     <98>   DW_AT_type        : (ref4) <0x40>, long unsigned int
  <1><9c>: Abbrev Number: 3 (DW_TAG_typedef)
     <9d>   DW_AT_name        : (strp) (offset: 0x346): __off_t
-    <a1>   DW_AT_decl_file   : (data1) 6
+    <a1>   DW_AT_decl_file   : (data1) 7
     <a2>   DW_AT_decl_line   : (data1) 152
     <a3>   DW_AT_decl_column : (data1) 25
     <a4>   DW_AT_type        : (ref4) <0x89>, long int
  <1><a8>: Abbrev Number: 3 (DW_TAG_typedef)
-    <a9>   DW_AT_name        : (strp) (offset: 0x15e5): __off64_t
-    <ad>   DW_AT_decl_file   : (data1) 6
+    <a9>   DW_AT_name        : (strp) (offset: 0x1611): __off64_t
+    <ad>   DW_AT_decl_file   : (data1) 7
     <ae>   DW_AT_decl_line   : (data1) 153
     <af>   DW_AT_decl_column : (data1) 27
     <b0>   DW_AT_type        : (ref4) <0x89>, long int
  <1><b4>: Abbrev Number: 3 (DW_TAG_typedef)
-    <b5>   DW_AT_name        : (strp) (offset: 0x1147): __ssize_t
-    <b9>   DW_AT_decl_file   : (data1) 6
+    <b5>   DW_AT_name        : (strp) (offset: 0x1173): __ssize_t
+    <b9>   DW_AT_decl_file   : (data1) 7
     <ba>   DW_AT_decl_line   : (data1) 193
     <bb>   DW_AT_decl_column : (data1) 27
     <bc>   DW_AT_type        : (ref4) <0x89>, long int
  <1><c0>: Abbrev Number: 7 (DW_TAG_pointer_type)
     <c1>   DW_AT_byte_size   : (data1) 8
     <c2>   DW_AT_type        : (ref4) <0xc6>, char
  <1><c6>: Abbrev Number: 2 (DW_TAG_base_type)
     <c7>   DW_AT_byte_size   : (data1) 1
     <c8>   DW_AT_encoding    : (data1) 6	(signed char)
-    <c9>   DW_AT_name        : (strp) (offset: 0x9fb): char
+    <c9>   DW_AT_name        : (strp) (offset: 0xa1a): char
  <1><cd>: Abbrev Number: 4 (DW_TAG_const_type)
     <ce>   DW_AT_type        : (ref4) <0xc6>, char
  <1><d2>: Abbrev Number: 3 (DW_TAG_typedef)
-    <d3>   DW_AT_name        : (strp) (offset: 0x92f): __intptr_t
-    <d7>   DW_AT_decl_file   : (data1) 6
+    <d3>   DW_AT_name        : (strp) (offset: 0x93d): __intptr_t
+    <d7>   DW_AT_decl_file   : (data1) 7
     <d8>   DW_AT_decl_line   : (data1) 206
     <d9>   DW_AT_decl_column : (data1) 25
     <da>   DW_AT_type        : (ref4) <0x89>, long int
  <1><de>: Abbrev Number: 8 (DW_TAG_structure_type)
-    <df>   DW_AT_name        : (strp) (offset: 0x1b41): _IO_FILE
+    <df>   DW_AT_name        : (strp) (offset: 0x1b88): _IO_FILE
     <e3>   DW_AT_byte_size   : (data1) 216
-    <e4>   DW_AT_decl_file   : (data1) 7
+    <e4>   DW_AT_decl_file   : (data1) 8
     <e5>   DW_AT_decl_line   : (data1) 49
     <e6>   DW_AT_decl_column : (data1) 8
     <e7>   DW_AT_sibling     : (ref4) <0x265>
  <2><eb>: Abbrev Number: 9 (DW_TAG_member)
-    <ec>   DW_AT_name        : (strp) (offset: 0x1249): _flags
-    <f0>   DW_AT_decl_file   : (data1) 7
+    <ec>   DW_AT_name        : (strp) (offset: 0x1275): _flags
+    <f0>   DW_AT_decl_file   : (data1) 8
     <f1>   DW_AT_decl_line   : (data1) 51
     <f2>   DW_AT_decl_column : (data1) 7
     <f3>   DW_AT_type        : (ref4) <0x76>, int
     <f7>   DW_AT_data_member_location: (data1) 0
  <2><f8>: Abbrev Number: 9 (DW_TAG_member)
-    <f9>   DW_AT_name        : (strp) (offset: 0x21eb): _IO_read_ptr
-    <fd>   DW_AT_decl_file   : (data1) 7
+    <f9>   DW_AT_name        : (strp) (offset: 0x2232): _IO_read_ptr
+    <fd>   DW_AT_decl_file   : (data1) 8
     <fe>   DW_AT_decl_line   : (data1) 54
     <ff>   DW_AT_decl_column : (data1) 9
     <100>   DW_AT_type        : (ref4) <0xc0>, char
     <104>   DW_AT_data_member_location: (data1) 8
  <2><105>: Abbrev Number: 9 (DW_TAG_member)
-    <106>   DW_AT_name        : (strp) (offset: 0x1b11): _IO_read_end
-    <10a>   DW_AT_decl_file   : (data1) 7
+    <106>   DW_AT_name        : (strp) (offset: 0x1b58): _IO_read_end
+    <10a>   DW_AT_decl_file   : (data1) 8
     <10b>   DW_AT_decl_line   : (data1) 55
     <10c>   DW_AT_decl_column : (data1) 9
     <10d>   DW_AT_type        : (ref4) <0xc0>, char
     <111>   DW_AT_data_member_location: (data1) 16
  <2><112>: Abbrev Number: 9 (DW_TAG_member)
-    <113>   DW_AT_name        : (strp) (offset: 0x1621): _IO_read_base
-    <117>   DW_AT_decl_file   : (data1) 7
+    <113>   DW_AT_name        : (strp) (offset: 0x164d): _IO_read_base
+    <117>   DW_AT_decl_file   : (data1) 8
     <118>   DW_AT_decl_line   : (data1) 56
     <119>   DW_AT_decl_column : (data1) 9
     <11a>   DW_AT_type        : (ref4) <0xc0>, char
     <11e>   DW_AT_data_member_location: (data1) 24
  <2><11f>: Abbrev Number: 9 (DW_TAG_member)
-    <120>   DW_AT_name        : (strp) (offset: 0x1729): _IO_write_base
-    <124>   DW_AT_decl_file   : (data1) 7
+    <120>   DW_AT_name        : (strp) (offset: 0x1761): _IO_write_base
+    <124>   DW_AT_decl_file   : (data1) 8
     <125>   DW_AT_decl_line   : (data1) 57
     <126>   DW_AT_decl_column : (data1) 9
     <127>   DW_AT_type        : (ref4) <0xc0>, char
     <12b>   DW_AT_data_member_location: (data1) 32
  <2><12c>: Abbrev Number: 9 (DW_TAG_member)
-    <12d>   DW_AT_name        : (strp) (offset: 0xc95): _IO_write_ptr
-    <131>   DW_AT_decl_file   : (data1) 7
+    <12d>   DW_AT_name        : (strp) (offset: 0xcb4): _IO_write_ptr
+    <131>   DW_AT_decl_file   : (data1) 8
     <132>   DW_AT_decl_line   : (data1) 58
     <133>   DW_AT_decl_column : (data1) 9
     <134>   DW_AT_type        : (ref4) <0xc0>, char
     <138>   DW_AT_data_member_location: (data1) 40
  <2><139>: Abbrev Number: 9 (DW_TAG_member)
     <13a>   DW_AT_name        : (strp) (offset: 0x5e6): _IO_write_end
-    <13e>   DW_AT_decl_file   : (data1) 7
+    <13e>   DW_AT_decl_file   : (data1) 8
     <13f>   DW_AT_decl_line   : (data1) 59
     <140>   DW_AT_decl_column : (data1) 9
     <141>   DW_AT_type        : (ref4) <0xc0>, char
     <145>   DW_AT_data_member_location: (data1) 48
  <2><146>: Abbrev Number: 9 (DW_TAG_member)
-    <147>   DW_AT_name        : (strp) (offset: 0x1ad1): _IO_buf_base
-    <14b>   DW_AT_decl_file   : (data1) 7
+    <147>   DW_AT_name        : (strp) (offset: 0x1b18): _IO_buf_base
+    <14b>   DW_AT_decl_file   : (data1) 8
     <14c>   DW_AT_decl_line   : (data1) 60
     <14d>   DW_AT_decl_column : (data1) 9
     <14e>   DW_AT_type        : (ref4) <0xc0>, char
     <152>   DW_AT_data_member_location: (data1) 56
  <2><153>: Abbrev Number: 9 (DW_TAG_member)
-    <154>   DW_AT_name        : (strp) (offset: 0x1678): _IO_buf_end
-    <158>   DW_AT_decl_file   : (data1) 7
+    <154>   DW_AT_name        : (strp) (offset: 0x16a4): _IO_buf_end
+    <158>   DW_AT_decl_file   : (data1) 8
     <159>   DW_AT_decl_line   : (data1) 61
     <15a>   DW_AT_decl_column : (data1) 9
     <15b>   DW_AT_type        : (ref4) <0xc0>, char
     <15f>   DW_AT_data_member_location: (data1) 64
  <2><160>: Abbrev Number: 9 (DW_TAG_member)
-    <161>   DW_AT_name        : (strp) (offset: 0xea2): _IO_save_base
-    <165>   DW_AT_decl_file   : (data1) 7
+    <161>   DW_AT_name        : (strp) (offset: 0xec1): _IO_save_base
+    <165>   DW_AT_decl_file   : (data1) 8
     <166>   DW_AT_decl_line   : (data1) 64
     <167>   DW_AT_decl_column : (data1) 9
     <168>   DW_AT_type        : (ref4) <0xc0>, char
     <16c>   DW_AT_data_member_location: (data1) 72
  <2><16d>: Abbrev Number: 9 (DW_TAG_member)
-    <16e>   DW_AT_name        : (strp) (offset: 0x21db): _IO_backup_base
-    <172>   DW_AT_decl_file   : (data1) 7
+    <16e>   DW_AT_name        : (strp) (offset: 0x2222): _IO_backup_base
+    <172>   DW_AT_decl_file   : (data1) 8
     <173>   DW_AT_decl_line   : (data1) 65
     <174>   DW_AT_decl_column : (data1) 9
     <175>   DW_AT_type        : (ref4) <0xc0>, char
     <179>   DW_AT_data_member_location: (data1) 80
  <2><17a>: Abbrev Number: 9 (DW_TAG_member)
-    <17b>   DW_AT_name        : (strp) (offset: 0x133a): _IO_save_end
-    <17f>   DW_AT_decl_file   : (data1) 7
+    <17b>   DW_AT_name        : (strp) (offset: 0x1366): _IO_save_end
+    <17f>   DW_AT_decl_file   : (data1) 8
     <180>   DW_AT_decl_line   : (data1) 66
     <181>   DW_AT_decl_column : (data1) 9
     <182>   DW_AT_type        : (ref4) <0xc0>, char
     <186>   DW_AT_data_member_location: (data1) 88
  <2><187>: Abbrev Number: 9 (DW_TAG_member)
-    <188>   DW_AT_name        : (strp) (offset: 0x1cd6): _markers
-    <18c>   DW_AT_decl_file   : (data1) 7
+    <188>   DW_AT_name        : (strp) (offset: 0x1d1d): _markers
+    <18c>   DW_AT_decl_file   : (data1) 8
     <18d>   DW_AT_decl_line   : (data1) 68
     <18e>   DW_AT_decl_column : (data1) 22
     <18f>   DW_AT_type        : (ref4) <0x27e>, _IO_marker
     <193>   DW_AT_data_member_location: (data1) 96
  <2><194>: Abbrev Number: 9 (DW_TAG_member)
-    <195>   DW_AT_name        : (strp) (offset: 0x989): _chain
-    <199>   DW_AT_decl_file   : (data1) 7
+    <195>   DW_AT_name        : (strp) (offset: 0x9a8): _chain
+    <199>   DW_AT_decl_file   : (data1) 8
     <19a>   DW_AT_decl_line   : (data1) 70
     <19b>   DW_AT_decl_column : (data1) 20
     <19c>   DW_AT_type        : (ref4) <0x284>, _IO_FILE
     <1a0>   DW_AT_data_member_location: (data1) 104
  <2><1a1>: Abbrev Number: 9 (DW_TAG_member)
     <1a2>   DW_AT_name        : (strp) (offset: 0x49): _fileno
-    <1a6>   DW_AT_decl_file   : (data1) 7
+    <1a6>   DW_AT_decl_file   : (data1) 8
     <1a7>   DW_AT_decl_line   : (data1) 72
     <1a8>   DW_AT_decl_column : (data1) 7
     <1a9>   DW_AT_type        : (ref4) <0x76>, int
     <1ad>   DW_AT_data_member_location: (data1) 112
  <2><1ae>: Abbrev Number: 9 (DW_TAG_member)
-    <1af>   DW_AT_name        : (strp) (offset: 0x2449): _flags2
-    <1b3>   DW_AT_decl_file   : (data1) 7
+    <1af>   DW_AT_name        : (strp) (offset: 0x2490): _flags2
+    <1b3>   DW_AT_decl_file   : (data1) 8
     <1b4>   DW_AT_decl_line   : (data1) 73
     <1b5>   DW_AT_decl_column : (data1) 7
     <1b6>   DW_AT_type        : (ref4) <0x76>, int
     <1ba>   DW_AT_data_member_location: (data1) 116
  <2><1bb>: Abbrev Number: 9 (DW_TAG_member)
-    <1bc>   DW_AT_name        : (strp) (offset: 0x2312): _old_offset
-    <1c0>   DW_AT_decl_file   : (data1) 7
+    <1bc>   DW_AT_name        : (strp) (offset: 0x2359): _old_offset
+    <1c0>   DW_AT_decl_file   : (data1) 8
     <1c1>   DW_AT_decl_line   : (data1) 74
     <1c2>   DW_AT_decl_column : (data1) 11
     <1c3>   DW_AT_type        : (ref4) <0x9c>, __off_t, long int
     <1c7>   DW_AT_data_member_location: (data1) 120
  <2><1c8>: Abbrev Number: 9 (DW_TAG_member)
-    <1c9>   DW_AT_name        : (strp) (offset: 0x210b): _cur_column
-    <1cd>   DW_AT_decl_file   : (data1) 7
+    <1c9>   DW_AT_name        : (strp) (offset: 0x2152): _cur_column
+    <1cd>   DW_AT_decl_file   : (data1) 8
     <1ce>   DW_AT_decl_line   : (data1) 77
     <1cf>   DW_AT_decl_column : (data1) 18
     <1d0>   DW_AT_type        : (ref4) <0x61>, short unsigned int
     <1d4>   DW_AT_data_member_location: (data1) 128
  <2><1d5>: Abbrev Number: 9 (DW_TAG_member)
-    <1d6>   DW_AT_name        : (strp) (offset: 0x2710): _vtable_offset
-    <1da>   DW_AT_decl_file   : (data1) 7
+    <1d6>   DW_AT_name        : (strp) (offset: 0x2757): _vtable_offset
+    <1da>   DW_AT_decl_file   : (data1) 8
     <1db>   DW_AT_decl_line   : (data1) 78
     <1dc>   DW_AT_decl_column : (data1) 15
     <1dd>   DW_AT_type        : (ref4) <0x68>, signed char
     <1e1>   DW_AT_data_member_location: (data1) 130
  <2><1e2>: Abbrev Number: 9 (DW_TAG_member)
     <1e3>   DW_AT_name        : (strp) (offset: 0x201): _shortbuf
-    <1e7>   DW_AT_decl_file   : (data1) 7
+    <1e7>   DW_AT_decl_file   : (data1) 8
     <1e8>   DW_AT_decl_line   : (data1) 79
     <1e9>   DW_AT_decl_column : (data1) 8
     <1ea>   DW_AT_type        : (ref4) <0x28a>, char
     <1ee>   DW_AT_data_member_location: (data1) 131
  <2><1ef>: Abbrev Number: 9 (DW_TAG_member)
     <1f0>   DW_AT_name        : (strp) (offset: 0x38f): _lock
-    <1f4>   DW_AT_decl_file   : (data1) 7
+    <1f4>   DW_AT_decl_file   : (data1) 8
     <1f5>   DW_AT_decl_line   : (data1) 81
     <1f6>   DW_AT_decl_column : (data1) 15
     <1f7>   DW_AT_type        : (ref4) <0x29a>, _IO_lock_t
     <1fb>   DW_AT_data_member_location: (data1) 136
  <2><1fc>: Abbrev Number: 9 (DW_TAG_member)
-    <1fd>   DW_AT_name        : (strp) (offset: 0x2316): _offset
-    <201>   DW_AT_decl_file   : (data1) 7
+    <1fd>   DW_AT_name        : (strp) (offset: 0x235d): _offset
+    <201>   DW_AT_decl_file   : (data1) 8
     <202>   DW_AT_decl_line   : (data1) 89
     <203>   DW_AT_decl_column : (data1) 13
     <204>   DW_AT_type        : (ref4) <0xa8>, __off64_t, long int
     <208>   DW_AT_data_member_location: (data1) 144
  <2><209>: Abbrev Number: 9 (DW_TAG_member)
-    <20a>   DW_AT_name        : (strp) (offset: 0x192f): _codecvt
-    <20e>   DW_AT_decl_file   : (data1) 7
+    <20a>   DW_AT_name        : (strp) (offset: 0x1966): _codecvt
+    <20e>   DW_AT_decl_file   : (data1) 8
     <20f>   DW_AT_decl_line   : (data1) 91
     <210>   DW_AT_decl_column : (data1) 23
     <211>   DW_AT_type        : (ref4) <0x2a5>, _IO_codecvt
     <215>   DW_AT_data_member_location: (data1) 152
  <2><216>: Abbrev Number: 9 (DW_TAG_member)
-    <217>   DW_AT_name        : (strp) (offset: 0x1b65): _wide_data
-    <21b>   DW_AT_decl_file   : (data1) 7
+    <217>   DW_AT_name        : (strp) (offset: 0x1bac): _wide_data
+    <21b>   DW_AT_decl_file   : (data1) 8
     <21c>   DW_AT_decl_line   : (data1) 92
     <21d>   DW_AT_decl_column : (data1) 25
     <21e>   DW_AT_type        : (ref4) <0x2b0>, _IO_wide_data
     <222>   DW_AT_data_member_location: (data1) 160
  <2><223>: Abbrev Number: 9 (DW_TAG_member)
-    <224>   DW_AT_name        : (strp) (offset: 0x2239): _freeres_list
-    <228>   DW_AT_decl_file   : (data1) 7
+    <224>   DW_AT_name        : (strp) (offset: 0x2280): _freeres_list
+    <228>   DW_AT_decl_file   : (data1) 8
     <229>   DW_AT_decl_line   : (data1) 93
     <22a>   DW_AT_decl_column : (data1) 20
     <22b>   DW_AT_type        : (ref4) <0x284>, _IO_FILE
     <22f>   DW_AT_data_member_location: (data1) 168
  <2><230>: Abbrev Number: 9 (DW_TAG_member)
-    <231>   DW_AT_name        : (strp) (offset: 0x2038): _freeres_buf
-    <235>   DW_AT_decl_file   : (data1) 7
+    <231>   DW_AT_name        : (strp) (offset: 0x207f): _freeres_buf
+    <235>   DW_AT_decl_file   : (data1) 8
     <236>   DW_AT_decl_line   : (data1) 94
     <237>   DW_AT_decl_column : (data1) 9
     <238>   DW_AT_type        : (ref4) <0x53>
     <23c>   DW_AT_data_member_location: (data1) 176
  <2><23d>: Abbrev Number: 9 (DW_TAG_member)
-    <23e>   DW_AT_name        : (strp) (offset: 0x1c73): __pad5
-    <242>   DW_AT_decl_file   : (data1) 7
+    <23e>   DW_AT_name        : (strp) (offset: 0x1cba): __pad5
+    <242>   DW_AT_decl_file   : (data1) 8
     <243>   DW_AT_decl_line   : (data1) 95
     <244>   DW_AT_decl_column : (data1) 10
     <245>   DW_AT_type        : (ref4) <0x34>, size_t, long unsigned int
     <249>   DW_AT_data_member_location: (data1) 184
  <2><24a>: Abbrev Number: 9 (DW_TAG_member)
-    <24b>   DW_AT_name        : (strp) (offset: 0x1708): _mode
-    <24f>   DW_AT_decl_file   : (data1) 7
+    <24b>   DW_AT_name        : (strp) (offset: 0x1740): _mode
+    <24f>   DW_AT_decl_file   : (data1) 8
     <250>   DW_AT_decl_line   : (data1) 96
     <251>   DW_AT_decl_column : (data1) 7
     <252>   DW_AT_type        : (ref4) <0x76>, int
     <256>   DW_AT_data_member_location: (data1) 192
  <2><257>: Abbrev Number: 9 (DW_TAG_member)
     <258>   DW_AT_name        : (strp) (offset: 0x2e): _unused2
-    <25c>   DW_AT_decl_file   : (data1) 7
+    <25c>   DW_AT_decl_file   : (data1) 8
     <25d>   DW_AT_decl_line   : (data1) 98
     <25e>   DW_AT_decl_column : (data1) 8
     <25f>   DW_AT_type        : (ref4) <0x2b6>, char
     <263>   DW_AT_data_member_location: (data1) 196
  <2><264>: Abbrev Number: 0
  <1><265>: Abbrev Number: 3 (DW_TAG_typedef)
-    <266>   DW_AT_name        : (strp) (offset: 0x1b45): FILE
-    <26a>   DW_AT_decl_file   : (data1) 8
+    <266>   DW_AT_name        : (strp) (offset: 0x1b8c): FILE
+    <26a>   DW_AT_decl_file   : (data1) 9
     <26b>   DW_AT_decl_line   : (data1) 7
     <26c>   DW_AT_decl_column : (data1) 25
     <26d>   DW_AT_type        : (ref4) <0xde>, _IO_FILE
  <1><271>: Abbrev Number: 10 (DW_TAG_typedef)
-    <272>   DW_AT_name        : (strp) (offset: 0xa82): _IO_lock_t
-    <276>   DW_AT_decl_file   : (data1) 7
+    <272>   DW_AT_name        : (strp) (offset: 0xaa1): _IO_lock_t
+    <276>   DW_AT_decl_file   : (data1) 8
     <277>   DW_AT_decl_line   : (data1) 43
     <278>   DW_AT_decl_column : (data1) 14
  <1><279>: Abbrev Number: 11 (DW_TAG_structure_type)
-    <27a>   DW_AT_name        : (strp) (offset: 0x1861): _IO_marker
+    <27a>   DW_AT_name        : (strp) (offset: 0x1898): _IO_marker
     <27e>   DW_AT_declaration : (flag_present) 1
  <1><27e>: Abbrev Number: 7 (DW_TAG_pointer_type)
     <27f>   DW_AT_byte_size   : (data1) 8
     <280>   DW_AT_type        : (ref4) <0x279>, _IO_marker
  <1><284>: Abbrev Number: 7 (DW_TAG_pointer_type)
     <285>   DW_AT_byte_size   : (data1) 8
     <286>   DW_AT_type        : (ref4) <0xde>, _IO_FILE
@@ -344,21 +344,21 @@
     <294>   DW_AT_type        : (ref4) <0x40>, long unsigned int
     <298>   DW_AT_upper_bound : (data1) 0
  <2><299>: Abbrev Number: 0
  <1><29a>: Abbrev Number: 7 (DW_TAG_pointer_type)
     <29b>   DW_AT_byte_size   : (data1) 8
     <29c>   DW_AT_type        : (ref4) <0x271>, _IO_lock_t
  <1><2a0>: Abbrev Number: 11 (DW_TAG_structure_type)
-    <2a1>   DW_AT_name        : (strp) (offset: 0x192c): _IO_codecvt
+    <2a1>   DW_AT_name        : (strp) (offset: 0x1963): _IO_codecvt
     <2a5>   DW_AT_declaration : (flag_present) 1
  <1><2a5>: Abbrev Number: 7 (DW_TAG_pointer_type)
     <2a6>   DW_AT_byte_size   : (data1) 8
     <2a7>   DW_AT_type        : (ref4) <0x2a0>, _IO_codecvt
  <1><2ab>: Abbrev Number: 11 (DW_TAG_structure_type)
-    <2ac>   DW_AT_name        : (strp) (offset: 0x1b62): _IO_wide_data
+    <2ac>   DW_AT_name        : (strp) (offset: 0x1ba9): _IO_wide_data
     <2b0>   DW_AT_declaration : (flag_present) 1
  <1><2b0>: Abbrev Number: 7 (DW_TAG_pointer_type)
     <2b1>   DW_AT_byte_size   : (data1) 8
     <2b2>   DW_AT_type        : (ref4) <0x2ab>, _IO_wide_data
  <1><2b6>: Abbrev Number: 12 (DW_TAG_array_type)
     <2b7>   DW_AT_type        : (ref4) <0xc6>, char
     <2bb>   DW_AT_sibling     : (ref4) <0x2c6>
@@ -377,111 +377,111 @@
     <2d7>   DW_AT_prototyped  : (flag_present) 1
     <2d7>   DW_AT_type        : (ref4) <0x76>, int
     <2db>   DW_AT_sibling     : (ref4) <0x2e5>
  <2><2df>: Abbrev Number: 16 (DW_TAG_formal_parameter)
     <2e0>   DW_AT_type        : (ref4) <0x53>
  <2><2e4>: Abbrev Number: 0
  <1><2e5>: Abbrev Number: 3 (DW_TAG_typedef)
-    <2e6>   DW_AT_name        : (strp) (offset: 0x1149): ssize_t
-    <2ea>   DW_AT_decl_file   : (data1) 9
+    <2e6>   DW_AT_name        : (strp) (offset: 0x1175): ssize_t
+    <2ea>   DW_AT_decl_file   : (data1) 10
     <2eb>   DW_AT_decl_line   : (data1) 77
     <2ec>   DW_AT_decl_column : (data1) 19
     <2ed>   DW_AT_type        : (ref4) <0xb4>, __ssize_t, long int
  <1><2f1>: Abbrev Number: 17 (DW_TAG_variable)
-    <2f2>   DW_AT_name        : (strp) (offset: 0x1a9d): stdin
-    <2f6>   DW_AT_decl_file   : (data1) 9
+    <2f2>   DW_AT_name        : (strp) (offset: 0x1ae4): stdin
+    <2f6>   DW_AT_decl_file   : (data1) 10
     <2f7>   DW_AT_decl_line   : (data1) 137
     <2f8>   DW_AT_decl_column : (data1) 14
     <2f9>   DW_AT_type        : (ref4) <0x2fd>, FILE, _IO_FILE
     <2fd>   DW_AT_external    : (flag_present) 1
     <2fd>   DW_AT_declaration : (flag_present) 1
  <1><2fd>: Abbrev Number: 7 (DW_TAG_pointer_type)
     <2fe>   DW_AT_byte_size   : (data1) 8
     <2ff>   DW_AT_type        : (ref4) <0x265>, FILE, _IO_FILE
  <1><303>: Abbrev Number: 14 (DW_TAG_restrict_type)
     <304>   DW_AT_type        : (ref4) <0x2fd>, FILE, _IO_FILE
  <1><308>: Abbrev Number: 17 (DW_TAG_variable)
-    <309>   DW_AT_name        : (strp) (offset: 0x13cd): stdout
-    <30d>   DW_AT_decl_file   : (data1) 9
+    <309>   DW_AT_name        : (strp) (offset: 0x13f9): stdout
+    <30d>   DW_AT_decl_file   : (data1) 10
     <30e>   DW_AT_decl_line   : (data1) 138
     <30f>   DW_AT_decl_column : (data1) 14
     <310>   DW_AT_type        : (ref4) <0x2fd>, FILE, _IO_FILE
     <314>   DW_AT_external    : (flag_present) 1
     <314>   DW_AT_declaration : (flag_present) 1
  <1><314>: Abbrev Number: 17 (DW_TAG_variable)
-    <315>   DW_AT_name        : (strp) (offset: 0x12db): stderr
-    <319>   DW_AT_decl_file   : (data1) 9
+    <315>   DW_AT_name        : (strp) (offset: 0x1307): stderr
+    <319>   DW_AT_decl_file   : (data1) 10
     <31a>   DW_AT_decl_line   : (data1) 139
     <31b>   DW_AT_decl_column : (data1) 14
     <31c>   DW_AT_type        : (ref4) <0x2fd>, FILE, _IO_FILE
     <320>   DW_AT_external    : (flag_present) 1
     <320>   DW_AT_declaration : (flag_present) 1
  <1><320>: Abbrev Number: 17 (DW_TAG_variable)
-    <321>   DW_AT_name        : (strp) (offset: 0x229a): sys_nerr
-    <325>   DW_AT_decl_file   : (data1) 10
+    <321>   DW_AT_name        : (strp) (offset: 0x22e1): sys_nerr
+    <325>   DW_AT_decl_file   : (data1) 11
     <326>   DW_AT_decl_line   : (data1) 26
     <327>   DW_AT_decl_column : (data1) 12
     <328>   DW_AT_type        : (ref4) <0x76>, int
     <32c>   DW_AT_external    : (flag_present) 1
     <32c>   DW_AT_declaration : (flag_present) 1
  <1><32c>: Abbrev Number: 12 (DW_TAG_array_type)
     <32d>   DW_AT_type        : (ref4) <0x2cc>, char
     <331>   DW_AT_sibling     : (ref4) <0x337>
  <2><335>: Abbrev Number: 18 (DW_TAG_subrange_type)
  <2><336>: Abbrev Number: 0
  <1><337>: Abbrev Number: 4 (DW_TAG_const_type)
     <338>   DW_AT_type        : (ref4) <0x32c>, char
  <1><33c>: Abbrev Number: 17 (DW_TAG_variable)
     <33d>   DW_AT_name        : (strp) (offset: 0x22): sys_errlist
-    <341>   DW_AT_decl_file   : (data1) 10
+    <341>   DW_AT_decl_file   : (data1) 11
     <342>   DW_AT_decl_line   : (data1) 27
     <343>   DW_AT_decl_column : (data1) 26
     <344>   DW_AT_type        : (ref4) <0x337>, char
     <348>   DW_AT_external    : (flag_present) 1
     <348>   DW_AT_declaration : (flag_present) 1
  <1><348>: Abbrev Number: 17 (DW_TAG_variable)
-    <349>   DW_AT_name        : (strp) (offset: 0x2299): _sys_nerr
-    <34d>   DW_AT_decl_file   : (data1) 10
+    <349>   DW_AT_name        : (strp) (offset: 0x22e0): _sys_nerr
+    <34d>   DW_AT_decl_file   : (data1) 11
     <34e>   DW_AT_decl_line   : (data1) 30
     <34f>   DW_AT_decl_column : (data1) 12
     <350>   DW_AT_type        : (ref4) <0x76>, int
     <354>   DW_AT_external    : (flag_present) 1
     <354>   DW_AT_declaration : (flag_present) 1
  <1><354>: Abbrev Number: 17 (DW_TAG_variable)
     <355>   DW_AT_name        : (strp) (offset: 0x21): _sys_errlist
-    <359>   DW_AT_decl_file   : (data1) 10
+    <359>   DW_AT_decl_file   : (data1) 11
     <35a>   DW_AT_decl_line   : (data1) 31
     <35b>   DW_AT_decl_column : (data1) 26
     <35c>   DW_AT_type        : (ref4) <0x337>, char
     <360>   DW_AT_external    : (flag_present) 1
     <360>   DW_AT_declaration : (flag_present) 1
  <1><360>: Abbrev Number: 17 (DW_TAG_variable)
-    <361>   DW_AT_name        : (strp) (offset: 0x1f93): program_invocation_name
-    <365>   DW_AT_decl_file   : (data1) 11
+    <361>   DW_AT_name        : (strp) (offset: 0x1fda): program_invocation_name
+    <365>   DW_AT_decl_file   : (data1) 12
     <366>   DW_AT_decl_line   : (data1) 45
     <367>   DW_AT_decl_column : (data1) 14
     <368>   DW_AT_type        : (ref4) <0xc0>, char
     <36c>   DW_AT_external    : (flag_present) 1
     <36c>   DW_AT_declaration : (flag_present) 1
  <1><36c>: Abbrev Number: 17 (DW_TAG_variable)
-    <36d>   DW_AT_name        : (strp) (offset: 0x130a): program_invocation_short_name
-    <371>   DW_AT_decl_file   : (data1) 11
+    <36d>   DW_AT_name        : (strp) (offset: 0x1336): program_invocation_short_name
+    <371>   DW_AT_decl_file   : (data1) 12
     <372>   DW_AT_decl_line   : (data1) 46
     <373>   DW_AT_decl_column : (data1) 14
     <374>   DW_AT_type        : (ref4) <0xc0>, char
     <378>   DW_AT_external    : (flag_present) 1
     <378>   DW_AT_declaration : (flag_present) 1
  <1><378>: Abbrev Number: 2 (DW_TAG_base_type)
     <379>   DW_AT_byte_size   : (data1) 8
     <37a>   DW_AT_encoding    : (data1) 5	(signed)
-    <37b>   DW_AT_name        : (strp) (offset: 0x23f4): long long int
+    <37b>   DW_AT_name        : (strp) (offset: 0x243b): long long int
  <1><37f>: Abbrev Number: 2 (DW_TAG_base_type)
     <380>   DW_AT_byte_size   : (data1) 8
     <381>   DW_AT_encoding    : (data1) 7	(unsigned)
-    <382>   DW_AT_name        : (strp) (offset: 0x20e4): long long unsigned int
+    <382>   DW_AT_name        : (strp) (offset: 0x212b): long long unsigned int
  <1><386>: Abbrev Number: 7 (DW_TAG_pointer_type)
     <387>   DW_AT_byte_size   : (data1) 8
     <388>   DW_AT_type        : (ref4) <0x38c>
  <1><38c>: Abbrev Number: 19 (DW_TAG_const_type)
  <1><38d>: Abbrev Number: 15 (DW_TAG_subroutine_type)
     <38e>   DW_AT_prototyped  : (flag_present) 1
     <38e>   DW_AT_type        : (ref4) <0x76>, int
@@ -490,239 +490,239 @@
     <397>   DW_AT_type        : (ref4) <0x386>
  <2><39b>: Abbrev Number: 16 (DW_TAG_formal_parameter)
     <39c>   DW_AT_type        : (ref4) <0x386>
  <2><3a0>: Abbrev Number: 16 (DW_TAG_formal_parameter)
     <3a1>   DW_AT_type        : (ref4) <0x53>
  <2><3a5>: Abbrev Number: 0
  <1><3a6>: Abbrev Number: 20 (DW_TAG_typedef)
-    <3a7>   DW_AT_name        : (strp) (offset: 0x931): intptr_t
-    <3ab>   DW_AT_decl_file   : (data1) 12
+    <3a7>   DW_AT_name        : (strp) (offset: 0x93f): intptr_t
+    <3ab>   DW_AT_decl_file   : (data1) 13
     <3ac>   DW_AT_decl_line   : (data2) 267
     <3ae>   DW_AT_decl_column : (data1) 20
     <3af>   DW_AT_type        : (ref4) <0xd2>, __intptr_t, long int
  <1><3b3>: Abbrev Number: 21 (DW_TAG_variable)
     <3b4>   DW_AT_name        : (strp) (offset: 0x253): __environ
-    <3b8>   DW_AT_decl_file   : (data1) 12
+    <3b8>   DW_AT_decl_file   : (data1) 13
     <3b9>   DW_AT_decl_line   : (data2) 543
     <3bb>   DW_AT_decl_column : (data1) 15
     <3bc>   DW_AT_type        : (ref4) <0x3c0>, char
     <3c0>   DW_AT_external    : (flag_present) 1
     <3c0>   DW_AT_declaration : (flag_present) 1
  <1><3c0>: Abbrev Number: 7 (DW_TAG_pointer_type)
     <3c1>   DW_AT_byte_size   : (data1) 8
     <3c2>   DW_AT_type        : (ref4) <0xc0>, char
  <1><3c6>: Abbrev Number: 21 (DW_TAG_variable)
     <3c7>   DW_AT_name        : (strp) (offset: 0x255): environ
-    <3cb>   DW_AT_decl_file   : (data1) 12
+    <3cb>   DW_AT_decl_file   : (data1) 13
     <3cc>   DW_AT_decl_line   : (data2) 545
     <3ce>   DW_AT_decl_column : (data1) 15
     <3cf>   DW_AT_type        : (ref4) <0x3c0>, char
     <3d3>   DW_AT_external    : (flag_present) 1
     <3d3>   DW_AT_declaration : (flag_present) 1
  <1><3d3>: Abbrev Number: 17 (DW_TAG_variable)
     <3d4>   DW_AT_name        : (strp) (offset: 0x7f0): optarg
-    <3d8>   DW_AT_decl_file   : (data1) 13
+    <3d8>   DW_AT_decl_file   : (data1) 14
     <3d9>   DW_AT_decl_line   : (data1) 36
     <3da>   DW_AT_decl_column : (data1) 14
     <3db>   DW_AT_type        : (ref4) <0xc0>, char
     <3df>   DW_AT_external    : (flag_present) 1
     <3df>   DW_AT_declaration : (flag_present) 1
  <1><3df>: Abbrev Number: 17 (DW_TAG_variable)
-    <3e0>   DW_AT_name        : (strp) (offset: 0x23c0): optind
-    <3e4>   DW_AT_decl_file   : (data1) 13
+    <3e0>   DW_AT_name        : (strp) (offset: 0x2407): optind
+    <3e4>   DW_AT_decl_file   : (data1) 14
     <3e5>   DW_AT_decl_line   : (data1) 50
     <3e6>   DW_AT_decl_column : (data1) 12
     <3e7>   DW_AT_type        : (ref4) <0x76>, int
     <3eb>   DW_AT_external    : (flag_present) 1
     <3eb>   DW_AT_declaration : (flag_present) 1
  <1><3eb>: Abbrev Number: 17 (DW_TAG_variable)
-    <3ec>   DW_AT_name        : (strp) (offset: 0x16ef): opterr
-    <3f0>   DW_AT_decl_file   : (data1) 13
+    <3ec>   DW_AT_name        : (strp) (offset: 0x171b): opterr
+    <3f0>   DW_AT_decl_file   : (data1) 14
     <3f1>   DW_AT_decl_line   : (data1) 55
     <3f2>   DW_AT_decl_column : (data1) 12
     <3f3>   DW_AT_type        : (ref4) <0x76>, int
     <3f7>   DW_AT_external    : (flag_present) 1
     <3f7>   DW_AT_declaration : (flag_present) 1
  <1><3f7>: Abbrev Number: 17 (DW_TAG_variable)
-    <3f8>   DW_AT_name        : (strp) (offset: 0x13dc): optopt
-    <3fc>   DW_AT_decl_file   : (data1) 13
+    <3f8>   DW_AT_name        : (strp) (offset: 0x1408): optopt
+    <3fc>   DW_AT_decl_file   : (data1) 14
     <3fd>   DW_AT_decl_line   : (data1) 59
     <3fe>   DW_AT_decl_column : (data1) 12
     <3ff>   DW_AT_type        : (ref4) <0x76>, int
     <403>   DW_AT_external    : (flag_present) 1
     <403>   DW_AT_declaration : (flag_present) 1
  <1><403>: Abbrev Number: 3 (DW_TAG_typedef)
-    <404>   DW_AT_name        : (strp) (offset: 0x1e33): uint32_t
-    <408>   DW_AT_decl_file   : (data1) 14
+    <404>   DW_AT_name        : (strp) (offset: 0x1e7a): uint32_t
+    <408>   DW_AT_decl_file   : (data1) 15
     <409>   DW_AT_decl_line   : (data1) 26
     <40a>   DW_AT_decl_column : (data1) 20
     <40b>   DW_AT_type        : (ref4) <0x7d>, __uint32_t, unsigned int
  <1><40f>: Abbrev Number: 3 (DW_TAG_typedef)
-    <410>   DW_AT_name        : (strp) (offset: 0x1057): uint64_t
-    <414>   DW_AT_decl_file   : (data1) 14
+    <410>   DW_AT_name        : (strp) (offset: 0x1076): uint64_t
+    <414>   DW_AT_decl_file   : (data1) 15
     <415>   DW_AT_decl_line   : (data1) 27
     <416>   DW_AT_decl_column : (data1) 20
     <417>   DW_AT_type        : (ref4) <0x90>, __uint64_t, long unsigned int
  <1><41b>: Abbrev Number: 3 (DW_TAG_typedef)
-    <41c>   DW_AT_name        : (strp) (offset: 0x1938): Py_intptr_t
-    <420>   DW_AT_decl_file   : (data1) 15
+    <41c>   DW_AT_name        : (strp) (offset: 0x196f): Py_intptr_t
+    <420>   DW_AT_decl_file   : (data1) 16
     <421>   DW_AT_decl_line   : (data1) 98
     <422>   DW_AT_decl_column : (data1) 25
     <423>   DW_AT_type        : (ref4) <0x3a6>, intptr_t, __intptr_t, long int
  <1><427>: Abbrev Number: 3 (DW_TAG_typedef)
-    <428>   DW_AT_name        : (strp) (offset: 0x22e2): Py_ssize_t
-    <42c>   DW_AT_decl_file   : (data1) 15
+    <428>   DW_AT_name        : (strp) (offset: 0x2329): Py_ssize_t
+    <42c>   DW_AT_decl_file   : (data1) 16
     <42d>   DW_AT_decl_line   : (data1) 105
     <42e>   DW_AT_decl_column : (data1) 25
     <42f>   DW_AT_type        : (ref4) <0x2e5>, ssize_t, __ssize_t, long int
  <1><433>: Abbrev Number: 3 (DW_TAG_typedef)
-    <434>   DW_AT_name        : (strp) (offset: 0x103f): Py_hash_t
-    <438>   DW_AT_decl_file   : (data1) 15
+    <434>   DW_AT_name        : (strp) (offset: 0x105e): Py_hash_t
+    <438>   DW_AT_decl_file   : (data1) 16
     <439>   DW_AT_decl_line   : (data1) 114
     <43a>   DW_AT_decl_column : (data1) 20
     <43b>   DW_AT_type        : (ref4) <0x427>, Py_ssize_t, ssize_t, __ssize_t, long int
  <1><43f>: Abbrev Number: 2 (DW_TAG_base_type)
     <440>   DW_AT_byte_size   : (data1) 4
     <441>   DW_AT_encoding    : (data1) 4	(float)
-    <442>   DW_AT_name        : (strp) (offset: 0x1890): float
+    <442>   DW_AT_name        : (strp) (offset: 0x18c7): float
  <1><446>: Abbrev Number: 21 (DW_TAG_variable)
-    <447>   DW_AT_name        : (strp) (offset: 0x100b): signgam
-    <44b>   DW_AT_decl_file   : (data1) 16
+    <447>   DW_AT_name        : (strp) (offset: 0x102a): signgam
+    <44b>   DW_AT_decl_file   : (data1) 17
     <44c>   DW_AT_decl_line   : (data2) 773
     <44e>   DW_AT_decl_column : (data1) 12
     <44f>   DW_AT_type        : (ref4) <0x76>, int
     <453>   DW_AT_external    : (flag_present) 1
     <453>   DW_AT_declaration : (flag_present) 1
  <1><453>: Abbrev Number: 12 (DW_TAG_array_type)
     <454>   DW_AT_type        : (ref4) <0xc0>, char
     <458>   DW_AT_sibling     : (ref4) <0x463>
  <2><45c>: Abbrev Number: 13 (DW_TAG_subrange_type)
     <45d>   DW_AT_type        : (ref4) <0x40>, long unsigned int
     <461>   DW_AT_upper_bound : (data1) 1
  <2><462>: Abbrev Number: 0
  <1><463>: Abbrev Number: 17 (DW_TAG_variable)
     <464>   DW_AT_name        : (strp) (offset: 0x68f): __tzname
-    <468>   DW_AT_decl_file   : (data1) 17
+    <468>   DW_AT_decl_file   : (data1) 18
     <469>   DW_AT_decl_line   : (data1) 159
     <46a>   DW_AT_decl_column : (data1) 14
     <46b>   DW_AT_type        : (ref4) <0x453>, char
     <46f>   DW_AT_external    : (flag_present) 1
     <46f>   DW_AT_declaration : (flag_present) 1
  <1><46f>: Abbrev Number: 17 (DW_TAG_variable)
-    <470>   DW_AT_name        : (strp) (offset: 0x1e51): __daylight
-    <474>   DW_AT_decl_file   : (data1) 17
+    <470>   DW_AT_name        : (strp) (offset: 0x1e98): __daylight
+    <474>   DW_AT_decl_file   : (data1) 18
     <475>   DW_AT_decl_line   : (data1) 160
     <476>   DW_AT_decl_column : (data1) 12
     <477>   DW_AT_type        : (ref4) <0x76>, int
     <47b>   DW_AT_external    : (flag_present) 1
     <47b>   DW_AT_declaration : (flag_present) 1
  <1><47b>: Abbrev Number: 17 (DW_TAG_variable)
-    <47c>   DW_AT_name        : (strp) (offset: 0x11e7): __timezone
-    <480>   DW_AT_decl_file   : (data1) 17
+    <47c>   DW_AT_name        : (strp) (offset: 0x1213): __timezone
+    <480>   DW_AT_decl_file   : (data1) 18
     <481>   DW_AT_decl_line   : (data1) 161
     <482>   DW_AT_decl_column : (data1) 17
     <483>   DW_AT_type        : (ref4) <0x89>, long int
     <487>   DW_AT_external    : (flag_present) 1
     <487>   DW_AT_declaration : (flag_present) 1
  <1><487>: Abbrev Number: 17 (DW_TAG_variable)
     <488>   DW_AT_name        : (strp) (offset: 0x691): tzname
-    <48c>   DW_AT_decl_file   : (data1) 17
+    <48c>   DW_AT_decl_file   : (data1) 18
     <48d>   DW_AT_decl_line   : (data1) 166
     <48e>   DW_AT_decl_column : (data1) 14
     <48f>   DW_AT_type        : (ref4) <0x453>, char
     <493>   DW_AT_external    : (flag_present) 1
     <493>   DW_AT_declaration : (flag_present) 1
  <1><493>: Abbrev Number: 17 (DW_TAG_variable)
-    <494>   DW_AT_name        : (strp) (offset: 0x1e53): daylight
-    <498>   DW_AT_decl_file   : (data1) 17
+    <494>   DW_AT_name        : (strp) (offset: 0x1e9a): daylight
+    <498>   DW_AT_decl_file   : (data1) 18
     <499>   DW_AT_decl_line   : (data1) 174
     <49a>   DW_AT_decl_column : (data1) 12
     <49b>   DW_AT_type        : (ref4) <0x76>, int
     <49f>   DW_AT_external    : (flag_present) 1
     <49f>   DW_AT_declaration : (flag_present) 1
  <1><49f>: Abbrev Number: 17 (DW_TAG_variable)
-    <4a0>   DW_AT_name        : (strp) (offset: 0x11e9): timezone
-    <4a4>   DW_AT_decl_file   : (data1) 17
+    <4a0>   DW_AT_name        : (strp) (offset: 0x1215): timezone
+    <4a4>   DW_AT_decl_file   : (data1) 18
     <4a5>   DW_AT_decl_line   : (data1) 175
     <4a6>   DW_AT_decl_column : (data1) 17
     <4a7>   DW_AT_type        : (ref4) <0x89>, long int
     <4ab>   DW_AT_external    : (flag_present) 1
     <4ab>   DW_AT_declaration : (flag_present) 1
  <1><4ab>: Abbrev Number: 21 (DW_TAG_variable)
-    <4ac>   DW_AT_name        : (strp) (offset: 0xdd6): getdate_err
-    <4b0>   DW_AT_decl_file   : (data1) 17
+    <4ac>   DW_AT_name        : (strp) (offset: 0xdf5): getdate_err
+    <4b0>   DW_AT_decl_file   : (data1) 18
     <4b1>   DW_AT_decl_line   : (data2) 274
     <4b3>   DW_AT_decl_column : (data1) 12
     <4b4>   DW_AT_type        : (ref4) <0x76>, int
     <4b8>   DW_AT_external    : (flag_present) 1
     <4b8>   DW_AT_declaration : (flag_present) 1
  <1><4b8>: Abbrev Number: 22 (DW_TAG_enumeration_type)
     <4b9>   DW_AT_encoding    : (data1) 7	(unsigned)
     <4ba>   DW_AT_byte_size   : (data1) 4
     <4bb>   DW_AT_type        : (ref4) <0x47>, unsigned int
-    <4bf>   DW_AT_decl_file   : (data1) 18
+    <4bf>   DW_AT_decl_file   : (data1) 19
     <4c0>   DW_AT_decl_line   : (data1) 112
     <4c1>   DW_AT_decl_column : (data1) 10
     <4c2>   DW_AT_sibling     : (ref4) <0x4d9>
  <2><4c6>: Abbrev Number: 23 (DW_TAG_enumerator)
     <4c7>   DW_AT_name        : (strp) (offset: 0x3ea): TRACEMALLOC_NOT_INITIALIZED
     <4cb>   DW_AT_const_value : (data1) 0
  <2><4cc>: Abbrev Number: 23 (DW_TAG_enumerator)
     <4cd>   DW_AT_name        : (strp) (offset: 0x77f): TRACEMALLOC_INITIALIZED
     <4d1>   DW_AT_const_value : (data1) 1
  <2><4d2>: Abbrev Number: 23 (DW_TAG_enumerator)
-    <4d3>   DW_AT_name        : (strp) (offset: 0xdc0): TRACEMALLOC_FINALIZED
+    <4d3>   DW_AT_name        : (strp) (offset: 0xddf): TRACEMALLOC_FINALIZED
     <4d7>   DW_AT_const_value : (data1) 2
  <2><4d8>: Abbrev Number: 0
  <1><4d9>: Abbrev Number: 8 (DW_TAG_structure_type)
-    <4da>   DW_AT_name        : (strp) (offset: 0x10fc): _PyTraceMalloc_Config
+    <4da>   DW_AT_name        : (strp) (offset: 0x111b): _PyTraceMalloc_Config
     <4de>   DW_AT_byte_size   : (data1) 16
-    <4df>   DW_AT_decl_file   : (data1) 18
+    <4df>   DW_AT_decl_file   : (data1) 19
     <4e0>   DW_AT_decl_line   : (data1) 109
     <4e1>   DW_AT_decl_column : (data1) 8
     <4e2>   DW_AT_sibling     : (ref4) <0x51b>
  <2><4e6>: Abbrev Number: 9 (DW_TAG_member)
-    <4e7>   DW_AT_name        : (strp) (offset: 0xa76): initialized
-    <4eb>   DW_AT_decl_file   : (data1) 18
+    <4e7>   DW_AT_name        : (strp) (offset: 0xa95): initialized
+    <4eb>   DW_AT_decl_file   : (data1) 19
     <4ec>   DW_AT_decl_line   : (data1) 116
     <4ed>   DW_AT_decl_column : (data1) 7
     <4ee>   DW_AT_type        : (ref4) <0x4b8>, unsigned int
     <4f2>   DW_AT_data_member_location: (data1) 0
  <2><4f3>: Abbrev Number: 9 (DW_TAG_member)
-    <4f4>   DW_AT_name        : (strp) (offset: 0xbe6): tracing
-    <4f8>   DW_AT_decl_file   : (data1) 18
+    <4f4>   DW_AT_name        : (strp) (offset: 0xc05): tracing
+    <4f8>   DW_AT_decl_file   : (data1) 19
     <4f9>   DW_AT_decl_line   : (data1) 120
     <4fa>   DW_AT_decl_column : (data1) 9
     <4fb>   DW_AT_type        : (ref4) <0x76>, int
     <4ff>   DW_AT_data_member_location: (data1) 4
  <2><500>: Abbrev Number: 9 (DW_TAG_member)
-    <501>   DW_AT_name        : (strp) (offset: 0x16fd): max_nframe
-    <505>   DW_AT_decl_file   : (data1) 18
+    <501>   DW_AT_name        : (strp) (offset: 0x1735): max_nframe
+    <505>   DW_AT_decl_file   : (data1) 19
     <506>   DW_AT_decl_line   : (data1) 124
     <507>   DW_AT_decl_column : (data1) 9
     <508>   DW_AT_type        : (ref4) <0x76>, int
     <50c>   DW_AT_data_member_location: (data1) 8
  <2><50d>: Abbrev Number: 9 (DW_TAG_member)
-    <50e>   DW_AT_name        : (strp) (offset: 0x13c2): use_domain
-    <512>   DW_AT_decl_file   : (data1) 18
+    <50e>   DW_AT_name        : (strp) (offset: 0x13ee): use_domain
+    <512>   DW_AT_decl_file   : (data1) 19
     <513>   DW_AT_decl_line   : (data1) 128
     <514>   DW_AT_decl_column : (data1) 9
     <515>   DW_AT_type        : (ref4) <0x76>, int
     <519>   DW_AT_data_member_location: (data1) 12
  <2><51a>: Abbrev Number: 0
  <1><51b>: Abbrev Number: 17 (DW_TAG_variable)
-    <51c>   DW_AT_name        : (strp) (offset: 0xfd6): _Py_tracemalloc_config
-    <520>   DW_AT_decl_file   : (data1) 18
+    <51c>   DW_AT_name        : (strp) (offset: 0xff5): _Py_tracemalloc_config
+    <520>   DW_AT_decl_file   : (data1) 19
     <521>   DW_AT_decl_line   : (data1) 131
     <522>   DW_AT_decl_column : (data1) 42
     <523>   DW_AT_type        : (ref4) <0x4d9>, _PyTraceMalloc_Config
     <527>   DW_AT_external    : (flag_present) 1
     <527>   DW_AT_declaration : (flag_present) 1
  <1><527>: Abbrev Number: 8 (DW_TAG_structure_type)
-    <528>   DW_AT_name        : (strp) (offset: 0x2179): _object
+    <528>   DW_AT_name        : (strp) (offset: 0x21c0): _object
     <52c>   DW_AT_byte_size   : (data1) 16
     <52d>   DW_AT_decl_file   : (data1) 3
     <52e>   DW_AT_decl_line   : (data1) 104
     <52f>   DW_AT_decl_column : (data1) 16
     <530>   DW_AT_sibling     : (ref4) <0x54f>
  <2><534>: Abbrev Number: 9 (DW_TAG_member)
     <535>   DW_AT_name        : (strp) (offset: 0x111): ob_refcnt
@@ -738,407 +738,407 @@
     <548>   DW_AT_decl_column : (data1) 25
     <549>   DW_AT_type        : (ref4) <0x7ff>, _typeobject
     <54d>   DW_AT_data_member_location: (data1) 8
  <2><54e>: Abbrev Number: 0
  <1><54f>: Abbrev Number: 24 (DW_TAG_structure_type)
     <550>   DW_AT_name        : (strp) (offset: 0x420): _typeobject
     <554>   DW_AT_byte_size   : (data2) 416
-    <556>   DW_AT_decl_file   : (data1) 19
+    <556>   DW_AT_decl_file   : (data1) 20
     <557>   DW_AT_decl_line   : (data1) 177
     <558>   DW_AT_decl_column : (data1) 16
     <559>   DW_AT_sibling     : (ref4) <0x7ff>
  <2><55d>: Abbrev Number: 9 (DW_TAG_member)
-    <55e>   DW_AT_name        : (strp) (offset: 0x8bf): ob_base
-    <562>   DW_AT_decl_file   : (data1) 19
+    <55e>   DW_AT_name        : (strp) (offset: 0x8cd): ob_base
+    <562>   DW_AT_decl_file   : (data1) 20
     <563>   DW_AT_decl_line   : (data1) 178
     <564>   DW_AT_decl_column : (data1) 5
     <565>   DW_AT_type        : (ref4) <0x835>, PyVarObject
     <569>   DW_AT_data_member_location: (data1) 0
  <2><56a>: Abbrev Number: 9 (DW_TAG_member)
-    <56b>   DW_AT_name        : (strp) (offset: 0x13d4): tp_name
-    <56f>   DW_AT_decl_file   : (data1) 19
+    <56b>   DW_AT_name        : (strp) (offset: 0x1400): tp_name
+    <56f>   DW_AT_decl_file   : (data1) 20
     <570>   DW_AT_decl_line   : (data1) 179
     <571>   DW_AT_decl_column : (data1) 17
     <572>   DW_AT_type        : (ref4) <0x2c6>, char
     <576>   DW_AT_data_member_location: (data1) 24
  <2><577>: Abbrev Number: 9 (DW_TAG_member)
-    <578>   DW_AT_name        : (strp) (offset: 0x274c): tp_basicsize
-    <57c>   DW_AT_decl_file   : (data1) 19
+    <578>   DW_AT_name        : (strp) (offset: 0x2793): tp_basicsize
+    <57c>   DW_AT_decl_file   : (data1) 20
     <57d>   DW_AT_decl_line   : (data1) 180
     <57e>   DW_AT_decl_column : (data1) 16
     <57f>   DW_AT_type        : (ref4) <0x427>, Py_ssize_t, ssize_t, __ssize_t, long int
     <583>   DW_AT_data_member_location: (data1) 32
  <2><584>: Abbrev Number: 9 (DW_TAG_member)
     <585>   DW_AT_name        : (strp) (offset: 0x2ad): tp_itemsize
-    <589>   DW_AT_decl_file   : (data1) 19
+    <589>   DW_AT_decl_file   : (data1) 20
     <58a>   DW_AT_decl_line   : (data1) 180
     <58b>   DW_AT_decl_column : (data1) 30
     <58c>   DW_AT_type        : (ref4) <0x427>, Py_ssize_t, ssize_t, __ssize_t, long int
     <590>   DW_AT_data_member_location: (data1) 40
  <2><591>: Abbrev Number: 9 (DW_TAG_member)
     <592>   DW_AT_name        : (strp) (offset: 0x3df): tp_dealloc
-    <596>   DW_AT_decl_file   : (data1) 19
+    <596>   DW_AT_decl_file   : (data1) 20
     <597>   DW_AT_decl_line   : (data1) 184
     <598>   DW_AT_decl_column : (data1) 16
     <599>   DW_AT_type        : (ref4) <0xa10>, destructor
     <59d>   DW_AT_data_member_location: (data1) 48
  <2><59e>: Abbrev Number: 9 (DW_TAG_member)
-    <59f>   DW_AT_name        : (strp) (offset: 0x18f3): tp_vectorcall_offset
-    <5a3>   DW_AT_decl_file   : (data1) 19
+    <59f>   DW_AT_name        : (strp) (offset: 0x192a): tp_vectorcall_offset
+    <5a3>   DW_AT_decl_file   : (data1) 20
     <5a4>   DW_AT_decl_line   : (data1) 185
     <5a5>   DW_AT_decl_column : (data1) 16
     <5a6>   DW_AT_type        : (ref4) <0x427>, Py_ssize_t, ssize_t, __ssize_t, long int
     <5aa>   DW_AT_data_member_location: (data1) 56
  <2><5ab>: Abbrev Number: 9 (DW_TAG_member)
     <5ac>   DW_AT_name        : (strp) (offset: 0x8b): tp_getattr
-    <5b0>   DW_AT_decl_file   : (data1) 19
+    <5b0>   DW_AT_decl_file   : (data1) 20
     <5b1>   DW_AT_decl_line   : (data1) 186
     <5b2>   DW_AT_decl_column : (data1) 17
     <5b3>   DW_AT_type        : (ref4) <0xa2d>, getattrfunc, PyObject, _object
     <5b7>   DW_AT_data_member_location: (data1) 64
  <2><5b8>: Abbrev Number: 9 (DW_TAG_member)
-    <5b9>   DW_AT_name        : (strp) (offset: 0x99d): tp_setattr
-    <5bd>   DW_AT_decl_file   : (data1) 19
+    <5b9>   DW_AT_name        : (strp) (offset: 0x9bc): tp_setattr
+    <5bd>   DW_AT_decl_file   : (data1) 20
     <5be>   DW_AT_decl_line   : (data1) 187
     <5bf>   DW_AT_decl_column : (data1) 17
     <5c0>   DW_AT_type        : (ref4) <0xa5f>, setattrfunc, int
     <5c4>   DW_AT_data_member_location: (data1) 72
  <2><5c5>: Abbrev Number: 9 (DW_TAG_member)
     <5c6>   DW_AT_name        : (strp) (offset: 0x196): tp_as_async
-    <5ca>   DW_AT_decl_file   : (data1) 19
+    <5ca>   DW_AT_decl_file   : (data1) 20
     <5cb>   DW_AT_decl_line   : (data1) 188
     <5cc>   DW_AT_decl_column : (data1) 21
     <5cd>   DW_AT_type        : (ref4) <0x1022>, PyAsyncMethods
     <5d1>   DW_AT_data_member_location: (data1) 80
  <2><5d2>: Abbrev Number: 9 (DW_TAG_member)
-    <5d3>   DW_AT_name        : (strp) (offset: 0x22aa): tp_repr
-    <5d7>   DW_AT_decl_file   : (data1) 19
+    <5d3>   DW_AT_name        : (strp) (offset: 0x22f1): tp_repr
+    <5d7>   DW_AT_decl_file   : (data1) 20
     <5d8>   DW_AT_decl_line   : (data1) 190
     <5d9>   DW_AT_decl_column : (data1) 14
     <5da>   DW_AT_type        : (ref4) <0xa96>, reprfunc, PyObject, _object
     <5de>   DW_AT_data_member_location: (data1) 88
  <2><5df>: Abbrev Number: 9 (DW_TAG_member)
-    <5e0>   DW_AT_name        : (strp) (offset: 0x19bd): tp_as_number
-    <5e4>   DW_AT_decl_file   : (data1) 19
+    <5e0>   DW_AT_name        : (strp) (offset: 0x19f4): tp_as_number
+    <5e4>   DW_AT_decl_file   : (data1) 20
     <5e5>   DW_AT_decl_line   : (data1) 194
     <5e6>   DW_AT_decl_column : (data1) 22
     <5e7>   DW_AT_type        : (ref4) <0x1028>, PyNumberMethods
     <5eb>   DW_AT_data_member_location: (data1) 96
  <2><5ec>: Abbrev Number: 9 (DW_TAG_member)
-    <5ed>   DW_AT_name        : (strp) (offset: 0x1416): tp_as_sequence
-    <5f1>   DW_AT_decl_file   : (data1) 19
+    <5ed>   DW_AT_name        : (strp) (offset: 0x1442): tp_as_sequence
+    <5f1>   DW_AT_decl_file   : (data1) 20
     <5f2>   DW_AT_decl_line   : (data1) 195
     <5f3>   DW_AT_decl_column : (data1) 24
     <5f4>   DW_AT_type        : (ref4) <0x102e>, PySequenceMethods
     <5f8>   DW_AT_data_member_location: (data1) 104
  <2><5f9>: Abbrev Number: 9 (DW_TAG_member)
-    <5fa>   DW_AT_name        : (strp) (offset: 0xca3): tp_as_mapping
-    <5fe>   DW_AT_decl_file   : (data1) 19
+    <5fa>   DW_AT_name        : (strp) (offset: 0xcc2): tp_as_mapping
+    <5fe>   DW_AT_decl_file   : (data1) 20
     <5ff>   DW_AT_decl_line   : (data1) 196
     <600>   DW_AT_decl_column : (data1) 23
     <601>   DW_AT_type        : (ref4) <0x1034>, PyMappingMethods
     <605>   DW_AT_data_member_location: (data1) 112
  <2><606>: Abbrev Number: 9 (DW_TAG_member)
-    <607>   DW_AT_name        : (strp) (offset: 0x1bde): tp_hash
-    <60b>   DW_AT_decl_file   : (data1) 19
+    <607>   DW_AT_name        : (strp) (offset: 0x1c25): tp_hash
+    <60b>   DW_AT_decl_file   : (data1) 20
     <60c>   DW_AT_decl_line   : (data1) 200
     <60d>   DW_AT_decl_column : (data1) 14
     <60e>   DW_AT_type        : (ref4) <0xaa2>, hashfunc, Py_hash_t, Py_ssize_t, ssize_t, __ssize_t, long int
     <612>   DW_AT_data_member_location: (data1) 120
  <2><613>: Abbrev Number: 9 (DW_TAG_member)
     <614>   DW_AT_name        : (strp) (offset: 0x826): tp_call
-    <618>   DW_AT_decl_file   : (data1) 19
+    <618>   DW_AT_decl_file   : (data1) 20
     <619>   DW_AT_decl_line   : (data1) 201
     <61a>   DW_AT_decl_column : (data1) 17
     <61b>   DW_AT_type        : (ref4) <0x893>, ternaryfunc, PyObject, _object
     <61f>   DW_AT_data_member_location: (data1) 128
  <2><620>: Abbrev Number: 9 (DW_TAG_member)
     <621>   DW_AT_name        : (strp) (offset: 0x856): tp_str
-    <625>   DW_AT_decl_file   : (data1) 19
+    <625>   DW_AT_decl_file   : (data1) 20
     <626>   DW_AT_decl_line   : (data1) 202
     <627>   DW_AT_decl_column : (data1) 14
     <628>   DW_AT_type        : (ref4) <0xa96>, reprfunc, PyObject, _object
     <62c>   DW_AT_data_member_location: (data1) 136
  <2><62d>: Abbrev Number: 9 (DW_TAG_member)
-    <62e>   DW_AT_name        : (strp) (offset: 0x169c): tp_getattro
-    <632>   DW_AT_decl_file   : (data1) 19
+    <62e>   DW_AT_name        : (strp) (offset: 0x16c8): tp_getattro
+    <632>   DW_AT_decl_file   : (data1) 20
     <633>   DW_AT_decl_line   : (data1) 203
     <634>   DW_AT_decl_column : (data1) 18
     <635>   DW_AT_type        : (ref4) <0xa53>, getattrofunc, PyObject, _object
     <639>   DW_AT_data_member_location: (data1) 144
  <2><63a>: Abbrev Number: 9 (DW_TAG_member)
-    <63b>   DW_AT_name        : (strp) (offset: 0x1e10): tp_setattro
-    <63f>   DW_AT_decl_file   : (data1) 19
+    <63b>   DW_AT_name        : (strp) (offset: 0x1e57): tp_setattro
+    <63f>   DW_AT_decl_file   : (data1) 20
     <640>   DW_AT_decl_line   : (data1) 204
     <641>   DW_AT_decl_column : (data1) 18
     <642>   DW_AT_type        : (ref4) <0xa8a>, setattrofunc, int
     <646>   DW_AT_data_member_location: (data1) 152
  <2><647>: Abbrev Number: 9 (DW_TAG_member)
-    <648>   DW_AT_name        : (strp) (offset: 0x1425): tp_as_buffer
-    <64c>   DW_AT_decl_file   : (data1) 19
+    <648>   DW_AT_name        : (strp) (offset: 0x1451): tp_as_buffer
+    <64c>   DW_AT_decl_file   : (data1) 20
     <64d>   DW_AT_decl_line   : (data1) 207
     <64e>   DW_AT_decl_column : (data1) 20
     <64f>   DW_AT_type        : (ref4) <0x103a>, PyBufferProcs
     <653>   DW_AT_data_member_location: (data1) 160
  <2><654>: Abbrev Number: 9 (DW_TAG_member)
-    <655>   DW_AT_name        : (strp) (offset: 0x24df): tp_flags
-    <659>   DW_AT_decl_file   : (data1) 19
+    <655>   DW_AT_name        : (strp) (offset: 0x2526): tp_flags
+    <659>   DW_AT_decl_file   : (data1) 20
     <65a>   DW_AT_decl_line   : (data1) 210
     <65b>   DW_AT_decl_column : (data1) 19
     <65c>   DW_AT_type        : (ref4) <0x40>, long unsigned int
     <660>   DW_AT_data_member_location: (data1) 168
  <2><661>: Abbrev Number: 9 (DW_TAG_member)
-    <662>   DW_AT_name        : (strp) (offset: 0x1a35): tp_doc
-    <666>   DW_AT_decl_file   : (data1) 19
+    <662>   DW_AT_name        : (strp) (offset: 0x1a7c): tp_doc
+    <666>   DW_AT_decl_file   : (data1) 20
     <667>   DW_AT_decl_line   : (data1) 212
     <668>   DW_AT_decl_column : (data1) 17
     <669>   DW_AT_type        : (ref4) <0x2c6>, char
     <66d>   DW_AT_data_member_location: (data1) 176
  <2><66e>: Abbrev Number: 9 (DW_TAG_member)
-    <66f>   DW_AT_name        : (strp) (offset: 0x1d59): tp_traverse
-    <673>   DW_AT_decl_file   : (data1) 19
+    <66f>   DW_AT_name        : (strp) (offset: 0x1da0): tp_traverse
+    <673>   DW_AT_decl_file   : (data1) 20
     <674>   DW_AT_decl_line   : (data1) 216
     <675>   DW_AT_decl_column : (data1) 18
     <676>   DW_AT_type        : (ref4) <0x9c8>, traverseproc, int
     <67a>   DW_AT_data_member_location: (data1) 184
  <2><67b>: Abbrev Number: 9 (DW_TAG_member)
-    <67c>   DW_AT_name        : (strp) (offset: 0xb43): tp_clear
-    <680>   DW_AT_decl_file   : (data1) 19
+    <67c>   DW_AT_name        : (strp) (offset: 0xb62): tp_clear
+    <680>   DW_AT_decl_file   : (data1) 20
     <681>   DW_AT_decl_line   : (data1) 219
     <682>   DW_AT_decl_column : (data1) 13
     <683>   DW_AT_type        : (ref4) <0x8be>, inquiry, int
     <687>   DW_AT_data_member_location: (data1) 192
  <2><688>: Abbrev Number: 9 (DW_TAG_member)
     <689>   DW_AT_name        : (strp) (offset: 0x565): tp_richcompare
-    <68d>   DW_AT_decl_file   : (data1) 19
+    <68d>   DW_AT_decl_file   : (data1) 20
     <68e>   DW_AT_decl_line   : (data1) 223
     <68f>   DW_AT_decl_column : (data1) 17
     <690>   DW_AT_type        : (ref4) <0xac3>, richcmpfunc, PyObject, _object
     <694>   DW_AT_data_member_location: (data1) 200
  <2><695>: Abbrev Number: 9 (DW_TAG_member)
-    <696>   DW_AT_name        : (strp) (offset: 0x1a01): tp_weaklistoffset
-    <69a>   DW_AT_decl_file   : (data1) 19
+    <696>   DW_AT_name        : (strp) (offset: 0x1a48): tp_weaklistoffset
+    <69a>   DW_AT_decl_file   : (data1) 20
     <69b>   DW_AT_decl_line   : (data1) 226
     <69c>   DW_AT_decl_column : (data1) 16
     <69d>   DW_AT_type        : (ref4) <0x427>, Py_ssize_t, ssize_t, __ssize_t, long int
     <6a1>   DW_AT_data_member_location: (data1) 208
  <2><6a2>: Abbrev Number: 9 (DW_TAG_member)
-    <6a3>   DW_AT_name        : (strp) (offset: 0x1f45): tp_iter
-    <6a7>   DW_AT_decl_file   : (data1) 19
+    <6a3>   DW_AT_name        : (strp) (offset: 0x1f8c): tp_iter
+    <6a7>   DW_AT_decl_file   : (data1) 20
     <6a8>   DW_AT_decl_line   : (data1) 229
     <6a9>   DW_AT_decl_column : (data1) 17
     <6aa>   DW_AT_type        : (ref4) <0xaee>, getiterfunc, PyObject, _object
     <6ae>   DW_AT_data_member_location: (data1) 216
  <2><6af>: Abbrev Number: 9 (DW_TAG_member)
-    <6b0>   DW_AT_name        : (strp) (offset: 0x1ec9): tp_iternext
-    <6b4>   DW_AT_decl_file   : (data1) 19
+    <6b0>   DW_AT_name        : (strp) (offset: 0x1f10): tp_iternext
+    <6b4>   DW_AT_decl_file   : (data1) 20
     <6b5>   DW_AT_decl_line   : (data1) 230
     <6b6>   DW_AT_decl_column : (data1) 18
     <6b7>   DW_AT_type        : (ref4) <0xafa>, iternextfunc, PyObject, _object
     <6bb>   DW_AT_data_member_location: (data1) 224
  <2><6bc>: Abbrev Number: 9 (DW_TAG_member)
-    <6bd>   DW_AT_name        : (strp) (offset: 0x171e): tp_methods
-    <6c1>   DW_AT_decl_file   : (data1) 19
+    <6bd>   DW_AT_name        : (strp) (offset: 0x1756): tp_methods
+    <6c1>   DW_AT_decl_file   : (data1) 20
     <6c2>   DW_AT_decl_line   : (data1) 233
     <6c3>   DW_AT_decl_column : (data1) 25
     <6c4>   DW_AT_type        : (ref4) <0x1082>, PyMethodDef
     <6c8>   DW_AT_data_member_location: (data1) 232
  <2><6c9>: Abbrev Number: 9 (DW_TAG_member)
-    <6ca>   DW_AT_name        : (strp) (offset: 0x1d4e): tp_members
-    <6ce>   DW_AT_decl_file   : (data1) 19
+    <6ca>   DW_AT_name        : (strp) (offset: 0x1d95): tp_members
+    <6ce>   DW_AT_decl_file   : (data1) 20
     <6cf>   DW_AT_decl_line   : (data1) 234
     <6d0>   DW_AT_decl_column : (data1) 25
     <6d1>   DW_AT_type        : (ref4) <0x108d>, PyMemberDef
     <6d5>   DW_AT_data_member_location: (data1) 240
  <2><6d6>: Abbrev Number: 9 (DW_TAG_member)
-    <6d7>   DW_AT_name        : (strp) (offset: 0x1e8a): tp_getset
-    <6db>   DW_AT_decl_file   : (data1) 19
+    <6d7>   DW_AT_name        : (strp) (offset: 0x1ed1): tp_getset
+    <6db>   DW_AT_decl_file   : (data1) 20
     <6dc>   DW_AT_decl_line   : (data1) 235
     <6dd>   DW_AT_decl_column : (data1) 25
     <6de>   DW_AT_type        : (ref4) <0x10e2>, PyGetSetDef
     <6e2>   DW_AT_data_member_location: (data1) 248
  <2><6e3>: Abbrev Number: 25 (DW_TAG_member)
-    <6e4>   DW_AT_name        : (strp) (offset: 0x201d): tp_base
-    <6e8>   DW_AT_decl_file   : (data1) 19
+    <6e4>   DW_AT_name        : (strp) (offset: 0x2064): tp_base
+    <6e8>   DW_AT_decl_file   : (data1) 20
     <6e9>   DW_AT_decl_line   : (data1) 236
     <6ea>   DW_AT_decl_column : (data1) 25
     <6eb>   DW_AT_type        : (ref4) <0x7ff>, _typeobject
     <6ef>   DW_AT_data_member_location: (data2) 256
  <2><6f1>: Abbrev Number: 25 (DW_TAG_member)
-    <6f2>   DW_AT_name        : (strp) (offset: 0xc6f): tp_dict
-    <6f6>   DW_AT_decl_file   : (data1) 19
+    <6f2>   DW_AT_name        : (strp) (offset: 0xc8e): tp_dict
+    <6f6>   DW_AT_decl_file   : (data1) 20
     <6f7>   DW_AT_decl_line   : (data1) 237
     <6f8>   DW_AT_decl_column : (data1) 15
     <6f9>   DW_AT_type        : (ref4) <0x862>, PyObject, _object
     <6fd>   DW_AT_data_member_location: (data2) 264
  <2><6ff>: Abbrev Number: 25 (DW_TAG_member)
-    <700>   DW_AT_name        : (strp) (offset: 0x1f2a): tp_descr_get
-    <704>   DW_AT_decl_file   : (data1) 19
+    <700>   DW_AT_name        : (strp) (offset: 0x1f71): tp_descr_get
+    <704>   DW_AT_decl_file   : (data1) 20
     <705>   DW_AT_decl_line   : (data1) 238
     <706>   DW_AT_decl_column : (data1) 18
     <707>   DW_AT_type        : (ref4) <0xb06>, descrgetfunc, PyObject, _object
     <70b>   DW_AT_data_member_location: (data2) 272
  <2><70d>: Abbrev Number: 25 (DW_TAG_member)
-    <70e>   DW_AT_name        : (strp) (offset: 0x26b4): tp_descr_set
-    <712>   DW_AT_decl_file   : (data1) 19
+    <70e>   DW_AT_name        : (strp) (offset: 0x26fb): tp_descr_set
+    <712>   DW_AT_decl_file   : (data1) 20
     <713>   DW_AT_decl_line   : (data1) 239
     <714>   DW_AT_decl_column : (data1) 18
     <715>   DW_AT_type        : (ref4) <0xb12>, descrsetfunc, int
     <719>   DW_AT_data_member_location: (data2) 280
  <2><71b>: Abbrev Number: 25 (DW_TAG_member)
-    <71c>   DW_AT_name        : (strp) (offset: 0xabc): tp_dictoffset
-    <720>   DW_AT_decl_file   : (data1) 19
+    <71c>   DW_AT_name        : (strp) (offset: 0xadb): tp_dictoffset
+    <720>   DW_AT_decl_file   : (data1) 20
     <721>   DW_AT_decl_line   : (data1) 240
     <722>   DW_AT_decl_column : (data1) 16
     <723>   DW_AT_type        : (ref4) <0x427>, Py_ssize_t, ssize_t, __ssize_t, long int
     <727>   DW_AT_data_member_location: (data2) 288
  <2><729>: Abbrev Number: 25 (DW_TAG_member)
-    <72a>   DW_AT_name        : (strp) (offset: 0xc51): tp_init
-    <72e>   DW_AT_decl_file   : (data1) 19
+    <72a>   DW_AT_name        : (strp) (offset: 0xc70): tp_init
+    <72e>   DW_AT_decl_file   : (data1) 20
     <72f>   DW_AT_decl_line   : (data1) 241
     <730>   DW_AT_decl_column : (data1) 14
     <731>   DW_AT_type        : (ref4) <0xb1e>, initproc, int
     <735>   DW_AT_data_member_location: (data2) 296
  <2><737>: Abbrev Number: 25 (DW_TAG_member)
-    <738>   DW_AT_name        : (strp) (offset: 0x149e): tp_alloc
-    <73c>   DW_AT_decl_file   : (data1) 19
+    <738>   DW_AT_name        : (strp) (offset: 0x14ca): tp_alloc
+    <73c>   DW_AT_decl_file   : (data1) 20
     <73d>   DW_AT_decl_line   : (data1) 242
     <73e>   DW_AT_decl_column : (data1) 15
     <73f>   DW_AT_type        : (ref4) <0xb55>, allocfunc, PyObject, _object
     <743>   DW_AT_data_member_location: (data2) 304
  <2><745>: Abbrev Number: 25 (DW_TAG_member)
-    <746>   DW_AT_name        : (strp) (offset: 0x1250): tp_new
-    <74a>   DW_AT_decl_file   : (data1) 19
+    <746>   DW_AT_name        : (strp) (offset: 0x127c): tp_new
+    <74a>   DW_AT_decl_file   : (data1) 20
     <74b>   DW_AT_decl_line   : (data1) 243
     <74c>   DW_AT_decl_column : (data1) 13
     <74d>   DW_AT_type        : (ref4) <0xb2a>, newfunc, PyObject, _object
     <751>   DW_AT_data_member_location: (data2) 312
  <2><753>: Abbrev Number: 25 (DW_TAG_member)
     <754>   DW_AT_name        : (strp) (offset: 0x6f0): tp_free
-    <758>   DW_AT_decl_file   : (data1) 19
+    <758>   DW_AT_decl_file   : (data1) 20
     <759>   DW_AT_decl_line   : (data1) 244
     <75a>   DW_AT_decl_column : (data1) 14
     <75b>   DW_AT_type        : (ref4) <0x9f3>, freefunc
     <75f>   DW_AT_data_member_location: (data2) 320
  <2><761>: Abbrev Number: 25 (DW_TAG_member)
     <762>   DW_AT_name        : (strp) (offset: 0x1ee): tp_is_gc
-    <766>   DW_AT_decl_file   : (data1) 19
+    <766>   DW_AT_decl_file   : (data1) 20
     <767>   DW_AT_decl_line   : (data1) 245
     <768>   DW_AT_decl_column : (data1) 13
     <769>   DW_AT_type        : (ref4) <0x8be>, inquiry, int
     <76d>   DW_AT_data_member_location: (data2) 328
  <2><76f>: Abbrev Number: 25 (DW_TAG_member)
     <770>   DW_AT_name        : (strp) (offset: 0x33d): tp_bases
-    <774>   DW_AT_decl_file   : (data1) 19
+    <774>   DW_AT_decl_file   : (data1) 20
     <775>   DW_AT_decl_line   : (data1) 246
     <776>   DW_AT_decl_column : (data1) 15
     <777>   DW_AT_type        : (ref4) <0x862>, PyObject, _object
     <77b>   DW_AT_data_member_location: (data2) 336
  <2><77d>: Abbrev Number: 25 (DW_TAG_member)
-    <77e>   DW_AT_name        : (strp) (offset: 0x1747): tp_mro
-    <782>   DW_AT_decl_file   : (data1) 19
+    <77e>   DW_AT_name        : (strp) (offset: 0x177f): tp_mro
+    <782>   DW_AT_decl_file   : (data1) 20
     <783>   DW_AT_decl_line   : (data1) 247
     <784>   DW_AT_decl_column : (data1) 15
     <785>   DW_AT_type        : (ref4) <0x862>, PyObject, _object
     <789>   DW_AT_data_member_location: (data2) 344
  <2><78b>: Abbrev Number: 25 (DW_TAG_member)
-    <78c>   DW_AT_name        : (strp) (offset: 0x22c7): tp_cache
-    <790>   DW_AT_decl_file   : (data1) 19
+    <78c>   DW_AT_name        : (strp) (offset: 0x230e): tp_cache
+    <790>   DW_AT_decl_file   : (data1) 20
     <791>   DW_AT_decl_line   : (data1) 248
     <792>   DW_AT_decl_column : (data1) 15
     <793>   DW_AT_type        : (ref4) <0x862>, PyObject, _object
     <797>   DW_AT_data_member_location: (data2) 352
  <2><799>: Abbrev Number: 25 (DW_TAG_member)
-    <79a>   DW_AT_name        : (strp) (offset: 0x1daf): tp_subclasses
-    <79e>   DW_AT_decl_file   : (data1) 19
+    <79a>   DW_AT_name        : (strp) (offset: 0x1df6): tp_subclasses
+    <79e>   DW_AT_decl_file   : (data1) 20
     <79f>   DW_AT_decl_line   : (data1) 249
     <7a0>   DW_AT_decl_column : (data1) 15
     <7a1>   DW_AT_type        : (ref4) <0x862>, PyObject, _object
     <7a5>   DW_AT_data_member_location: (data2) 360
  <2><7a7>: Abbrev Number: 25 (DW_TAG_member)
-    <7a8>   DW_AT_name        : (strp) (offset: 0x1ac5): tp_weaklist
-    <7ac>   DW_AT_decl_file   : (data1) 19
+    <7a8>   DW_AT_name        : (strp) (offset: 0x1b0c): tp_weaklist
+    <7ac>   DW_AT_decl_file   : (data1) 20
     <7ad>   DW_AT_decl_line   : (data1) 250
     <7ae>   DW_AT_decl_column : (data1) 15
     <7af>   DW_AT_type        : (ref4) <0x862>, PyObject, _object
     <7b3>   DW_AT_data_member_location: (data2) 368
  <2><7b5>: Abbrev Number: 25 (DW_TAG_member)
-    <7b6>   DW_AT_name        : (strp) (offset: 0x1370): tp_del
-    <7ba>   DW_AT_decl_file   : (data1) 19
+    <7b6>   DW_AT_name        : (strp) (offset: 0x139c): tp_del
+    <7ba>   DW_AT_decl_file   : (data1) 20
     <7bb>   DW_AT_decl_line   : (data1) 251
     <7bc>   DW_AT_decl_column : (data1) 16
     <7bd>   DW_AT_type        : (ref4) <0xa10>, destructor
     <7c1>   DW_AT_data_member_location: (data2) 376
  <2><7c3>: Abbrev Number: 25 (DW_TAG_member)
-    <7c4>   DW_AT_name        : (strp) (offset: 0x1c4f): tp_version_tag
-    <7c8>   DW_AT_decl_file   : (data1) 19
+    <7c4>   DW_AT_name        : (strp) (offset: 0x1c96): tp_version_tag
+    <7c8>   DW_AT_decl_file   : (data1) 20
     <7c9>   DW_AT_decl_line   : (data1) 254
     <7ca>   DW_AT_decl_column : (data1) 18
     <7cb>   DW_AT_type        : (ref4) <0x47>, unsigned int
     <7cf>   DW_AT_data_member_location: (data2) 384
  <2><7d1>: Abbrev Number: 26 (DW_TAG_member)
-    <7d2>   DW_AT_name        : (strp) (offset: 0xafa): tp_finalize
-    <7d6>   DW_AT_decl_file   : (data1) 19
+    <7d2>   DW_AT_name        : (strp) (offset: 0xb19): tp_finalize
+    <7d6>   DW_AT_decl_file   : (data1) 20
     <7d7>   DW_AT_decl_line   : (data2) 256
     <7d9>   DW_AT_decl_column : (data1) 16
     <7da>   DW_AT_type        : (ref4) <0xa10>, destructor
     <7de>   DW_AT_data_member_location: (data2) 392
  <2><7e0>: Abbrev Number: 26 (DW_TAG_member)
-    <7e1>   DW_AT_name        : (strp) (offset: 0x1c2c): tp_vectorcall
-    <7e5>   DW_AT_decl_file   : (data1) 19
+    <7e1>   DW_AT_name        : (strp) (offset: 0x1c73): tp_vectorcall
+    <7e5>   DW_AT_decl_file   : (data1) 20
     <7e6>   DW_AT_decl_line   : (data2) 257
     <7e8>   DW_AT_decl_column : (data1) 20
     <7e9>   DW_AT_type        : (ref4) <0xcbb>, vectorcallfunc, PyObject, _object
     <7ed>   DW_AT_data_member_location: (data2) 400
  <2><7ef>: Abbrev Number: 26 (DW_TAG_member)
-    <7f0>   DW_AT_name        : (strp) (offset: 0x20db): tp_print
-    <7f4>   DW_AT_decl_file   : (data1) 19
+    <7f0>   DW_AT_name        : (strp) (offset: 0x2122): tp_print
+    <7f4>   DW_AT_decl_file   : (data1) 20
     <7f5>   DW_AT_decl_line   : (data2) 260
     <7f7>   DW_AT_decl_column : (data1) 30
     <7f8>   DW_AT_type        : (ref4) <0x1101>, int
     <7fc>   DW_AT_data_member_location: (data2) 408
  <2><7fe>: Abbrev Number: 0
  <1><7ff>: Abbrev Number: 7 (DW_TAG_pointer_type)
     <800>   DW_AT_byte_size   : (data1) 8
     <801>   DW_AT_type        : (ref4) <0x54f>, _typeobject
  <1><805>: Abbrev Number: 3 (DW_TAG_typedef)
-    <806>   DW_AT_name        : (strp) (offset: 0x1082): PyObject
+    <806>   DW_AT_name        : (strp) (offset: 0x10a1): PyObject
     <80a>   DW_AT_decl_file   : (data1) 3
     <80b>   DW_AT_decl_line   : (data1) 108
     <80c>   DW_AT_decl_column : (data1) 3
     <80d>   DW_AT_type        : (ref4) <0x527>, _object
  <1><811>: Abbrev Number: 27 (DW_TAG_structure_type)
     <812>   DW_AT_byte_size   : (data1) 24
     <813>   DW_AT_decl_file   : (data1) 3
     <814>   DW_AT_decl_line   : (data1) 113
     <815>   DW_AT_decl_column : (data1) 9
     <816>   DW_AT_sibling     : (ref4) <0x835>
  <2><81a>: Abbrev Number: 9 (DW_TAG_member)
-    <81b>   DW_AT_name        : (strp) (offset: 0x8bf): ob_base
+    <81b>   DW_AT_name        : (strp) (offset: 0x8cd): ob_base
     <81f>   DW_AT_decl_file   : (data1) 3
     <820>   DW_AT_decl_line   : (data1) 114
     <821>   DW_AT_decl_column : (data1) 14
     <822>   DW_AT_type        : (ref4) <0x805>, PyObject, _object
     <826>   DW_AT_data_member_location: (data1) 0
  <2><827>: Abbrev Number: 9 (DW_TAG_member)
-    <828>   DW_AT_name        : (strp) (offset: 0xc67): ob_size
+    <828>   DW_AT_name        : (strp) (offset: 0xc86): ob_size
     <82c>   DW_AT_decl_file   : (data1) 3
     <82d>   DW_AT_decl_line   : (data1) 115
     <82e>   DW_AT_decl_column : (data1) 16
     <82f>   DW_AT_type        : (ref4) <0x427>, Py_ssize_t, ssize_t, __ssize_t, long int
     <833>   DW_AT_data_member_location: (data1) 16
  <2><834>: Abbrev Number: 0
  <1><835>: Abbrev Number: 3 (DW_TAG_typedef)
     <836>   DW_AT_name        : (strp) (offset: 0x75d): PyVarObject
     <83a>   DW_AT_decl_file   : (data1) 3
     <83b>   DW_AT_decl_line   : (data1) 116
     <83c>   DW_AT_decl_column : (data1) 3
     <83d>   DW_AT_type        : (ref4) <0x811>
  <1><841>: Abbrev Number: 3 (DW_TAG_typedef)
-    <842>   DW_AT_name        : (strp) (offset: 0x1849): unaryfunc
+    <842>   DW_AT_name        : (strp) (offset: 0x188e): unaryfunc
     <846>   DW_AT_decl_file   : (data1) 3
     <847>   DW_AT_decl_line   : (data1) 140
     <848>   DW_AT_decl_column : (data1) 22
     <849>   DW_AT_type        : (ref4) <0x84d>, PyObject, _object
  <1><84d>: Abbrev Number: 7 (DW_TAG_pointer_type)
     <84e>   DW_AT_byte_size   : (data1) 8
     <84f>   DW_AT_type        : (ref4) <0x853>, PyObject, _object
@@ -1151,15 +1151,15 @@
  <2><861>: Abbrev Number: 0
  <1><862>: Abbrev Number: 7 (DW_TAG_pointer_type)
     <863>   DW_AT_byte_size   : (data1) 8
     <864>   DW_AT_type        : (ref4) <0x805>, PyObject, _object
  <1><868>: Abbrev Number: 4 (DW_TAG_const_type)
     <869>   DW_AT_type        : (ref4) <0x862>, PyObject, _object
  <1><86d>: Abbrev Number: 3 (DW_TAG_typedef)
-    <86e>   DW_AT_name        : (strp) (offset: 0xcf5): binaryfunc
+    <86e>   DW_AT_name        : (strp) (offset: 0xd14): binaryfunc
     <872>   DW_AT_decl_file   : (data1) 3
     <873>   DW_AT_decl_line   : (data1) 141
     <874>   DW_AT_decl_column : (data1) 22
     <875>   DW_AT_type        : (ref4) <0x879>, PyObject, _object
  <1><879>: Abbrev Number: 7 (DW_TAG_pointer_type)
     <87a>   DW_AT_byte_size   : (data1) 8
     <87b>   DW_AT_type        : (ref4) <0x87f>, PyObject, _object
@@ -1169,15 +1169,15 @@
     <884>   DW_AT_sibling     : (ref4) <0x893>
  <2><888>: Abbrev Number: 16 (DW_TAG_formal_parameter)
     <889>   DW_AT_type        : (ref4) <0x862>, PyObject, _object
  <2><88d>: Abbrev Number: 16 (DW_TAG_formal_parameter)
     <88e>   DW_AT_type        : (ref4) <0x862>, PyObject, _object
  <2><892>: Abbrev Number: 0
  <1><893>: Abbrev Number: 3 (DW_TAG_typedef)
-    <894>   DW_AT_name        : (strp) (offset: 0x89d): ternaryfunc
+    <894>   DW_AT_name        : (strp) (offset: 0x8ab): ternaryfunc
     <898>   DW_AT_decl_file   : (data1) 3
     <899>   DW_AT_decl_line   : (data1) 142
     <89a>   DW_AT_decl_column : (data1) 22
     <89b>   DW_AT_type        : (ref4) <0x89f>, PyObject, _object
  <1><89f>: Abbrev Number: 7 (DW_TAG_pointer_type)
     <8a0>   DW_AT_byte_size   : (data1) 8
     <8a1>   DW_AT_type        : (ref4) <0x8a5>, PyObject, _object
@@ -1189,15 +1189,15 @@
     <8af>   DW_AT_type        : (ref4) <0x862>, PyObject, _object
  <2><8b3>: Abbrev Number: 16 (DW_TAG_formal_parameter)
     <8b4>   DW_AT_type        : (ref4) <0x862>, PyObject, _object
  <2><8b8>: Abbrev Number: 16 (DW_TAG_formal_parameter)
     <8b9>   DW_AT_type        : (ref4) <0x862>, PyObject, _object
  <2><8bd>: Abbrev Number: 0
  <1><8be>: Abbrev Number: 3 (DW_TAG_typedef)
-    <8bf>   DW_AT_name        : (strp) (offset: 0x1908): inquiry
+    <8bf>   DW_AT_name        : (strp) (offset: 0x193f): inquiry
     <8c3>   DW_AT_decl_file   : (data1) 3
     <8c4>   DW_AT_decl_line   : (data1) 143
     <8c5>   DW_AT_decl_column : (data1) 15
     <8c6>   DW_AT_type        : (ref4) <0x8ca>, int
  <1><8ca>: Abbrev Number: 7 (DW_TAG_pointer_type)
     <8cb>   DW_AT_byte_size   : (data1) 8
     <8cc>   DW_AT_type        : (ref4) <0x8d0>, int
@@ -1221,15 +1221,15 @@
     <8f2>   DW_AT_prototyped  : (flag_present) 1
     <8f2>   DW_AT_type        : (ref4) <0x427>, Py_ssize_t, ssize_t, __ssize_t, long int
     <8f6>   DW_AT_sibling     : (ref4) <0x900>
  <2><8fa>: Abbrev Number: 16 (DW_TAG_formal_parameter)
     <8fb>   DW_AT_type        : (ref4) <0x862>, PyObject, _object
  <2><8ff>: Abbrev Number: 0
  <1><900>: Abbrev Number: 3 (DW_TAG_typedef)
-    <901>   DW_AT_name        : (strp) (offset: 0xda9): ssizeargfunc
+    <901>   DW_AT_name        : (strp) (offset: 0xdc8): ssizeargfunc
     <905>   DW_AT_decl_file   : (data1) 3
     <906>   DW_AT_decl_line   : (data1) 145
     <907>   DW_AT_decl_column : (data1) 21
     <908>   DW_AT_type        : (ref4) <0x90c>, PyObject, _object
  <1><90c>: Abbrev Number: 7 (DW_TAG_pointer_type)
     <90d>   DW_AT_byte_size   : (data1) 8
     <90e>   DW_AT_type        : (ref4) <0x912>, PyObject, _object
@@ -1239,15 +1239,15 @@
     <917>   DW_AT_sibling     : (ref4) <0x926>
  <2><91b>: Abbrev Number: 16 (DW_TAG_formal_parameter)
     <91c>   DW_AT_type        : (ref4) <0x862>, PyObject, _object
  <2><920>: Abbrev Number: 16 (DW_TAG_formal_parameter)
     <921>   DW_AT_type        : (ref4) <0x427>, Py_ssize_t, ssize_t, __ssize_t, long int
  <2><925>: Abbrev Number: 0
  <1><926>: Abbrev Number: 3 (DW_TAG_typedef)
-    <927>   DW_AT_name        : (strp) (offset: 0x1c1c): ssizeobjargproc
+    <927>   DW_AT_name        : (strp) (offset: 0x1c63): ssizeobjargproc
     <92b>   DW_AT_decl_file   : (data1) 3
     <92c>   DW_AT_decl_line   : (data1) 147
     <92d>   DW_AT_decl_column : (data1) 14
     <92e>   DW_AT_type        : (ref4) <0x932>, int
  <1><932>: Abbrev Number: 7 (DW_TAG_pointer_type)
     <933>   DW_AT_byte_size   : (data1) 8
     <934>   DW_AT_type        : (ref4) <0x938>, int
@@ -1259,15 +1259,15 @@
     <942>   DW_AT_type        : (ref4) <0x862>, PyObject, _object
  <2><946>: Abbrev Number: 16 (DW_TAG_formal_parameter)
     <947>   DW_AT_type        : (ref4) <0x427>, Py_ssize_t, ssize_t, __ssize_t, long int
  <2><94b>: Abbrev Number: 16 (DW_TAG_formal_parameter)
     <94c>   DW_AT_type        : (ref4) <0x862>, PyObject, _object
  <2><950>: Abbrev Number: 0
  <1><951>: Abbrev Number: 3 (DW_TAG_typedef)
-    <952>   DW_AT_name        : (strp) (offset: 0xc59): objobjargproc
+    <952>   DW_AT_name        : (strp) (offset: 0xc78): objobjargproc
     <956>   DW_AT_decl_file   : (data1) 3
     <957>   DW_AT_decl_line   : (data1) 149
     <958>   DW_AT_decl_column : (data1) 14
     <959>   DW_AT_type        : (ref4) <0x95d>, int
  <1><95d>: Abbrev Number: 7 (DW_TAG_pointer_type)
     <95e>   DW_AT_byte_size   : (data1) 8
     <95f>   DW_AT_type        : (ref4) <0x963>, int
@@ -1279,15 +1279,15 @@
     <96d>   DW_AT_type        : (ref4) <0x862>, PyObject, _object
  <2><971>: Abbrev Number: 16 (DW_TAG_formal_parameter)
     <972>   DW_AT_type        : (ref4) <0x862>, PyObject, _object
  <2><976>: Abbrev Number: 16 (DW_TAG_formal_parameter)
     <977>   DW_AT_type        : (ref4) <0x862>, PyObject, _object
  <2><97b>: Abbrev Number: 0
  <1><97c>: Abbrev Number: 3 (DW_TAG_typedef)
-    <97d>   DW_AT_name        : (strp) (offset: 0x279c): objobjproc
+    <97d>   DW_AT_name        : (strp) (offset: 0x27e3): objobjproc
     <981>   DW_AT_decl_file   : (data1) 3
     <982>   DW_AT_decl_line   : (data1) 151
     <983>   DW_AT_decl_column : (data1) 15
     <984>   DW_AT_type        : (ref4) <0x988>, int
  <1><988>: Abbrev Number: 7 (DW_TAG_pointer_type)
     <989>   DW_AT_byte_size   : (data1) 8
     <98a>   DW_AT_type        : (ref4) <0x98e>, int
@@ -1315,15 +1315,15 @@
     <9b9>   DW_AT_sibling     : (ref4) <0x9c8>
  <2><9bd>: Abbrev Number: 16 (DW_TAG_formal_parameter)
     <9be>   DW_AT_type        : (ref4) <0x862>, PyObject, _object
  <2><9c2>: Abbrev Number: 16 (DW_TAG_formal_parameter)
     <9c3>   DW_AT_type        : (ref4) <0x53>
  <2><9c7>: Abbrev Number: 0
  <1><9c8>: Abbrev Number: 3 (DW_TAG_typedef)
-    <9c9>   DW_AT_name        : (strp) (offset: 0x18de): traverseproc
+    <9c9>   DW_AT_name        : (strp) (offset: 0x1915): traverseproc
     <9cd>   DW_AT_decl_file   : (data1) 3
     <9ce>   DW_AT_decl_line   : (data1) 153
     <9cf>   DW_AT_decl_column : (data1) 15
     <9d0>   DW_AT_type        : (ref4) <0x9d4>, int
  <1><9d4>: Abbrev Number: 7 (DW_TAG_pointer_type)
     <9d5>   DW_AT_byte_size   : (data1) 8
     <9d6>   DW_AT_type        : (ref4) <0x9da>, int
@@ -1335,45 +1335,45 @@
     <9e4>   DW_AT_type        : (ref4) <0x862>, PyObject, _object
  <2><9e8>: Abbrev Number: 16 (DW_TAG_formal_parameter)
     <9e9>   DW_AT_type        : (ref4) <0x9a2>, visitproc, int
  <2><9ed>: Abbrev Number: 16 (DW_TAG_formal_parameter)
     <9ee>   DW_AT_type        : (ref4) <0x53>
  <2><9f2>: Abbrev Number: 0
  <1><9f3>: Abbrev Number: 3 (DW_TAG_typedef)
-    <9f4>   DW_AT_name        : (strp) (offset: 0x1e28): freefunc
+    <9f4>   DW_AT_name        : (strp) (offset: 0x1e6f): freefunc
     <9f8>   DW_AT_decl_file   : (data1) 3
     <9f9>   DW_AT_decl_line   : (data1) 156
     <9fa>   DW_AT_decl_column : (data1) 16
     <9fb>   DW_AT_type        : (ref4) <0x9ff>
  <1><9ff>: Abbrev Number: 7 (DW_TAG_pointer_type)
     <a00>   DW_AT_byte_size   : (data1) 8
     <a01>   DW_AT_type        : (ref4) <0xa05>
  <1><a05>: Abbrev Number: 28 (DW_TAG_subroutine_type)
     <a06>   DW_AT_prototyped  : (flag_present) 1
     <a06>   DW_AT_sibling     : (ref4) <0xa10>
  <2><a0a>: Abbrev Number: 16 (DW_TAG_formal_parameter)
     <a0b>   DW_AT_type        : (ref4) <0x53>
  <2><a0f>: Abbrev Number: 0
  <1><a10>: Abbrev Number: 3 (DW_TAG_typedef)
-    <a11>   DW_AT_name        : (strp) (offset: 0x12bf): destructor
+    <a11>   DW_AT_name        : (strp) (offset: 0x12eb): destructor
     <a15>   DW_AT_decl_file   : (data1) 3
     <a16>   DW_AT_decl_line   : (data1) 157
     <a17>   DW_AT_decl_column : (data1) 16
     <a18>   DW_AT_type        : (ref4) <0xa1c>
  <1><a1c>: Abbrev Number: 7 (DW_TAG_pointer_type)
     <a1d>   DW_AT_byte_size   : (data1) 8
     <a1e>   DW_AT_type        : (ref4) <0xa22>
  <1><a22>: Abbrev Number: 28 (DW_TAG_subroutine_type)
     <a23>   DW_AT_prototyped  : (flag_present) 1
     <a23>   DW_AT_sibling     : (ref4) <0xa2d>
  <2><a27>: Abbrev Number: 16 (DW_TAG_formal_parameter)
     <a28>   DW_AT_type        : (ref4) <0x862>, PyObject, _object
  <2><a2c>: Abbrev Number: 0
  <1><a2d>: Abbrev Number: 3 (DW_TAG_typedef)
-    <a2e>   DW_AT_name        : (strp) (offset: 0x1b05): getattrfunc
+    <a2e>   DW_AT_name        : (strp) (offset: 0x1b4c): getattrfunc
     <a32>   DW_AT_decl_file   : (data1) 3
     <a33>   DW_AT_decl_line   : (data1) 158
     <a34>   DW_AT_decl_column : (data1) 21
     <a35>   DW_AT_type        : (ref4) <0xa39>, PyObject, _object
  <1><a39>: Abbrev Number: 7 (DW_TAG_pointer_type)
     <a3a>   DW_AT_byte_size   : (data1) 8
     <a3b>   DW_AT_type        : (ref4) <0xa3f>, PyObject, _object
@@ -1383,21 +1383,21 @@
     <a44>   DW_AT_sibling     : (ref4) <0xa53>
  <2><a48>: Abbrev Number: 16 (DW_TAG_formal_parameter)
     <a49>   DW_AT_type        : (ref4) <0x862>, PyObject, _object
  <2><a4d>: Abbrev Number: 16 (DW_TAG_formal_parameter)
     <a4e>   DW_AT_type        : (ref4) <0xc0>, char
  <2><a52>: Abbrev Number: 0
  <1><a53>: Abbrev Number: 3 (DW_TAG_typedef)
-    <a54>   DW_AT_name        : (strp) (offset: 0x1a48): getattrofunc
+    <a54>   DW_AT_name        : (strp) (offset: 0x1a8f): getattrofunc
     <a58>   DW_AT_decl_file   : (data1) 3
     <a59>   DW_AT_decl_line   : (data1) 159
     <a5a>   DW_AT_decl_column : (data1) 21
     <a5b>   DW_AT_type        : (ref4) <0x879>, PyObject, _object
  <1><a5f>: Abbrev Number: 3 (DW_TAG_typedef)
-    <a60>   DW_AT_name        : (strp) (offset: 0xcb1): setattrfunc
+    <a60>   DW_AT_name        : (strp) (offset: 0xcd0): setattrfunc
     <a64>   DW_AT_decl_file   : (data1) 3
     <a65>   DW_AT_decl_line   : (data1) 160
     <a66>   DW_AT_decl_column : (data1) 15
     <a67>   DW_AT_type        : (ref4) <0xa6b>, int
  <1><a6b>: Abbrev Number: 7 (DW_TAG_pointer_type)
     <a6c>   DW_AT_byte_size   : (data1) 8
     <a6d>   DW_AT_type        : (ref4) <0xa71>, int
@@ -1415,21 +1415,21 @@
  <1><a8a>: Abbrev Number: 3 (DW_TAG_typedef)
     <a8b>   DW_AT_name        : (strp) (offset: 0x3d2): setattrofunc
     <a8f>   DW_AT_decl_file   : (data1) 3
     <a90>   DW_AT_decl_line   : (data1) 161
     <a91>   DW_AT_decl_column : (data1) 15
     <a92>   DW_AT_type        : (ref4) <0x95d>, int
  <1><a96>: Abbrev Number: 3 (DW_TAG_typedef)
-    <a97>   DW_AT_name        : (strp) (offset: 0xf0d): reprfunc
+    <a97>   DW_AT_name        : (strp) (offset: 0xf2c): reprfunc
     <a9b>   DW_AT_decl_file   : (data1) 3
     <a9c>   DW_AT_decl_line   : (data1) 162
     <a9d>   DW_AT_decl_column : (data1) 21
     <a9e>   DW_AT_type        : (ref4) <0x84d>, PyObject, _object
  <1><aa2>: Abbrev Number: 3 (DW_TAG_typedef)
-    <aa3>   DW_AT_name        : (strp) (offset: 0x1afc): hashfunc
+    <aa3>   DW_AT_name        : (strp) (offset: 0x1b43): hashfunc
     <aa7>   DW_AT_decl_file   : (data1) 3
     <aa8>   DW_AT_decl_line   : (data1) 163
     <aa9>   DW_AT_decl_column : (data1) 21
     <aaa>   DW_AT_type        : (ref4) <0xaae>, Py_hash_t, Py_ssize_t, ssize_t, __ssize_t, long int
  <1><aae>: Abbrev Number: 7 (DW_TAG_pointer_type)
     <aaf>   DW_AT_byte_size   : (data1) 8
     <ab0>   DW_AT_type        : (ref4) <0xab4>, Py_hash_t, Py_ssize_t, ssize_t, __ssize_t, long int
@@ -1437,15 +1437,15 @@
     <ab5>   DW_AT_prototyped  : (flag_present) 1
     <ab5>   DW_AT_type        : (ref4) <0x433>, Py_hash_t, Py_ssize_t, ssize_t, __ssize_t, long int
     <ab9>   DW_AT_sibling     : (ref4) <0xac3>
  <2><abd>: Abbrev Number: 16 (DW_TAG_formal_parameter)
     <abe>   DW_AT_type        : (ref4) <0x862>, PyObject, _object
  <2><ac2>: Abbrev Number: 0
  <1><ac3>: Abbrev Number: 3 (DW_TAG_typedef)
-    <ac4>   DW_AT_name        : (strp) (offset: 0x9e6): richcmpfunc
+    <ac4>   DW_AT_name        : (strp) (offset: 0xa05): richcmpfunc
     <ac8>   DW_AT_decl_file   : (data1) 3
     <ac9>   DW_AT_decl_line   : (data1) 164
     <aca>   DW_AT_decl_column : (data1) 21
     <acb>   DW_AT_type        : (ref4) <0xacf>, PyObject, _object
  <1><acf>: Abbrev Number: 7 (DW_TAG_pointer_type)
     <ad0>   DW_AT_byte_size   : (data1) 8
     <ad1>   DW_AT_type        : (ref4) <0xad5>, PyObject, _object
@@ -1457,45 +1457,45 @@
     <adf>   DW_AT_type        : (ref4) <0x862>, PyObject, _object
  <2><ae3>: Abbrev Number: 16 (DW_TAG_formal_parameter)
     <ae4>   DW_AT_type        : (ref4) <0x862>, PyObject, _object
  <2><ae8>: Abbrev Number: 16 (DW_TAG_formal_parameter)
     <ae9>   DW_AT_type        : (ref4) <0x76>, int
  <2><aed>: Abbrev Number: 0
  <1><aee>: Abbrev Number: 3 (DW_TAG_typedef)
-    <aef>   DW_AT_name        : (strp) (offset: 0xd77): getiterfunc
+    <aef>   DW_AT_name        : (strp) (offset: 0xd96): getiterfunc
     <af3>   DW_AT_decl_file   : (data1) 3
     <af4>   DW_AT_decl_line   : (data1) 165
     <af5>   DW_AT_decl_column : (data1) 21
     <af6>   DW_AT_type        : (ref4) <0x84d>, PyObject, _object
  <1><afa>: Abbrev Number: 3 (DW_TAG_typedef)
-    <afb>   DW_AT_name        : (strp) (offset: 0x2653): iternextfunc
+    <afb>   DW_AT_name        : (strp) (offset: 0x269a): iternextfunc
     <aff>   DW_AT_decl_file   : (data1) 3
     <b00>   DW_AT_decl_line   : (data1) 166
     <b01>   DW_AT_decl_column : (data1) 21
     <b02>   DW_AT_type        : (ref4) <0x84d>, PyObject, _object
  <1><b06>: Abbrev Number: 3 (DW_TAG_typedef)
-    <b07>   DW_AT_name        : (strp) (offset: 0xe37): descrgetfunc
+    <b07>   DW_AT_name        : (strp) (offset: 0xe56): descrgetfunc
     <b0b>   DW_AT_decl_file   : (data1) 3
     <b0c>   DW_AT_decl_line   : (data1) 167
     <b0d>   DW_AT_decl_column : (data1) 21
     <b0e>   DW_AT_type        : (ref4) <0x89f>, PyObject, _object
  <1><b12>: Abbrev Number: 3 (DW_TAG_typedef)
-    <b13>   DW_AT_name        : (strp) (offset: 0xe0c): descrsetfunc
+    <b13>   DW_AT_name        : (strp) (offset: 0xe2b): descrsetfunc
     <b17>   DW_AT_decl_file   : (data1) 3
     <b18>   DW_AT_decl_line   : (data1) 168
     <b19>   DW_AT_decl_column : (data1) 15
     <b1a>   DW_AT_type        : (ref4) <0x95d>, int
  <1><b1e>: Abbrev Number: 3 (DW_TAG_typedef)
     <b1f>   DW_AT_name        : (strp) (offset: 0x2dc): initproc
     <b23>   DW_AT_decl_file   : (data1) 3
     <b24>   DW_AT_decl_line   : (data1) 169
     <b25>   DW_AT_decl_column : (data1) 15
     <b26>   DW_AT_type        : (ref4) <0x95d>, int
  <1><b2a>: Abbrev Number: 3 (DW_TAG_typedef)
-    <b2b>   DW_AT_name        : (strp) (offset: 0x1ae9): newfunc
+    <b2b>   DW_AT_name        : (strp) (offset: 0x1b30): newfunc
     <b2f>   DW_AT_decl_file   : (data1) 3
     <b30>   DW_AT_decl_line   : (data1) 170
     <b31>   DW_AT_decl_column : (data1) 21
     <b32>   DW_AT_type        : (ref4) <0xb36>, PyObject, _object
  <1><b36>: Abbrev Number: 7 (DW_TAG_pointer_type)
     <b37>   DW_AT_byte_size   : (data1) 8
     <b38>   DW_AT_type        : (ref4) <0xb3c>, PyObject, _object
@@ -1507,15 +1507,15 @@
     <b46>   DW_AT_type        : (ref4) <0x7ff>, _typeobject
  <2><b4a>: Abbrev Number: 16 (DW_TAG_formal_parameter)
     <b4b>   DW_AT_type        : (ref4) <0x862>, PyObject, _object
  <2><b4f>: Abbrev Number: 16 (DW_TAG_formal_parameter)
     <b50>   DW_AT_type        : (ref4) <0x862>, PyObject, _object
  <2><b54>: Abbrev Number: 0
  <1><b55>: Abbrev Number: 3 (DW_TAG_typedef)
-    <b56>   DW_AT_name        : (strp) (offset: 0x16bc): allocfunc
+    <b56>   DW_AT_name        : (strp) (offset: 0x16e8): allocfunc
     <b5a>   DW_AT_decl_file   : (data1) 3
     <b5b>   DW_AT_decl_line   : (data1) 171
     <b5c>   DW_AT_decl_column : (data1) 21
     <b5d>   DW_AT_type        : (ref4) <0xb61>, PyObject, _object
  <1><b61>: Abbrev Number: 7 (DW_TAG_pointer_type)
     <b62>   DW_AT_byte_size   : (data1) 8
     <b63>   DW_AT_type        : (ref4) <0xb67>, PyObject, _object
@@ -1525,15 +1525,15 @@
     <b6c>   DW_AT_sibling     : (ref4) <0xb7b>
  <2><b70>: Abbrev Number: 16 (DW_TAG_formal_parameter)
     <b71>   DW_AT_type        : (ref4) <0x7ff>, _typeobject
  <2><b75>: Abbrev Number: 16 (DW_TAG_formal_parameter)
     <b76>   DW_AT_type        : (ref4) <0x427>, Py_ssize_t, ssize_t, __ssize_t, long int
  <2><b7a>: Abbrev Number: 0
  <1><b7b>: Abbrev Number: 17 (DW_TAG_variable)
-    <b7c>   DW_AT_name        : (strp) (offset: 0x2573): PyType_Type
+    <b7c>   DW_AT_name        : (strp) (offset: 0x25ba): PyType_Type
     <b80>   DW_AT_decl_file   : (data1) 3
     <b81>   DW_AT_decl_line   : (data1) 206
     <b82>   DW_AT_decl_column : (data1) 32
     <b83>   DW_AT_type        : (ref4) <0x54f>, _typeobject
     <b87>   DW_AT_external    : (flag_present) 1
     <b87>   DW_AT_declaration : (flag_present) 1
  <1><b87>: Abbrev Number: 17 (DW_TAG_variable)
@@ -1541,134 +1541,134 @@
     <b8c>   DW_AT_decl_file   : (data1) 3
     <b8d>   DW_AT_decl_line   : (data1) 207
     <b8e>   DW_AT_decl_column : (data1) 32
     <b8f>   DW_AT_type        : (ref4) <0x54f>, _typeobject
     <b93>   DW_AT_external    : (flag_present) 1
     <b93>   DW_AT_declaration : (flag_present) 1
  <1><b93>: Abbrev Number: 17 (DW_TAG_variable)
-    <b94>   DW_AT_name        : (strp) (offset: 0x24ac): PySuper_Type
+    <b94>   DW_AT_name        : (strp) (offset: 0x24f3): PySuper_Type
     <b98>   DW_AT_decl_file   : (data1) 3
     <b99>   DW_AT_decl_line   : (data1) 208
     <b9a>   DW_AT_decl_column : (data1) 32
     <b9b>   DW_AT_type        : (ref4) <0x54f>, _typeobject
     <b9f>   DW_AT_external    : (flag_present) 1
     <b9f>   DW_AT_declaration : (flag_present) 1
  <1><b9f>: Abbrev Number: 21 (DW_TAG_variable)
-    <ba0>   DW_AT_name        : (strp) (offset: 0x2427): _Py_NoneStruct
+    <ba0>   DW_AT_name        : (strp) (offset: 0x246e): _Py_NoneStruct
     <ba4>   DW_AT_decl_file   : (data1) 3
     <ba5>   DW_AT_decl_line   : (data2) 560
     <ba7>   DW_AT_decl_column : (data1) 22
     <ba8>   DW_AT_type        : (ref4) <0x805>, PyObject, _object
     <bac>   DW_AT_external    : (flag_present) 1
     <bac>   DW_AT_declaration : (flag_present) 1
  <1><bac>: Abbrev Number: 21 (DW_TAG_variable)
-    <bad>   DW_AT_name        : (strp) (offset: 0x23a7): _Py_NotImplementedStruct
+    <bad>   DW_AT_name        : (strp) (offset: 0x23ee): _Py_NotImplementedStruct
     <bb1>   DW_AT_decl_file   : (data1) 3
     <bb2>   DW_AT_decl_line   : (data2) 570
     <bb4>   DW_AT_decl_column : (data1) 22
     <bb5>   DW_AT_type        : (ref4) <0x805>, PyObject, _object
     <bb9>   DW_AT_external    : (flag_present) 1
     <bb9>   DW_AT_declaration : (flag_present) 1
  <1><bb9>: Abbrev Number: 8 (DW_TAG_structure_type)
-    <bba>   DW_AT_name        : (strp) (offset: 0x1ade): bufferinfo
+    <bba>   DW_AT_name        : (strp) (offset: 0x1b25): bufferinfo
     <bbe>   DW_AT_byte_size   : (data1) 80
-    <bbf>   DW_AT_decl_file   : (data1) 19
+    <bbf>   DW_AT_decl_file   : (data1) 20
     <bc0>   DW_AT_decl_line   : (data1) 40
     <bc1>   DW_AT_decl_column : (data1) 16
     <bc2>   DW_AT_sibling     : (ref4) <0xc56>
  <2><bc6>: Abbrev Number: 29 (DW_TAG_member)
     <bc7>   DW_AT_name        : (string) buf
-    <bcb>   DW_AT_decl_file   : (data1) 19
+    <bcb>   DW_AT_decl_file   : (data1) 20
     <bcc>   DW_AT_decl_line   : (data1) 41
     <bcd>   DW_AT_decl_column : (data1) 11
     <bce>   DW_AT_type        : (ref4) <0x53>
     <bd2>   DW_AT_data_member_location: (data1) 0
  <2><bd3>: Abbrev Number: 29 (DW_TAG_member)
     <bd4>   DW_AT_name        : (string) obj
-    <bd8>   DW_AT_decl_file   : (data1) 19
+    <bd8>   DW_AT_decl_file   : (data1) 20
     <bd9>   DW_AT_decl_line   : (data1) 42
     <bda>   DW_AT_decl_column : (data1) 15
     <bdb>   DW_AT_type        : (ref4) <0x862>, PyObject, _object
     <bdf>   DW_AT_data_member_location: (data1) 8
  <2><be0>: Abbrev Number: 29 (DW_TAG_member)
     <be1>   DW_AT_name        : (string) len
-    <be5>   DW_AT_decl_file   : (data1) 19
+    <be5>   DW_AT_decl_file   : (data1) 20
     <be6>   DW_AT_decl_line   : (data1) 43
     <be7>   DW_AT_decl_column : (data1) 16
     <be8>   DW_AT_type        : (ref4) <0x427>, Py_ssize_t, ssize_t, __ssize_t, long int
     <bec>   DW_AT_data_member_location: (data1) 16
  <2><bed>: Abbrev Number: 9 (DW_TAG_member)
     <bee>   DW_AT_name        : (strp) (offset: 0x2b0): itemsize
-    <bf2>   DW_AT_decl_file   : (data1) 19
+    <bf2>   DW_AT_decl_file   : (data1) 20
     <bf3>   DW_AT_decl_line   : (data1) 44
     <bf4>   DW_AT_decl_column : (data1) 16
     <bf5>   DW_AT_type        : (ref4) <0x427>, Py_ssize_t, ssize_t, __ssize_t, long int
     <bf9>   DW_AT_data_member_location: (data1) 24
  <2><bfa>: Abbrev Number: 9 (DW_TAG_member)
-    <bfb>   DW_AT_name        : (strp) (offset: 0x1a2c): readonly
-    <bff>   DW_AT_decl_file   : (data1) 19
+    <bfb>   DW_AT_name        : (strp) (offset: 0x1a73): readonly
+    <bff>   DW_AT_decl_file   : (data1) 20
     <c00>   DW_AT_decl_line   : (data1) 46
     <c01>   DW_AT_decl_column : (data1) 9
     <c02>   DW_AT_type        : (ref4) <0x76>, int
     <c06>   DW_AT_data_member_location: (data1) 32
  <2><c07>: Abbrev Number: 9 (DW_TAG_member)
-    <c08>   DW_AT_name        : (strp) (offset: 0x1c17): ndim
-    <c0c>   DW_AT_decl_file   : (data1) 19
+    <c08>   DW_AT_name        : (strp) (offset: 0x1c5e): ndim
+    <c0c>   DW_AT_decl_file   : (data1) 20
     <c0d>   DW_AT_decl_line   : (data1) 47
     <c0e>   DW_AT_decl_column : (data1) 9
     <c0f>   DW_AT_type        : (ref4) <0x76>, int
     <c13>   DW_AT_data_member_location: (data1) 36
  <2><c14>: Abbrev Number: 9 (DW_TAG_member)
-    <c15>   DW_AT_name        : (strp) (offset: 0x1842): format
-    <c19>   DW_AT_decl_file   : (data1) 19
+    <c15>   DW_AT_name        : (strp) (offset: 0x1887): format
+    <c19>   DW_AT_decl_file   : (data1) 20
     <c1a>   DW_AT_decl_line   : (data1) 48
     <c1b>   DW_AT_decl_column : (data1) 11
     <c1c>   DW_AT_type        : (ref4) <0xc0>, char
     <c20>   DW_AT_data_member_location: (data1) 40
  <2><c21>: Abbrev Number: 9 (DW_TAG_member)
-    <c22>   DW_AT_name        : (strp) (offset: 0x1bc3): shape
-    <c26>   DW_AT_decl_file   : (data1) 19
+    <c22>   DW_AT_name        : (strp) (offset: 0x1c0a): shape
+    <c26>   DW_AT_decl_file   : (data1) 20
     <c27>   DW_AT_decl_line   : (data1) 49
     <c28>   DW_AT_decl_column : (data1) 17
     <c29>   DW_AT_type        : (ref4) <0xc56>, Py_ssize_t, ssize_t, __ssize_t, long int
     <c2d>   DW_AT_data_member_location: (data1) 48
  <2><c2e>: Abbrev Number: 9 (DW_TAG_member)
-    <c2f>   DW_AT_name        : (strp) (offset: 0x1fc2): strides
-    <c33>   DW_AT_decl_file   : (data1) 19
+    <c2f>   DW_AT_name        : (strp) (offset: 0x2009): strides
+    <c33>   DW_AT_decl_file   : (data1) 20
     <c34>   DW_AT_decl_line   : (data1) 50
     <c35>   DW_AT_decl_column : (data1) 17
     <c36>   DW_AT_type        : (ref4) <0xc56>, Py_ssize_t, ssize_t, __ssize_t, long int
     <c3a>   DW_AT_data_member_location: (data1) 56
  <2><c3b>: Abbrev Number: 9 (DW_TAG_member)
-    <c3c>   DW_AT_name        : (strp) (offset: 0x1591): suboffsets
-    <c40>   DW_AT_decl_file   : (data1) 19
+    <c3c>   DW_AT_name        : (strp) (offset: 0x15bd): suboffsets
+    <c40>   DW_AT_decl_file   : (data1) 20
     <c41>   DW_AT_decl_line   : (data1) 51
     <c42>   DW_AT_decl_column : (data1) 17
     <c43>   DW_AT_type        : (ref4) <0xc56>, Py_ssize_t, ssize_t, __ssize_t, long int
     <c47>   DW_AT_data_member_location: (data1) 64
  <2><c48>: Abbrev Number: 9 (DW_TAG_member)
-    <c49>   DW_AT_name        : (strp) (offset: 0x221d): internal
-    <c4d>   DW_AT_decl_file   : (data1) 19
+    <c49>   DW_AT_name        : (strp) (offset: 0x2264): internal
+    <c4d>   DW_AT_decl_file   : (data1) 20
     <c4e>   DW_AT_decl_line   : (data1) 52
     <c4f>   DW_AT_decl_column : (data1) 11
     <c50>   DW_AT_type        : (ref4) <0x53>
     <c54>   DW_AT_data_member_location: (data1) 72
  <2><c55>: Abbrev Number: 0
  <1><c56>: Abbrev Number: 7 (DW_TAG_pointer_type)
     <c57>   DW_AT_byte_size   : (data1) 8
     <c58>   DW_AT_type        : (ref4) <0x427>, Py_ssize_t, ssize_t, __ssize_t, long int
  <1><c5c>: Abbrev Number: 3 (DW_TAG_typedef)
-    <c5d>   DW_AT_name        : (strp) (offset: 0x26c1): Py_buffer
-    <c61>   DW_AT_decl_file   : (data1) 19
+    <c5d>   DW_AT_name        : (strp) (offset: 0x2708): Py_buffer
+    <c61>   DW_AT_decl_file   : (data1) 20
     <c62>   DW_AT_decl_line   : (data1) 53
     <c63>   DW_AT_decl_column : (data1) 3
     <c64>   DW_AT_type        : (ref4) <0xbb9>, bufferinfo
  <1><c68>: Abbrev Number: 3 (DW_TAG_typedef)
-    <c69>   DW_AT_name        : (strp) (offset: 0x1c7a): getbufferproc
-    <c6d>   DW_AT_decl_file   : (data1) 19
+    <c69>   DW_AT_name        : (strp) (offset: 0x1cc1): getbufferproc
+    <c6d>   DW_AT_decl_file   : (data1) 20
     <c6e>   DW_AT_decl_line   : (data1) 55
     <c6f>   DW_AT_decl_column : (data1) 15
     <c70>   DW_AT_type        : (ref4) <0xc74>, int
  <1><c74>: Abbrev Number: 7 (DW_TAG_pointer_type)
     <c75>   DW_AT_byte_size   : (data1) 8
     <c76>   DW_AT_type        : (ref4) <0xc7a>, int
  <1><c7a>: Abbrev Number: 15 (DW_TAG_subroutine_type)
@@ -1682,16 +1682,16 @@
  <2><c8d>: Abbrev Number: 16 (DW_TAG_formal_parameter)
     <c8e>   DW_AT_type        : (ref4) <0x76>, int
  <2><c92>: Abbrev Number: 0
  <1><c93>: Abbrev Number: 7 (DW_TAG_pointer_type)
     <c94>   DW_AT_byte_size   : (data1) 8
     <c95>   DW_AT_type        : (ref4) <0xc5c>, Py_buffer, bufferinfo
  <1><c99>: Abbrev Number: 3 (DW_TAG_typedef)
-    <c9a>   DW_AT_name        : (strp) (offset: 0x2117): releasebufferproc
-    <c9e>   DW_AT_decl_file   : (data1) 19
+    <c9a>   DW_AT_name        : (strp) (offset: 0x215e): releasebufferproc
+    <c9e>   DW_AT_decl_file   : (data1) 20
     <c9f>   DW_AT_decl_line   : (data1) 56
     <ca0>   DW_AT_decl_column : (data1) 16
     <ca1>   DW_AT_type        : (ref4) <0xca5>
  <1><ca5>: Abbrev Number: 7 (DW_TAG_pointer_type)
     <ca6>   DW_AT_byte_size   : (data1) 8
     <ca7>   DW_AT_type        : (ref4) <0xcab>
  <1><cab>: Abbrev Number: 28 (DW_TAG_subroutine_type)
@@ -1699,16 +1699,16 @@
     <cac>   DW_AT_sibling     : (ref4) <0xcbb>
  <2><cb0>: Abbrev Number: 16 (DW_TAG_formal_parameter)
     <cb1>   DW_AT_type        : (ref4) <0x862>, PyObject, _object
  <2><cb5>: Abbrev Number: 16 (DW_TAG_formal_parameter)
     <cb6>   DW_AT_type        : (ref4) <0xc93>, Py_buffer, bufferinfo
  <2><cba>: Abbrev Number: 0
  <1><cbb>: Abbrev Number: 3 (DW_TAG_typedef)
-    <cbc>   DW_AT_name        : (strp) (offset: 0xd5f): vectorcallfunc
-    <cc0>   DW_AT_decl_file   : (data1) 19
+    <cbc>   DW_AT_name        : (strp) (offset: 0xd7e): vectorcallfunc
+    <cc0>   DW_AT_decl_file   : (data1) 20
     <cc1>   DW_AT_decl_line   : (data1) 58
     <cc2>   DW_AT_decl_column : (data1) 21
     <cc3>   DW_AT_type        : (ref4) <0xcc7>, PyObject, _object
  <1><cc7>: Abbrev Number: 7 (DW_TAG_pointer_type)
     <cc8>   DW_AT_byte_size   : (data1) 8
     <cc9>   DW_AT_type        : (ref4) <0xccd>, PyObject, _object
  <1><ccd>: Abbrev Number: 15 (DW_TAG_subroutine_type)
@@ -1725,452 +1725,452 @@
     <ce6>   DW_AT_type        : (ref4) <0x862>, PyObject, _object
  <2><cea>: Abbrev Number: 0
  <1><ceb>: Abbrev Number: 7 (DW_TAG_pointer_type)
     <cec>   DW_AT_byte_size   : (data1) 8
     <ced>   DW_AT_type        : (ref4) <0x868>, PyObject, _object
  <1><cf1>: Abbrev Number: 30 (DW_TAG_structure_type)
     <cf2>   DW_AT_byte_size   : (data2) 288
-    <cf4>   DW_AT_decl_file   : (data1) 19
+    <cf4>   DW_AT_decl_file   : (data1) 20
     <cf5>   DW_AT_decl_line   : (data1) 95
     <cf6>   DW_AT_decl_column : (data1) 9
     <cf7>   DW_AT_sibling     : (ref4) <0xed4>
  <2><cfb>: Abbrev Number: 9 (DW_TAG_member)
     <cfc>   DW_AT_name        : (strp) (offset: 0xdf): nb_add
