# Comparing `tmp/bioconsertinc-2.0.0-cp39-cp39-manylinux_2_5_x86_64.manylinux1_x86_64.whl.zip` & `tmp/bioconsertinc-2.0.1-cp38-cp38-manylinux_2_5_x86_64.manylinux1_x86_64.whl.zip`

## zipinfo {}

```diff
@@ -1,10 +1,10 @@
-Zip file size: 32976 bytes, number of entries: 8
-drwxrwxr-x  2.0 unx        0 b- stor 23-Jul-21 14:47 bioconsertinc.libs/
-drwxrwxr-x  2.0 unx        0 b- stor 23-Jul-21 14:47 bioconsertinc-2.0.0.dist-info/
--rwxrwxr-x  2.0 unx    75616 b- defN 23-Jul-21 14:47 bioconsertinc.cpython-39-x86_64-linux-gnu.so
--rw-rw-r--  2.0 unx       14 b- defN 23-Jul-21 14:47 bioconsertinc-2.0.0.dist-info/top_level.txt
--rw-rw-r--  2.0 unx     1070 b- defN 23-Jul-21 14:47 bioconsertinc-2.0.0.dist-info/LICENSE
--rw-rw-r--  2.0 unx      344 b- defN 23-Jul-21 14:47 bioconsertinc-2.0.0.dist-info/METADATA
--rw-rw-r--  2.0 unx      144 b- defN 23-Jul-21 14:47 bioconsertinc-2.0.0.dist-info/WHEEL
--rw-rw-r--  2.0 unx      524 b- defN 23-Jul-21 14:47 bioconsertinc-2.0.0.dist-info/RECORD
-8 files, 77712 bytes uncompressed, 31782 bytes compressed:  59.1%
+Zip file size: 33331 bytes, number of entries: 8
+drwxrwxr-x  2.0 unx        0 b- stor 23-Jul-21 15:37 bioconsertinc.libs/
+drwxrwxr-x  2.0 unx        0 b- stor 23-Jul-21 15:37 bioconsertinc-2.0.1.dist-info/
+-rwxrwxr-x  2.0 unx    76632 b- defN 23-Jul-21 15:37 bioconsertinc.cpython-38-x86_64-linux-gnu.so
+-rw-rw-r--  2.0 unx       14 b- defN 23-Jul-21 15:37 bioconsertinc-2.0.1.dist-info/top_level.txt

     <3c>   DW_AT_type        : (ref4) <0x40>, long unsigned int
  <1><40>: Abbrev Number: 2 (DW_TAG_base_type)
     <41>   DW_AT_byte_size   : (data1) 8
     <42>   DW_AT_encoding    : (data1) 7	(unsigned)
-    <43>   DW_AT_name        : (strp) (offset: 0x204c): long unsigned int
+    <43>   DW_AT_name        : (strp) (offset: 0x2130): long unsigned int
  <1><47>: Abbrev Number: 2 (DW_TAG_base_type)
     <48>   DW_AT_byte_size   : (data1) 4
     <49>   DW_AT_encoding    : (data1) 7	(unsigned)
-    <4a>   DW_AT_name        : (strp) (offset: 0x2051): unsigned int
+    <4a>   DW_AT_name        : (strp) (offset: 0x2135): unsigned int
  <1><4e>: Abbrev Number: 4 (DW_TAG_const_type)
     <4f>   DW_AT_type        : (ref4) <0x47>, unsigned int
  <1><53>: Abbrev Number: 5 (DW_TAG_pointer_type)
     <54>   DW_AT_byte_size   : (data1) 8
  <1><55>: Abbrev Number: 2 (DW_TAG_base_type)
     <56>   DW_AT_byte_size   : (data1) 1
     <57>   DW_AT_encoding    : (data1) 8	(unsigned char)
-    <58>   DW_AT_name        : (strp) (offset: 0x9a0): unsigned char
+    <58>   DW_AT_name        : (strp) (offset: 0xa11): unsigned char
  <1><5c>: Abbrev Number: 4 (DW_TAG_const_type)
     <5d>   DW_AT_type        : (ref4) <0x55>, unsigned char
  <1><61>: Abbrev Number: 2 (DW_TAG_base_type)
     <62>   DW_AT_byte_size   : (data1) 2
     <63>   DW_AT_encoding    : (data1) 7	(unsigned)
-    <64>   DW_AT_name        : (strp) (offset: 0x13a8): short unsigned int
+    <64>   DW_AT_name        : (strp) (offset: 0x1489): short unsigned int
  <1><68>: Abbrev Number: 2 (DW_TAG_base_type)
     <69>   DW_AT_byte_size   : (data1) 1
     <6a>   DW_AT_encoding    : (data1) 6	(signed char)
-    <6b>   DW_AT_name        : (strp) (offset: 0x9a2): signed char
+    <6b>   DW_AT_name        : (strp) (offset: 0xa13): signed char
  <1><6f>: Abbrev Number: 2 (DW_TAG_base_type)
     <70>   DW_AT_byte_size   : (data1) 2
     <71>   DW_AT_encoding    : (data1) 5	(signed)
-    <72>   DW_AT_name        : (strp) (offset: 0x2659): short int
+    <72>   DW_AT_name        : (strp) (offset: 0x2734): short int
  <1><76>: Abbrev Number: 6 (DW_TAG_base_type)
     <77>   DW_AT_byte_size   : (data1) 4
     <78>   DW_AT_encoding    : (data1) 5	(signed)
     <79>   DW_AT_name        : (string) int
  <1><7d>: Abbrev Number: 3 (DW_TAG_typedef)
-    <7e>   DW_AT_name        : (strp) (offset: 0x1d9d): __uint32_t
+    <7e>   DW_AT_name        : (strp) (offset: 0x1e78): __uint32_t
     <82>   DW_AT_decl_file   : (data1) 7
     <83>   DW_AT_decl_line   : (data1) 42
     <84>   DW_AT_decl_column : (data1) 22
     <85>   DW_AT_type        : (ref4) <0x47>, unsigned int
  <1><89>: Abbrev Number: 2 (DW_TAG_base_type)
     <8a>   DW_AT_byte_size   : (data1) 8
     <8b>   DW_AT_encoding    : (data1) 5	(signed)
-    <8c>   DW_AT_name        : (strp) (offset: 0x2365): long int
+    <8c>   DW_AT_name        : (strp) (offset: 0x2440): long int
  <1><90>: Abbrev Number: 3 (DW_TAG_typedef)
-    <91>   DW_AT_name        : (strp) (offset: 0xfc6): __uint64_t
+    <91>   DW_AT_name        : (strp) (offset: 0x1074): __uint64_t
     <95>   DW_AT_decl_file   : (data1) 7
     <96>   DW_AT_decl_line   : (data1) 45
     <97>   DW_AT_decl_column : (data1) 27
     <98>   DW_AT_type        : (ref4) <0x40>, long unsigned int
  <1><9c>: Abbrev Number: 3 (DW_TAG_typedef)
-    <9d>   DW_AT_name        : (strp) (offset: 0x32b): __off_t
+    <9d>   DW_AT_name        : (strp) (offset: 0x346): __off_t
     <a1>   DW_AT_decl_file   : (data1) 7
     <a2>   DW_AT_decl_line   : (data1) 152
     <a3>   DW_AT_decl_column : (data1) 25
     <a4>   DW_AT_type        : (ref4) <0x89>, long int
  <1><a8>: Abbrev Number: 3 (DW_TAG_typedef)
-    <a9>   DW_AT_name        : (strp) (offset: 0x1530): __off64_t
+    <a9>   DW_AT_name        : (strp) (offset: 0x1611): __off64_t
     <ad>   DW_AT_decl_file   : (data1) 7
     <ae>   DW_AT_decl_line   : (data1) 153
     <af>   DW_AT_decl_column : (data1) 27
     <b0>   DW_AT_type        : (ref4) <0x89>, long int
  <1><b4>: Abbrev Number: 3 (DW_TAG_typedef)
-    <b5>   DW_AT_name        : (strp) (offset: 0x10af): __ssize_t
+    <b5>   DW_AT_name        : (strp) (offset: 0x1173): __ssize_t
     <b9>   DW_AT_decl_file   : (data1) 7
     <ba>   DW_AT_decl_line   : (data1) 193
     <bb>   DW_AT_decl_column : (data1) 27
     <bc>   DW_AT_type        : (ref4) <0x89>, long int
  <1><c0>: Abbrev Number: 7 (DW_TAG_pointer_type)
     <c1>   DW_AT_byte_size   : (data1) 8
     <c2>   DW_AT_type        : (ref4) <0xc6>, char
  <1><c6>: Abbrev Number: 2 (DW_TAG_base_type)
     <c7>   DW_AT_byte_size   : (data1) 1
     <c8>   DW_AT_encoding    : (data1) 6	(signed char)
-    <c9>   DW_AT_name        : (strp) (offset: 0x9a9): char
+    <c9>   DW_AT_name        : (strp) (offset: 0xa1a): char
  <1><cd>: Abbrev Number: 4 (DW_TAG_const_type)
     <ce>   DW_AT_type        : (ref4) <0xc6>, char
  <1><d2>: Abbrev Number: 3 (DW_TAG_typedef)
-    <d3>   DW_AT_name        : (strp) (offset: 0x8cc): __intptr_t
+    <d3>   DW_AT_name        : (strp) (offset: 0x93d): __intptr_t
     <d7>   DW_AT_decl_file   : (data1) 7
     <d8>   DW_AT_decl_line   : (data1) 206
     <d9>   DW_AT_decl_column : (data1) 25
     <da>   DW_AT_type        : (ref4) <0x89>, long int
  <1><de>: Abbrev Number: 8 (DW_TAG_structure_type)
-    <df>   DW_AT_name        : (strp) (offset: 0x1ab6): _IO_FILE
+    <df>   DW_AT_name        : (strp) (offset: 0x1b88): _IO_FILE
     <e3>   DW_AT_byte_size   : (data1) 216
     <e4>   DW_AT_decl_file   : (data1) 8
     <e5>   DW_AT_decl_line   : (data1) 49
     <e6>   DW_AT_decl_column : (data1) 8
     <e7>   DW_AT_sibling     : (ref4) <0x265>
  <2><eb>: Abbrev Number: 9 (DW_TAG_member)
-    <ec>   DW_AT_name        : (strp) (offset: 0x119f): _flags
+    <ec>   DW_AT_name        : (strp) (offset: 0x1275): _flags
     <f0>   DW_AT_decl_file   : (data1) 8
     <f1>   DW_AT_decl_line   : (data1) 51
     <f2>   DW_AT_decl_column : (data1) 7
     <f3>   DW_AT_type        : (ref4) <0x76>, int
     <f7>   DW_AT_data_member_location: (data1) 0
  <2><f8>: Abbrev Number: 9 (DW_TAG_member)
-    <f9>   DW_AT_name        : (strp) (offset: 0x2157): _IO_read_ptr
+    <f9>   DW_AT_name        : (strp) (offset: 0x2232): _IO_read_ptr
     <fd>   DW_AT_decl_file   : (data1) 8
     <fe>   DW_AT_decl_line   : (data1) 54
     <ff>   DW_AT_decl_column : (data1) 9
     <100>   DW_AT_type        : (ref4) <0xc0>, char
     <104>   DW_AT_data_member_location: (data1) 8
  <2><105>: Abbrev Number: 9 (DW_TAG_member)
-    <106>   DW_AT_name        : (strp) (offset: 0x1a7a): _IO_read_end
+    <106>   DW_AT_name        : (strp) (offset: 0x1b58): _IO_read_end
     <10a>   DW_AT_decl_file   : (data1) 8
     <10b>   DW_AT_decl_line   : (data1) 55
     <10c>   DW_AT_decl_column : (data1) 9
     <10d>   DW_AT_type        : (ref4) <0xc0>, char
     <111>   DW_AT_data_member_location: (data1) 16
  <2><112>: Abbrev Number: 9 (DW_TAG_member)
-    <113>   DW_AT_name        : (strp) (offset: 0x156c): _IO_read_base
+    <113>   DW_AT_name        : (strp) (offset: 0x164d): _IO_read_base
     <117>   DW_AT_decl_file   : (data1) 8
     <118>   DW_AT_decl_line   : (data1) 56
     <119>   DW_AT_decl_column : (data1) 9
     <11a>   DW_AT_type        : (ref4) <0xc0>, char
     <11e>   DW_AT_data_member_location: (data1) 24
  <2><11f>: Abbrev Number: 9 (DW_TAG_member)
-    <120>   DW_AT_name        : (strp) (offset: 0x1682): _IO_write_base
+    <120>   DW_AT_name        : (strp) (offset: 0x1761): _IO_write_base
     <124>   DW_AT_decl_file   : (data1) 8
     <125>   DW_AT_decl_line   : (data1) 57
     <126>   DW_AT_decl_column : (data1) 9
     <127>   DW_AT_type        : (ref4) <0xc0>, char
     <12b>   DW_AT_data_member_location: (data1) 32
  <2><12c>: Abbrev Number: 9 (DW_TAG_member)
-    <12d>   DW_AT_name        : (strp) (offset: 0xc37): _IO_write_ptr
+    <12d>   DW_AT_name        : (strp) (offset: 0xcb4): _IO_write_ptr
     <131>   DW_AT_decl_file   : (data1) 8
     <132>   DW_AT_decl_line   : (data1) 58
     <133>   DW_AT_decl_column : (data1) 9
     <134>   DW_AT_type        : (ref4) <0xc0>, char
     <138>   DW_AT_data_member_location: (data1) 40
  <2><139>: Abbrev Number: 9 (DW_TAG_member)
-    <13a>   DW_AT_name        : (strp) (offset: 0x597): _IO_write_end
+    <13a>   DW_AT_name        : (strp) (offset: 0x5e6): _IO_write_end
     <13e>   DW_AT_decl_file   : (data1) 8
     <13f>   DW_AT_decl_line   : (data1) 59
     <140>   DW_AT_decl_column : (data1) 9
     <141>   DW_AT_type        : (ref4) <0xc0>, char
     <145>   DW_AT_data_member_location: (data1) 48
  <2><146>: Abbrev Number: 9 (DW_TAG_member)
-    <147>   DW_AT_name        : (strp) (offset: 0x1a3a): _IO_buf_base
+    <147>   DW_AT_name        : (strp) (offset: 0x1b18): _IO_buf_base
     <14b>   DW_AT_decl_file   : (data1) 8
     <14c>   DW_AT_decl_line   : (data1) 60
     <14d>   DW_AT_decl_column : (data1) 9
     <14e>   DW_AT_type        : (ref4) <0xc0>, char
     <152>   DW_AT_data_member_location: (data1) 56
  <2><153>: Abbrev Number: 9 (DW_TAG_member)
-    <154>   DW_AT_name        : (strp) (offset: 0x15c3): _IO_buf_end
+    <154>   DW_AT_name        : (strp) (offset: 0x16a4): _IO_buf_end
     <158>   DW_AT_decl_file   : (data1) 8
     <159>   DW_AT_decl_line   : (data1) 61
     <15a>   DW_AT_decl_column : (data1) 9
     <15b>   DW_AT_type        : (ref4) <0xc0>, char
     <15f>   DW_AT_data_member_location: (data1) 64
  <2><160>: Abbrev Number: 9 (DW_TAG_member)
-    <161>   DW_AT_name        : (strp) (offset: 0xe3d): _IO_save_base
+    <161>   DW_AT_name        : (strp) (offset: 0xec1): _IO_save_base
     <165>   DW_AT_decl_file   : (data1) 8
     <166>   DW_AT_decl_line   : (data1) 64
     <167>   DW_AT_decl_column : (data1) 9
     <168>   DW_AT_type        : (ref4) <0xc0>, char
     <16c>   DW_AT_data_member_location: (data1) 72
  <2><16d>: Abbrev Number: 9 (DW_TAG_member)
-    <16e>   DW_AT_name        : (strp) (offset: 0x2147): _IO_backup_base
+    <16e>   DW_AT_name        : (strp) (offset: 0x2222): _IO_backup_base
     <172>   DW_AT_decl_file   : (data1) 8
     <173>   DW_AT_decl_line   : (data1) 65
     <174>   DW_AT_decl_column : (data1) 9
     <175>   DW_AT_type        : (ref4) <0xc0>, char
     <179>   DW_AT_data_member_location: (data1) 80
  <2><17a>: Abbrev Number: 9 (DW_TAG_member)
-    <17b>   DW_AT_name        : (strp) (offset: 0x1290): _IO_save_end
+    <17b>   DW_AT_name        : (strp) (offset: 0x1366): _IO_save_end
     <17f>   DW_AT_decl_file   : (data1) 8
     <180>   DW_AT_decl_line   : (data1) 66
     <181>   DW_AT_decl_column : (data1) 9
     <182>   DW_AT_type        : (ref4) <0xc0>, char
     <186>   DW_AT_data_member_location: (data1) 88
  <2><187>: Abbrev Number: 9 (DW_TAG_member)
-    <188>   DW_AT_name        : (strp) (offset: 0x1c4b): _markers
+    <188>   DW_AT_name        : (strp) (offset: 0x1d1d): _markers
     <18c>   DW_AT_decl_file   : (data1) 8
     <18d>   DW_AT_decl_line   : (data1) 68
     <18e>   DW_AT_decl_column : (data1) 22
     <18f>   DW_AT_type        : (ref4) <0x27e>, _IO_marker
     <193>   DW_AT_data_member_location: (data1) 96
  <2><194>: Abbrev Number: 9 (DW_TAG_member)
-    <195>   DW_AT_name        : (strp) (offset: 0x937): _chain
+    <195>   DW_AT_name        : (strp) (offset: 0x9a8): _chain
     <199>   DW_AT_decl_file   : (data1) 8
     <19a>   DW_AT_decl_line   : (data1) 70
     <19b>   DW_AT_decl_column : (data1) 20
     <19c>   DW_AT_type        : (ref4) <0x284>, _IO_FILE
     <1a0>   DW_AT_data_member_location: (data1) 104
  <2><1a1>: Abbrev Number: 9 (DW_TAG_member)
     <1a2>   DW_AT_name        : (strp) (offset: 0x49): _fileno
     <1a6>   DW_AT_decl_file   : (data1) 8
     <1a7>   DW_AT_decl_line   : (data1) 72
     <1a8>   DW_AT_decl_column : (data1) 7
     <1a9>   DW_AT_type        : (ref4) <0x76>, int
     <1ad>   DW_AT_data_member_location: (data1) 112
  <2><1ae>: Abbrev Number: 9 (DW_TAG_member)
-    <1af>   DW_AT_name        : (strp) (offset: 0x23b5): _flags2
+    <1af>   DW_AT_name        : (strp) (offset: 0x2490): _flags2
     <1b3>   DW_AT_decl_file   : (data1) 8
     <1b4>   DW_AT_decl_line   : (data1) 73
     <1b5>   DW_AT_decl_column : (data1) 7
     <1b6>   DW_AT_type        : (ref4) <0x76>, int
     <1ba>   DW_AT_data_member_location: (data1) 116
  <2><1bb>: Abbrev Number: 9 (DW_TAG_member)
-    <1bc>   DW_AT_name        : (strp) (offset: 0x227e): _old_offset
+    <1bc>   DW_AT_name        : (strp) (offset: 0x2359): _old_offset
     <1c0>   DW_AT_decl_file   : (data1) 8
     <1c1>   DW_AT_decl_line   : (data1) 74
     <1c2>   DW_AT_decl_column : (data1) 11
     <1c3>   DW_AT_type        : (ref4) <0x9c>, __off_t, long int
     <1c7>   DW_AT_data_member_location: (data1) 120
  <2><1c8>: Abbrev Number: 9 (DW_TAG_member)
-    <1c9>   DW_AT_name        : (strp) (offset: 0x206e): _cur_column
+    <1c9>   DW_AT_name        : (strp) (offset: 0x2152): _cur_column
     <1cd>   DW_AT_decl_file   : (data1) 8
     <1ce>   DW_AT_decl_line   : (data1) 77
     <1cf>   DW_AT_decl_column : (data1) 18
     <1d0>   DW_AT_type        : (ref4) <0x61>, short unsigned int
     <1d4>   DW_AT_data_member_location: (data1) 128
  <2><1d5>: Abbrev Number: 9 (DW_TAG_member)
-    <1d6>   DW_AT_name        : (strp) (offset: 0x267c): _vtable_offset
+    <1d6>   DW_AT_name        : (strp) (offset: 0x2757): _vtable_offset
     <1da>   DW_AT_decl_file   : (data1) 8
     <1db>   DW_AT_decl_line   : (data1) 78
     <1dc>   DW_AT_decl_column : (data1) 15
     <1dd>   DW_AT_type        : (ref4) <0x68>, signed char
     <1e1>   DW_AT_data_member_location: (data1) 130
  <2><1e2>: Abbrev Number: 9 (DW_TAG_member)
-    <1e3>   DW_AT_name        : (strp) (offset: 0x1fa): _shortbuf
+    <1e3>   DW_AT_name        : (strp) (offset: 0x201): _shortbuf
     <1e7>   DW_AT_decl_file   : (data1) 8
     <1e8>   DW_AT_decl_line   : (data1) 79
     <1e9>   DW_AT_decl_column : (data1) 8
     <1ea>   DW_AT_type        : (ref4) <0x28a>, char
     <1ee>   DW_AT_data_member_location: (data1) 131
  <2><1ef>: Abbrev Number: 9 (DW_TAG_member)
-    <1f0>   DW_AT_name        : (strp) (offset: 0x374): _lock
+    <1f0>   DW_AT_name        : (strp) (offset: 0x38f): _lock
     <1f4>   DW_AT_decl_file   : (data1) 8
     <1f5>   DW_AT_decl_line   : (data1) 81
     <1f6>   DW_AT_decl_column : (data1) 15
     <1f7>   DW_AT_type        : (ref4) <0x29a>, _IO_lock_t
     <1fb>   DW_AT_data_member_location: (data1) 136
  <2><1fc>: Abbrev Number: 9 (DW_TAG_member)
-    <1fd>   DW_AT_name        : (strp) (offset: 0x2282): _offset
+    <1fd>   DW_AT_name        : (strp) (offset: 0x235d): _offset
     <201>   DW_AT_decl_file   : (data1) 8
     <202>   DW_AT_decl_line   : (data1) 89
     <203>   DW_AT_decl_column : (data1) 13
     <204>   DW_AT_type        : (ref4) <0xa8>, __off64_t, long int
     <208>   DW_AT_data_member_location: (data1) 144
  <2><209>: Abbrev Number: 9 (DW_TAG_member)
-    <20a>   DW_AT_name        : (strp) (offset: 0x187a): _codecvt
+    <20a>   DW_AT_name        : (strp) (offset: 0x1966): _codecvt
     <20e>   DW_AT_decl_file   : (data1) 8
     <20f>   DW_AT_decl_line   : (data1) 91
     <210>   DW_AT_decl_column : (data1) 23
     <211>   DW_AT_type        : (ref4) <0x2a5>, _IO_codecvt
     <215>   DW_AT_data_member_location: (data1) 152
  <2><216>: Abbrev Number: 9 (DW_TAG_member)
-    <217>   DW_AT_name        : (strp) (offset: 0x1ada): _wide_data
+    <217>   DW_AT_name        : (strp) (offset: 0x1bac): _wide_data
     <21b>   DW_AT_decl_file   : (data1) 8
     <21c>   DW_AT_decl_line   : (data1) 92
     <21d>   DW_AT_decl_column : (data1) 25
     <21e>   DW_AT_type        : (ref4) <0x2b0>, _IO_wide_data
     <222>   DW_AT_data_member_location: (data1) 160
  <2><223>: Abbrev Number: 9 (DW_TAG_member)
-    <224>   DW_AT_name        : (strp) (offset: 0x21a5): _freeres_list
+    <224>   DW_AT_name        : (strp) (offset: 0x2280): _freeres_list
     <228>   DW_AT_decl_file   : (data1) 8
     <229>   DW_AT_decl_line   : (data1) 93
     <22a>   DW_AT_decl_column : (data1) 20
     <22b>   DW_AT_type        : (ref4) <0x284>, _IO_FILE
     <22f>   DW_AT_data_member_location: (data1) 168
  <2><230>: Abbrev Number: 9 (DW_TAG_member)
-    <231>   DW_AT_name        : (strp) (offset: 0x1fa4): _freeres_buf
+    <231>   DW_AT_name        : (strp) (offset: 0x207f): _freeres_buf
     <235>   DW_AT_decl_file   : (data1) 8
     <236>   DW_AT_decl_line   : (data1) 94
     <237>   DW_AT_decl_column : (data1) 9
     <238>   DW_AT_type        : (ref4) <0x53>
     <23c>   DW_AT_data_member_location: (data1) 176
  <2><23d>: Abbrev Number: 9 (DW_TAG_member)
-    <23e>   DW_AT_name        : (strp) (offset: 0x1be8): __pad5
+    <23e>   DW_AT_name        : (strp) (offset: 0x1cba): __pad5
     <242>   DW_AT_decl_file   : (data1) 8
     <243>   DW_AT_decl_line   : (data1) 95
     <244>   DW_AT_decl_column : (data1) 10
     <245>   DW_AT_type        : (ref4) <0x34>, size_t, long unsigned int
     <249>   DW_AT_data_member_location: (data1) 184
  <2><24a>: Abbrev Number: 9 (DW_TAG_member)
-    <24b>   DW_AT_name        : (strp) (offset: 0x1661): _mode
+    <24b>   DW_AT_name        : (strp) (offset: 0x1740): _mode
     <24f>   DW_AT_decl_file   : (data1) 8
     <250>   DW_AT_decl_line   : (data1) 96
     <251>   DW_AT_decl_column : (data1) 7
     <252>   DW_AT_type        : (ref4) <0x76>, int
     <256>   DW_AT_data_member_location: (data1) 192
  <2><257>: Abbrev Number: 9 (DW_TAG_member)
     <258>   DW_AT_name        : (strp) (offset: 0x2e): _unused2
     <25c>   DW_AT_decl_file   : (data1) 8
     <25d>   DW_AT_decl_line   : (data1) 98
     <25e>   DW_AT_decl_column : (data1) 8
     <25f>   DW_AT_type        : (ref4) <0x2b6>, char
     <263>   DW_AT_data_member_location: (data1) 196
  <2><264>: Abbrev Number: 0
  <1><265>: Abbrev Number: 3 (DW_TAG_typedef)
-    <266>   DW_AT_name        : (strp) (offset: 0x1aba): FILE
+    <266>   DW_AT_name        : (strp) (offset: 0x1b8c): FILE
     <26a>   DW_AT_decl_file   : (data1) 9
     <26b>   DW_AT_decl_line   : (data1) 7
     <26c>   DW_AT_decl_column : (data1) 25
     <26d>   DW_AT_type        : (ref4) <0xde>, _IO_FILE
  <1><271>: Abbrev Number: 10 (DW_TAG_typedef)
-    <272>   DW_AT_name        : (strp) (offset: 0xa24): _IO_lock_t
+    <272>   DW_AT_name        : (strp) (offset: 0xaa1): _IO_lock_t
     <276>   DW_AT_decl_file   : (data1) 8
     <277>   DW_AT_decl_line   : (data1) 43
     <278>   DW_AT_decl_column : (data1) 14
  <1><279>: Abbrev Number: 11 (DW_TAG_structure_type)
-    <27a>   DW_AT_name        : (strp) (offset: 0x17ac): _IO_marker
+    <27a>   DW_AT_name        : (strp) (offset: 0x1898): _IO_marker
     <27e>   DW_AT_declaration : (flag_present) 1
  <1><27e>: Abbrev Number: 7 (DW_TAG_pointer_type)
     <27f>   DW_AT_byte_size   : (data1) 8
     <280>   DW_AT_type        : (ref4) <0x279>, _IO_marker
  <1><284>: Abbrev Number: 7 (DW_TAG_pointer_type)
     <285>   DW_AT_byte_size   : (data1) 8
     <286>   DW_AT_type        : (ref4) <0xde>, _IO_FILE
@@ -344,21 +344,21 @@
     <294>   DW_AT_type        : (ref4) <0x40>, long unsigned int
     <298>   DW_AT_upper_bound : (data1) 0
  <2><299>: Abbrev Number: 0
  <1><29a>: Abbrev Number: 7 (DW_TAG_pointer_type)
     <29b>   DW_AT_byte_size   : (data1) 8
     <29c>   DW_AT_type        : (ref4) <0x271>, _IO_lock_t
  <1><2a0>: Abbrev Number: 11 (DW_TAG_structure_type)
-    <2a1>   DW_AT_name        : (strp) (offset: 0x1877): _IO_codecvt
+    <2a1>   DW_AT_name        : (strp) (offset: 0x1963): _IO_codecvt
     <2a5>   DW_AT_declaration : (flag_present) 1
  <1><2a5>: Abbrev Number: 7 (DW_TAG_pointer_type)
     <2a6>   DW_AT_byte_size   : (data1) 8
     <2a7>   DW_AT_type        : (ref4) <0x2a0>, _IO_codecvt
  <1><2ab>: Abbrev Number: 11 (DW_TAG_structure_type)
-    <2ac>   DW_AT_name        : (strp) (offset: 0x1ad7): _IO_wide_data
+    <2ac>   DW_AT_name        : (strp) (offset: 0x1ba9): _IO_wide_data
     <2b0>   DW_AT_declaration : (flag_present) 1
  <1><2b0>: Abbrev Number: 7 (DW_TAG_pointer_type)
     <2b1>   DW_AT_byte_size   : (data1) 8
     <2b2>   DW_AT_type        : (ref4) <0x2ab>, _IO_wide_data
  <1><2b6>: Abbrev Number: 12 (DW_TAG_array_type)
     <2b7>   DW_AT_type        : (ref4) <0xc6>, char
     <2bb>   DW_AT_sibling     : (ref4) <0x2c6>
@@ -377,50 +377,50 @@
     <2d7>   DW_AT_prototyped  : (flag_present) 1
     <2d7>   DW_AT_type        : (ref4) <0x76>, int
     <2db>   DW_AT_sibling     : (ref4) <0x2e5>
  <2><2df>: Abbrev Number: 16 (DW_TAG_formal_parameter)
     <2e0>   DW_AT_type        : (ref4) <0x53>
  <2><2e4>: Abbrev Number: 0
  <1><2e5>: Abbrev Number: 3 (DW_TAG_typedef)
-    <2e6>   DW_AT_name        : (strp) (offset: 0x10b1): ssize_t
+    <2e6>   DW_AT_name        : (strp) (offset: 0x1175): ssize_t
     <2ea>   DW_AT_decl_file   : (data1) 10
     <2eb>   DW_AT_decl_line   : (data1) 77
     <2ec>   DW_AT_decl_column : (data1) 19
     <2ed>   DW_AT_type        : (ref4) <0xb4>, __ssize_t, long int
  <1><2f1>: Abbrev Number: 17 (DW_TAG_variable)
-    <2f2>   DW_AT_name        : (strp) (offset: 0x1a06): stdin
+    <2f2>   DW_AT_name        : (strp) (offset: 0x1ae4): stdin
     <2f6>   DW_AT_decl_file   : (data1) 10
     <2f7>   DW_AT_decl_line   : (data1) 137
     <2f8>   DW_AT_decl_column : (data1) 14
     <2f9>   DW_AT_type        : (ref4) <0x2fd>, FILE, _IO_FILE
     <2fd>   DW_AT_external    : (flag_present) 1
     <2fd>   DW_AT_declaration : (flag_present) 1
  <1><2fd>: Abbrev Number: 7 (DW_TAG_pointer_type)
     <2fe>   DW_AT_byte_size   : (data1) 8
     <2ff>   DW_AT_type        : (ref4) <0x265>, FILE, _IO_FILE
  <1><303>: Abbrev Number: 14 (DW_TAG_restrict_type)
     <304>   DW_AT_type        : (ref4) <0x2fd>, FILE, _IO_FILE
  <1><308>: Abbrev Number: 17 (DW_TAG_variable)
-    <309>   DW_AT_name        : (strp) (offset: 0x1318): stdout
+    <309>   DW_AT_name        : (strp) (offset: 0x13f9): stdout
     <30d>   DW_AT_decl_file   : (data1) 10
     <30e>   DW_AT_decl_line   : (data1) 138
     <30f>   DW_AT_decl_column : (data1) 14
     <310>   DW_AT_type        : (ref4) <0x2fd>, FILE, _IO_FILE
     <314>   DW_AT_external    : (flag_present) 1
     <314>   DW_AT_declaration : (flag_present) 1
  <1><314>: Abbrev Number: 17 (DW_TAG_variable)
-    <315>   DW_AT_name        : (strp) (offset: 0x1231): stderr
+    <315>   DW_AT_name        : (strp) (offset: 0x1307): stderr
     <319>   DW_AT_decl_file   : (data1) 10
     <31a>   DW_AT_decl_line   : (data1) 139
     <31b>   DW_AT_decl_column : (data1) 14
     <31c>   DW_AT_type        : (ref4) <0x2fd>, FILE, _IO_FILE
     <320>   DW_AT_external    : (flag_present) 1
     <320>   DW_AT_declaration : (flag_present) 1
  <1><320>: Abbrev Number: 17 (DW_TAG_variable)
-    <321>   DW_AT_name        : (strp) (offset: 0x2206): sys_nerr
+    <321>   DW_AT_name        : (strp) (offset: 0x22e1): sys_nerr
     <325>   DW_AT_decl_file   : (data1) 11
     <326>   DW_AT_decl_line   : (data1) 26
     <327>   DW_AT_decl_column : (data1) 12
     <328>   DW_AT_type        : (ref4) <0x76>, int
     <32c>   DW_AT_external    : (flag_present) 1
     <32c>   DW_AT_declaration : (flag_present) 1
  <1><32c>: Abbrev Number: 12 (DW_TAG_array_type)
@@ -435,15 +435,15 @@
     <341>   DW_AT_decl_file   : (data1) 11
     <342>   DW_AT_decl_line   : (data1) 27
     <343>   DW_AT_decl_column : (data1) 26
     <344>   DW_AT_type        : (ref4) <0x337>, char
     <348>   DW_AT_external    : (flag_present) 1
     <348>   DW_AT_declaration : (flag_present) 1
  <1><348>: Abbrev Number: 17 (DW_TAG_variable)
-    <349>   DW_AT_name        : (strp) (offset: 0x2205): _sys_nerr
+    <349>   DW_AT_name        : (strp) (offset: 0x22e0): _sys_nerr
     <34d>   DW_AT_decl_file   : (data1) 11
     <34e>   DW_AT_decl_line   : (data1) 30
     <34f>   DW_AT_decl_column : (data1) 12
     <350>   DW_AT_type        : (ref4) <0x76>, int
     <354>   DW_AT_external    : (flag_present) 1
     <354>   DW_AT_declaration : (flag_present) 1
  <1><354>: Abbrev Number: 17 (DW_TAG_variable)
@@ -451,37 +451,37 @@
     <359>   DW_AT_decl_file   : (data1) 11
     <35a>   DW_AT_decl_line   : (data1) 31
     <35b>   DW_AT_decl_column : (data1) 26
     <35c>   DW_AT_type        : (ref4) <0x337>, char
     <360>   DW_AT_external    : (flag_present) 1
     <360>   DW_AT_declaration : (flag_present) 1
  <1><360>: Abbrev Number: 17 (DW_TAG_variable)
-    <361>   DW_AT_name        : (strp) (offset: 0x1eff): program_invocation_name
+    <361>   DW_AT_name        : (strp) (offset: 0x1fda): program_invocation_name
     <365>   DW_AT_decl_file   : (data1) 12
     <366>   DW_AT_decl_line   : (data1) 45
     <367>   DW_AT_decl_column : (data1) 14
     <368>   DW_AT_type        : (ref4) <0xc0>, char
     <36c>   DW_AT_external    : (flag_present) 1
     <36c>   DW_AT_declaration : (flag_present) 1
  <1><36c>: Abbrev Number: 17 (DW_TAG_variable)
-    <36d>   DW_AT_name        : (strp) (offset: 0x1260): program_invocation_short_name
+    <36d>   DW_AT_name        : (strp) (offset: 0x1336): program_invocation_short_name
     <371>   DW_AT_decl_file   : (data1) 12
     <372>   DW_AT_decl_line   : (data1) 46
     <373>   DW_AT_decl_column : (data1) 14
     <374>   DW_AT_type        : (ref4) <0xc0>, char
     <378>   DW_AT_external    : (flag_present) 1
     <378>   DW_AT_declaration : (flag_present) 1
  <1><378>: Abbrev Number: 2 (DW_TAG_base_type)
     <379>   DW_AT_byte_size   : (data1) 8
     <37a>   DW_AT_encoding    : (data1) 5	(signed)
-    <37b>   DW_AT_name        : (strp) (offset: 0x2360): long long int
+    <37b>   DW_AT_name        : (strp) (offset: 0x243b): long long int
  <1><37f>: Abbrev Number: 2 (DW_TAG_base_type)
     <380>   DW_AT_byte_size   : (data1) 8
     <381>   DW_AT_encoding    : (data1) 7	(unsigned)
-    <382>   DW_AT_name        : (strp) (offset: 0x2047): long long unsigned int
+    <382>   DW_AT_name        : (strp) (offset: 0x212b): long long unsigned int
  <1><386>: Abbrev Number: 7 (DW_TAG_pointer_type)
     <387>   DW_AT_byte_size   : (data1) 8
     <388>   DW_AT_type        : (ref4) <0x38c>
  <1><38c>: Abbrev Number: 19 (DW_TAG_const_type)
  <1><38d>: Abbrev Number: 15 (DW_TAG_subroutine_type)
     <38e>   DW_AT_prototyped  : (flag_present) 1
     <38e>   DW_AT_type        : (ref4) <0x76>, int
@@ -490,8351 +490,8458 @@
     <397>   DW_AT_type        : (ref4) <0x386>
  <2><39b>: Abbrev Number: 16 (DW_TAG_formal_parameter)
     <39c>   DW_AT_type        : (ref4) <0x386>
  <2><3a0>: Abbrev Number: 16 (DW_TAG_formal_parameter)
     <3a1>   DW_AT_type        : (ref4) <0x53>
  <2><3a5>: Abbrev Number: 0
  <1><3a6>: Abbrev Number: 20 (DW_TAG_typedef)
-    <3a7>   DW_AT_name        : (strp) (offset: 0x8ce): intptr_t
+    <3a7>   DW_AT_name        : (strp) (offset: 0x93f): intptr_t
     <3ab>   DW_AT_decl_file   : (data1) 13
     <3ac>   DW_AT_decl_line   : (data2) 267
     <3ae>   DW_AT_decl_column : (data1) 20
     <3af>   DW_AT_type        : (ref4) <0xd2>, __intptr_t, long int
  <1><3b3>: Abbrev Number: 21 (DW_TAG_variable)
-    <3b4>   DW_AT_name        : (strp) (offset: 0x24c): __environ
+    <3b4>   DW_AT_name        : (strp) (offset: 0x253): __environ
     <3b8>   DW_AT_decl_file   : (data1) 13
     <3b9>   DW_AT_decl_line   : (data2) 543
     <3bb>   DW_AT_decl_column : (data1) 15
     <3bc>   DW_AT_type        : (ref4) <0x3c0>, char
     <3c0>   DW_AT_external    : (flag_present) 1
     <3c0>   DW_AT_declaration : (flag_present) 1
  <1><3c0>: Abbrev Number: 7 (DW_TAG_pointer_type)
     <3c1>   DW_AT_byte_size   : (data1) 8
     <3c2>   DW_AT_type        : (ref4) <0xc0>, char
  <1><3c6>: Abbrev Number: 21 (DW_TAG_variable)
-    <3c7>   DW_AT_name        : (strp) (offset: 0x24e): environ
+    <3c7>   DW_AT_name        : (strp) (offset: 0x255): environ
     <3cb>   DW_AT_decl_file   : (data1) 13
     <3cc>   DW_AT_decl_line   : (data2) 545
     <3ce>   DW_AT_decl_column : (data1) 15
     <3cf>   DW_AT_type        : (ref4) <0x3c0>, char
     <3d3>   DW_AT_external    : (flag_present) 1
     <3d3>   DW_AT_declaration : (flag_present) 1
  <1><3d3>: Abbrev Number: 17 (DW_TAG_variable)
-    <3d4>   DW_AT_name        : (strp) (offset: 0x794): optarg
+    <3d4>   DW_AT_name        : (strp) (offset: 0x7f0): optarg
     <3d8>   DW_AT_decl_file   : (data1) 14
     <3d9>   DW_AT_decl_line   : (data1) 36
     <3da>   DW_AT_decl_column : (data1) 14
     <3db>   DW_AT_type        : (ref4) <0xc0>, char
     <3df>   DW_AT_external    : (flag_present) 1
     <3df>   DW_AT_declaration : (flag_present) 1
  <1><3df>: Abbrev Number: 17 (DW_TAG_variable)
-    <3e0>   DW_AT_name        : (strp) (offset: 0x232c): optind
+    <3e0>   DW_AT_name        : (strp) (offset: 0x2407): optind
     <3e4>   DW_AT_decl_file   : (data1) 14
     <3e5>   DW_AT_decl_line   : (data1) 50
     <3e6>   DW_AT_decl_column : (data1) 12
     <3e7>   DW_AT_type        : (ref4) <0x76>, int
     <3eb>   DW_AT_external    : (flag_present) 1
     <3eb>   DW_AT_declaration : (flag_present) 1
  <1><3eb>: Abbrev Number: 17 (DW_TAG_variable)
-    <3ec>   DW_AT_name        : (strp) (offset: 0x163a): opterr
+    <3ec>   DW_AT_name        : (strp) (offset: 0x171b): opterr
     <3f0>   DW_AT_decl_file   : (data1) 14
     <3f1>   DW_AT_decl_line   : (data1) 55
     <3f2>   DW_AT_decl_column : (data1) 12
     <3f3>   DW_AT_type        : (ref4) <0x76>, int
     <3f7>   DW_AT_external    : (flag_present) 1
     <3f7>   DW_AT_declaration : (flag_present) 1
  <1><3f7>: Abbrev Number: 17 (DW_TAG_variable)
-    <3f8>   DW_AT_name        : (strp) (offset: 0x1327): optopt
+    <3f8>   DW_AT_name        : (strp) (offset: 0x1408): optopt
     <3fc>   DW_AT_decl_file   : (data1) 14
     <3fd>   DW_AT_decl_line   : (data1) 59
     <3fe>   DW_AT_decl_column : (data1) 12
     <3ff>   DW_AT_type        : (ref4) <0x76>, int
     <403>   DW_AT_external    : (flag_present) 1
     <403>   DW_AT_declaration : (flag_present) 1
  <1><403>: Abbrev Number: 3 (DW_TAG_typedef)
-    <404>   DW_AT_name        : (strp) (offset: 0x1d9f): uint32_t
+    <404>   DW_AT_name        : (strp) (offset: 0x1e7a): uint32_t
     <408>   DW_AT_decl_file   : (data1) 15
     <409>   DW_AT_decl_line   : (data1) 26
     <40a>   DW_AT_decl_column : (data1) 20
     <40b>   DW_AT_type        : (ref4) <0x7d>, __uint32_t, unsigned int
  <1><40f>: Abbrev Number: 3 (DW_TAG_typedef)
-    <410>   DW_AT_name        : (strp) (offset: 0xfc8): uint64_t
+    <410>   DW_AT_name        : (strp) (offset: 0x1076): uint64_t
     <414>   DW_AT_decl_file   : (data1) 15
     <415>   DW_AT_decl_line   : (data1) 27
     <416>   DW_AT_decl_column : (data1) 20
     <417>   DW_AT_type        : (ref4) <0x90>, __uint64_t, long unsigned int
  <1><41b>: Abbrev Number: 3 (DW_TAG_typedef)
-    <41c>   DW_AT_name        : (strp) (offset: 0x1883): Py_intptr_t
+    <41c>   DW_AT_name        : (strp) (offset: 0x196f): Py_intptr_t
     <420>   DW_AT_decl_file   : (data1) 16
     <421>   DW_AT_decl_line   : (data1) 98
     <422>   DW_AT_decl_column : (data1) 25
     <423>   DW_AT_type        : (ref4) <0x3a6>, intptr_t, __intptr_t, long int
  <1><427>: Abbrev Number: 3 (DW_TAG_typedef)
-    <428>   DW_AT_name        : (strp) (offset: 0x224e): Py_ssize_t
+    <428>   DW_AT_name        : (strp) (offset: 0x2329): Py_ssize_t
     <42c>   DW_AT_decl_file   : (data1) 16
     <42d>   DW_AT_decl_line   : (data1) 105
     <42e>   DW_AT_decl_column : (data1) 25
     <42f>   DW_AT_type        : (ref4) <0x2e5>, ssize_t, __ssize_t, long int
  <1><433>: Abbrev Number: 3 (DW_TAG_typedef)
-    <434>   DW_AT_name        : (strp) (offset: 0xfb0): Py_hash_t
+    <434>   DW_AT_name        : (strp) (offset: 0x105e): Py_hash_t
     <438>   DW_AT_decl_file   : (data1) 16
     <439>   DW_AT_decl_line   : (data1) 114
     <43a>   DW_AT_decl_column : (data1) 20
     <43b>   DW_AT_type        : (ref4) <0x427>, Py_ssize_t, ssize_t, __ssize_t, long int
  <1><43f>: Abbrev Number: 2 (DW_TAG_base_type)
     <440>   DW_AT_byte_size   : (data1) 4
     <441>   DW_AT_encoding    : (data1) 4	(float)
-    <442>   DW_AT_name        : (strp) (offset: 0x17db): float
+    <442>   DW_AT_name        : (strp) (offset: 0x18c7): float
  <1><446>: Abbrev Number: 21 (DW_TAG_variable)
-    <447>   DW_AT_name        : (strp) (offset: 0xf7c): signgam
+    <447>   DW_AT_name        : (strp) (offset: 0x102a): signgam
     <44b>   DW_AT_decl_file   : (data1) 17
     <44c>   DW_AT_decl_line   : (data2) 773
     <44e>   DW_AT_decl_column : (data1) 12
     <44f>   DW_AT_type        : (ref4) <0x76>, int
     <453>   DW_AT_external    : (flag_present) 1
     <453>   DW_AT_declaration : (flag_present) 1
  <1><453>: Abbrev Number: 12 (DW_TAG_array_type)
     <454>   DW_AT_type        : (ref4) <0xc0>, char
     <458>   DW_AT_sibling     : (ref4) <0x463>
  <2><45c>: Abbrev Number: 13 (DW_TAG_subrange_type)
     <45d>   DW_AT_type        : (ref4) <0x40>, long unsigned int
     <461>   DW_AT_upper_bound : (data1) 1
  <2><462>: Abbrev Number: 0
  <1><463>: Abbrev Number: 17 (DW_TAG_variable)
-    <464>   DW_AT_name        : (strp) (offset: 0x640): __tzname
+    <464>   DW_AT_name        : (strp) (offset: 0x68f): __tzname
     <468>   DW_AT_decl_file   : (data1) 18
     <469>   DW_AT_decl_line   : (data1) 159
     <46a>   DW_AT_decl_column : (data1) 14
     <46b>   DW_AT_type        : (ref4) <0x453>, char
     <46f>   DW_AT_external    : (flag_present) 1
     <46f>   DW_AT_declaration : (flag_present) 1
  <1><46f>: Abbrev Number: 17 (DW_TAG_variable)
-    <470>   DW_AT_name        : (strp) (offset: 0x1dbd): __daylight
+    <470>   DW_AT_name        : (strp) (offset: 0x1e98): __daylight
     <474>   DW_AT_decl_file   : (data1) 18
     <475>   DW_AT_decl_line   : (data1) 160
     <476>   DW_AT_decl_column : (data1) 12
     <477>   DW_AT_type        : (ref4) <0x76>, int
     <47b>   DW_AT_external    : (flag_present) 1
     <47b>   DW_AT_declaration : (flag_present) 1
  <1><47b>: Abbrev Number: 17 (DW_TAG_variable)
-    <47c>   DW_AT_name        : (strp) (offset: 0x114f): __timezone
+    <47c>   DW_AT_name        : (strp) (offset: 0x1213): __timezone
     <480>   DW_AT_decl_file   : (data1) 18
     <481>   DW_AT_decl_line   : (data1) 161
     <482>   DW_AT_decl_column : (data1) 17
     <483>   DW_AT_type        : (ref4) <0x89>, long int
     <487>   DW_AT_external    : (flag_present) 1
     <487>   DW_AT_declaration : (flag_present) 1
  <1><487>: Abbrev Number: 17 (DW_TAG_variable)
-    <488>   DW_AT_name        : (strp) (offset: 0x642): tzname
+    <488>   DW_AT_name        : (strp) (offset: 0x691): tzname
     <48c>   DW_AT_decl_file   : (data1) 18
     <48d>   DW_AT_decl_line   : (data1) 166
     <48e>   DW_AT_decl_column : (data1) 14
     <48f>   DW_AT_type        : (ref4) <0x453>, char
     <493>   DW_AT_external    : (flag_present) 1
     <493>   DW_AT_declaration : (flag_present) 1
  <1><493>: Abbrev Number: 17 (DW_TAG_variable)
-    <494>   DW_AT_name        : (strp) (offset: 0x1dbf): daylight
+    <494>   DW_AT_name        : (strp) (offset: 0x1e9a): daylight
     <498>   DW_AT_decl_file   : (data1) 18
     <499>   DW_AT_decl_line   : (data1) 174
     <49a>   DW_AT_decl_column : (data1) 12
     <49b>   DW_AT_type        : (ref4) <0x76>, int
     <49f>   DW_AT_external    : (flag_present) 1
     <49f>   DW_AT_declaration : (flag_present) 1
  <1><49f>: Abbrev Number: 17 (DW_TAG_variable)
-    <4a0>   DW_AT_name        : (strp) (offset: 0x1151): timezone
+    <4a0>   DW_AT_name        : (strp) (offset: 0x1215): timezone
     <4a4>   DW_AT_decl_file   : (data1) 18
     <4a5>   DW_AT_decl_line   : (data1) 175
     <4a6>   DW_AT_decl_column : (data1) 17
     <4a7>   DW_AT_type        : (ref4) <0x89>, long int
     <4ab>   DW_AT_external    : (flag_present) 1
     <4ab>   DW_AT_declaration : (flag_present) 1
  <1><4ab>: Abbrev Number: 21 (DW_TAG_variable)
-    <4ac>   DW_AT_name        : (strp) (offset: 0xd71): getdate_err
+    <4ac>   DW_AT_name        : (strp) (offset: 0xdf5): getdate_err
     <4b0>   DW_AT_decl_file   : (data1) 18
     <4b1>   DW_AT_decl_line   : (data2) 274
     <4b3>   DW_AT_decl_column : (data1) 12
     <4b4>   DW_AT_type        : (ref4) <0x76>, int
     <4b8>   DW_AT_external    : (flag_present) 1
     <4b8>   DW_AT_declaration : (flag_present) 1
- <1><4b8>: Abbrev Number: 3 (DW_TAG_typedef)
-    <4b9>   DW_AT_name        : (strp) (offset: 0x879): PyTypeObject
-    <4bd>   DW_AT_decl_file   : (data1) 3
-    <4be>   DW_AT_decl_line   : (data1) 66
-    <4bf>   DW_AT_decl_column : (data1) 28
-    <4c0>   DW_AT_type        : (ref4) <0x4c9>, _typeobject
- <1><4c4>: Abbrev Number: 4 (DW_TAG_const_type)
-    <4c5>   DW_AT_type        : (ref4) <0x4b8>, PyTypeObject, _typeobject
- <1><4c9>: Abbrev Number: 22 (DW_TAG_structure_type)
-    <4ca>   DW_AT_name        : (strp) (offset: 0x3e9): _typeobject
-    <4ce>   DW_AT_byte_size   : (data2) 408
-    <4d0>   DW_AT_decl_file   : (data1) 19
-    <4d1>   DW_AT_decl_line   : (data1) 193
-    <4d2>   DW_AT_decl_column : (data1) 8
-    <4d3>   DW_AT_sibling     : (ref4) <0x777>
- <2><4d7>: Abbrev Number: 9 (DW_TAG_member)
-    <4d8>   DW_AT_name        : (strp) (offset: 0x871): ob_base
-    <4dc>   DW_AT_decl_file   : (data1) 19
-    <4dd>   DW_AT_decl_line   : (data1) 194
-    <4de>   DW_AT_decl_column : (data1) 5
-    <4df>   DW_AT_type        : (ref4) <0x7da>, PyVarObject
-    <4e3>   DW_AT_data_member_location: (data1) 0
- <2><4e4>: Abbrev Number: 9 (DW_TAG_member)
-    <4e5>   DW_AT_name        : (strp) (offset: 0x131f): tp_name
-    <4e9>   DW_AT_decl_file   : (data1) 19
-    <4ea>   DW_AT_decl_line   : (data1) 195
-    <4eb>   DW_AT_decl_column : (data1) 17
-    <4ec>   DW_AT_type        : (ref4) <0x2c6>, char
-    <4f0>   DW_AT_data_member_location: (data1) 24
- <2><4f1>: Abbrev Number: 9 (DW_TAG_member)
-    <4f2>   DW_AT_name        : (strp) (offset: 0x26b8): tp_basicsize
-    <4f6>   DW_AT_decl_file   : (data1) 19
-    <4f7>   DW_AT_decl_line   : (data1) 196
-    <4f8>   DW_AT_decl_column : (data1) 16
-    <4f9>   DW_AT_type        : (ref4) <0x427>, Py_ssize_t, ssize_t, __ssize_t, long int
-    <4fd>   DW_AT_data_member_location: (data1) 32
- <2><4fe>: Abbrev Number: 9 (DW_TAG_member)
-    <4ff>   DW_AT_name        : (strp) (offset: 0x2a6): tp_itemsize
-    <503>   DW_AT_decl_file   : (data1) 19
-    <504>   DW_AT_decl_line   : (data1) 196
-    <505>   DW_AT_decl_column : (data1) 30
-    <506>   DW_AT_type        : (ref4) <0x427>, Py_ssize_t, ssize_t, __ssize_t, long int
-    <50a>   DW_AT_data_member_location: (data1) 40
- <2><50b>: Abbrev Number: 9 (DW_TAG_member)
-    <50c>   DW_AT_name        : (strp) (offset: 0x3c4): tp_dealloc
-    <510>   DW_AT_decl_file   : (data1) 19
-    <511>   DW_AT_decl_line   : (data1) 200
-    <512>   DW_AT_decl_column : (data1) 16
-    <513>   DW_AT_type        : (ref4) <0x9b5>, destructor
-    <517>   DW_AT_data_member_location: (data1) 48
- <2><518>: Abbrev Number: 9 (DW_TAG_member)
-    <519>   DW_AT_name        : (strp) (offset: 0x183e): tp_vectorcall_offset
-    <51d>   DW_AT_decl_file   : (data1) 19
-    <51e>   DW_AT_decl_line   : (data1) 201
-    <51f>   DW_AT_decl_column : (data1) 16
-    <520>   DW_AT_type        : (ref4) <0x427>, Py_ssize_t, ssize_t, __ssize_t, long int
-    <524>   DW_AT_data_member_location: (data1) 56
- <2><525>: Abbrev Number: 9 (DW_TAG_member)
-    <526>   DW_AT_name        : (strp) (offset: 0x8b): tp_getattr
-    <52a>   DW_AT_decl_file   : (data1) 19
-    <52b>   DW_AT_decl_line   : (data1) 202
-    <52c>   DW_AT_decl_column : (data1) 17
-    <52d>   DW_AT_type        : (ref4) <0x9d2>, getattrfunc, PyObject, _object
-    <531>   DW_AT_data_member_location: (data1) 64
- <2><532>: Abbrev Number: 9 (DW_TAG_member)
-    <533>   DW_AT_name        : (strp) (offset: 0x94b): tp_setattr
-    <537>   DW_AT_decl_file   : (data1) 19
-    <538>   DW_AT_decl_line   : (data1) 203
-    <539>   DW_AT_decl_column : (data1) 17
-    <53a>   DW_AT_type        : (ref4) <0xa04>, setattrfunc, int
-    <53e>   DW_AT_data_member_location: (data1) 72
- <2><53f>: Abbrev Number: 9 (DW_TAG_member)
-    <540>   DW_AT_name        : (strp) (offset: 0x18f): tp_as_async
-    <544>   DW_AT_decl_file   : (data1) 19
-    <545>   DW_AT_decl_line   : (data1) 204
-    <546>   DW_AT_decl_column : (data1) 21
-    <547>   DW_AT_type        : (ref4) <0xfc7>, PyAsyncMethods
-    <54b>   DW_AT_data_member_location: (data1) 80
- <2><54c>: Abbrev Number: 9 (DW_TAG_member)
-    <54d>   DW_AT_name        : (strp) (offset: 0x2216): tp_repr
-    <551>   DW_AT_decl_file   : (data1) 19
-    <552>   DW_AT_decl_line   : (data1) 206
-    <553>   DW_AT_decl_column : (data1) 14
-    <554>   DW_AT_type        : (ref4) <0xa3b>, reprfunc, PyObject, _object
-    <558>   DW_AT_data_member_location: (data1) 88
- <2><559>: Abbrev Number: 9 (DW_TAG_member)
-    <55a>   DW_AT_name        : (strp) (offset: 0x1908): tp_as_number
-    <55e>   DW_AT_decl_file   : (data1) 19
-    <55f>   DW_AT_decl_line   : (data1) 210
-    <560>   DW_AT_decl_column : (data1) 22
-    <561>   DW_AT_type        : (ref4) <0xfcd>, PyNumberMethods
-    <565>   DW_AT_data_member_location: (data1) 96
- <2><566>: Abbrev Number: 9 (DW_TAG_member)
-    <567>   DW_AT_name        : (strp) (offset: 0x1361): tp_as_sequence
-    <56b>   DW_AT_decl_file   : (data1) 19
-    <56c>   DW_AT_decl_line   : (data1) 211
-    <56d>   DW_AT_decl_column : (data1) 24
-    <56e>   DW_AT_type        : (ref4) <0xfd3>, PySequenceMethods
-    <572>   DW_AT_data_member_location: (data1) 104
- <2><573>: Abbrev Number: 9 (DW_TAG_member)
-    <574>   DW_AT_name        : (strp) (offset: 0xc45): tp_as_mapping
-    <578>   DW_AT_decl_file   : (data1) 19
-    <579>   DW_AT_decl_line   : (data1) 212
-    <57a>   DW_AT_decl_column : (data1) 23
-    <57b>   DW_AT_type        : (ref4) <0xfd9>, PyMappingMethods
-    <57f>   DW_AT_data_member_location: (data1) 112
- <2><580>: Abbrev Number: 9 (DW_TAG_member)
-    <581>   DW_AT_name        : (strp) (offset: 0x1b53): tp_hash
-    <585>   DW_AT_decl_file   : (data1) 19
-    <586>   DW_AT_decl_line   : (data1) 216
-    <587>   DW_AT_decl_column : (data1) 14
-    <588>   DW_AT_type        : (ref4) <0xa47>, hashfunc, Py_hash_t, Py_ssize_t, ssize_t, __ssize_t, long int
-    <58c>   DW_AT_data_member_location: (data1) 120
- <2><58d>: Abbrev Number: 9 (DW_TAG_member)
-    <58e>   DW_AT_name        : (strp) (offset: 0x7ca): tp_call
-    <592>   DW_AT_decl_file   : (data1) 19
-    <593>   DW_AT_decl_line   : (data1) 217
-    <594>   DW_AT_decl_column : (data1) 17
-    <595>   DW_AT_type        : (ref4) <0x838>, ternaryfunc, PyObject, _object
-    <599>   DW_AT_data_member_location: (data1) 128
- <2><59a>: Abbrev Number: 9 (DW_TAG_member)
-    <59b>   DW_AT_name        : (strp) (offset: 0x7fa): tp_str
-    <59f>   DW_AT_decl_file   : (data1) 19
-    <5a0>   DW_AT_decl_line   : (data1) 218
-    <5a1>   DW_AT_decl_column : (data1) 14
-    <5a2>   DW_AT_type        : (ref4) <0xa3b>, reprfunc, PyObject, _object
-    <5a6>   DW_AT_data_member_location: (data1) 136
- <2><5a7>: Abbrev Number: 9 (DW_TAG_member)
-    <5a8>   DW_AT_name        : (strp) (offset: 0x15e7): tp_getattro
-    <5ac>   DW_AT_decl_file   : (data1) 19
-    <5ad>   DW_AT_decl_line   : (data1) 219
-    <5ae>   DW_AT_decl_column : (data1) 18
-    <5af>   DW_AT_type        : (ref4) <0x9f8>, getattrofunc, PyObject, _object
-    <5b3>   DW_AT_data_member_location: (data1) 144
- <2><5b4>: Abbrev Number: 9 (DW_TAG_member)
-    <5b5>   DW_AT_name        : (strp) (offset: 0x1d7c): tp_setattro
-    <5b9>   DW_AT_decl_file   : (data1) 19
-    <5ba>   DW_AT_decl_line   : (data1) 220
-    <5bb>   DW_AT_decl_column : (data1) 18
-    <5bc>   DW_AT_type        : (ref4) <0xa2f>, setattrofunc, int
-    <5c0>   DW_AT_data_member_location: (data1) 152
- <2><5c1>: Abbrev Number: 9 (DW_TAG_member)
-    <5c2>   DW_AT_name        : (strp) (offset: 0x1370): tp_as_buffer
-    <5c6>   DW_AT_decl_file   : (data1) 19
-    <5c7>   DW_AT_decl_line   : (data1) 223
-    <5c8>   DW_AT_decl_column : (data1) 20
-    <5c9>   DW_AT_type        : (ref4) <0xfdf>, PyBufferProcs
-    <5cd>   DW_AT_data_member_location: (data1) 160
- <2><5ce>: Abbrev Number: 9 (DW_TAG_member)
-    <5cf>   DW_AT_name        : (strp) (offset: 0x244b): tp_flags
-    <5d3>   DW_AT_decl_file   : (data1) 19
-    <5d4>   DW_AT_decl_line   : (data1) 226
-    <5d5>   DW_AT_decl_column : (data1) 19
-    <5d6>   DW_AT_type        : (ref4) <0x40>, long unsigned int
-    <5da>   DW_AT_data_member_location: (data1) 168
- <2><5db>: Abbrev Number: 9 (DW_TAG_member)
-    <5dc>   DW_AT_name        : (strp) (offset: 0x199e): tp_doc
-    <5e0>   DW_AT_decl_file   : (data1) 19
-    <5e1>   DW_AT_decl_line   : (data1) 228
-    <5e2>   DW_AT_decl_column : (data1) 17
-    <5e3>   DW_AT_type        : (ref4) <0x2c6>, char
-    <5e7>   DW_AT_data_member_location: (data1) 176
- <2><5e8>: Abbrev Number: 9 (DW_TAG_member)
-    <5e9>   DW_AT_name        : (strp) (offset: 0x1cce): tp_traverse
-    <5ed>   DW_AT_decl_file   : (data1) 19
-    <5ee>   DW_AT_decl_line   : (data1) 232
-    <5ef>   DW_AT_decl_column : (data1) 18
-    <5f0>   DW_AT_type        : (ref4) <0x96d>, traverseproc, int
-    <5f4>   DW_AT_data_member_location: (data1) 184
- <2><5f5>: Abbrev Number: 9 (DW_TAG_member)
-    <5f6>   DW_AT_name        : (strp) (offset: 0xae5): tp_clear
-    <5fa>   DW_AT_decl_file   : (data1) 19
-    <5fb>   DW_AT_decl_line   : (data1) 235
-    <5fc>   DW_AT_decl_column : (data1) 13
-    <5fd>   DW_AT_type        : (ref4) <0x863>, inquiry, int
-    <601>   DW_AT_data_member_location: (data1) 192
- <2><602>: Abbrev Number: 9 (DW_TAG_member)
-    <603>   DW_AT_name        : (strp) (offset: 0x52e): tp_richcompare
-    <607>   DW_AT_decl_file   : (data1) 19
-    <608>   DW_AT_decl_line   : (data1) 239
-    <609>   DW_AT_decl_column : (data1) 17
-    <60a>   DW_AT_type        : (ref4) <0xa68>, richcmpfunc, PyObject, _object
-    <60e>   DW_AT_data_member_location: (data1) 200
- <2><60f>: Abbrev Number: 9 (DW_TAG_member)
-    <610>   DW_AT_name        : (strp) (offset: 0x195c): tp_weaklistoffset
-    <614>   DW_AT_decl_file   : (data1) 19
-    <615>   DW_AT_decl_line   : (data1) 242
-    <616>   DW_AT_decl_column : (data1) 16
-    <617>   DW_AT_type        : (ref4) <0x427>, Py_ssize_t, ssize_t, __ssize_t, long int
-    <61b>   DW_AT_data_member_location: (data1) 208
- <2><61c>: Abbrev Number: 9 (DW_TAG_member)
-    <61d>   DW_AT_name        : (strp) (offset: 0x1eb1): tp_iter
-    <621>   DW_AT_decl_file   : (data1) 19
-    <622>   DW_AT_decl_line   : (data1) 245
-    <623>   DW_AT_decl_column : (data1) 17
-    <624>   DW_AT_type        : (ref4) <0xa93>, getiterfunc, PyObject, _object
-    <628>   DW_AT_data_member_location: (data1) 216
- <2><629>: Abbrev Number: 9 (DW_TAG_member)
-    <62a>   DW_AT_name        : (strp) (offset: 0x1e35): tp_iternext
-    <62e>   DW_AT_decl_file   : (data1) 19
-    <62f>   DW_AT_decl_line   : (data1) 246
-    <630>   DW_AT_decl_column : (data1) 18
-    <631>   DW_AT_type        : (ref4) <0xa9f>, iternextfunc, PyObject, _object
-    <635>   DW_AT_data_member_location: (data1) 224
- <2><636>: Abbrev Number: 9 (DW_TAG_member)
-    <637>   DW_AT_name        : (strp) (offset: 0x1677): tp_methods
-    <63b>   DW_AT_decl_file   : (data1) 19
-    <63c>   DW_AT_decl_line   : (data1) 249
-    <63d>   DW_AT_decl_column : (data1) 25
-    <63e>   DW_AT_type        : (ref4) <0x1027>, PyMethodDef
-    <642>   DW_AT_data_member_location: (data1) 232
- <2><643>: Abbrev Number: 9 (DW_TAG_member)
-    <644>   DW_AT_name        : (strp) (offset: 0x1cc3): tp_members
-    <648>   DW_AT_decl_file   : (data1) 19
-    <649>   DW_AT_decl_line   : (data1) 250
-    <64a>   DW_AT_decl_column : (data1) 25
-    <64b>   DW_AT_type        : (ref4) <0x1032>, PyMemberDef
-    <64f>   DW_AT_data_member_location: (data1) 240
- <2><650>: Abbrev Number: 9 (DW_TAG_member)
-    <651>   DW_AT_name        : (strp) (offset: 0x1df6): tp_getset
-    <655>   DW_AT_decl_file   : (data1) 19
-    <656>   DW_AT_decl_line   : (data1) 251
-    <657>   DW_AT_decl_column : (data1) 25
-    <658>   DW_AT_type        : (ref4) <0x1087>, PyGetSetDef
-    <65c>   DW_AT_data_member_location: (data1) 248
- <2><65d>: Abbrev Number: 23 (DW_TAG_member)
-    <65e>   DW_AT_name        : (strp) (offset: 0x1f89): tp_base
-    <662>   DW_AT_decl_file   : (data1) 19
-    <663>   DW_AT_decl_line   : (data1) 252
-    <664>   DW_AT_decl_column : (data1) 25
-    <665>   DW_AT_type        : (ref4) <0x108d>, _typeobject
-    <669>   DW_AT_data_member_location: (data2) 256
- <2><66b>: Abbrev Number: 23 (DW_TAG_member)
-    <66c>   DW_AT_name        : (strp) (offset: 0xc11): tp_dict
-    <670>   DW_AT_decl_file   : (data1) 19
-    <671>   DW_AT_decl_line   : (data1) 253
-    <672>   DW_AT_decl_column : (data1) 15
-    <673>   DW_AT_type        : (ref4) <0x807>, PyObject, _object
-    <677>   DW_AT_data_member_location: (data2) 264
- <2><679>: Abbrev Number: 23 (DW_TAG_member)
-    <67a>   DW_AT_name        : (strp) (offset: 0x1e96): tp_descr_get
-    <67e>   DW_AT_decl_file   : (data1) 19
-    <67f>   DW_AT_decl_line   : (data1) 254
-    <680>   DW_AT_decl_column : (data1) 18
-    <681>   DW_AT_type        : (ref4) <0xaab>, descrgetfunc, PyObject, _object
-    <685>   DW_AT_data_member_location: (data2) 272
- <2><687>: Abbrev Number: 23 (DW_TAG_member)
-    <688>   DW_AT_name        : (strp) (offset: 0x2620): tp_descr_set
-    <68c>   DW_AT_decl_file   : (data1) 19
-    <68d>   DW_AT_decl_line   : (data1) 255
-    <68e>   DW_AT_decl_column : (data1) 18
-    <68f>   DW_AT_type        : (ref4) <0xab7>, descrsetfunc, int
-    <693>   DW_AT_data_member_location: (data2) 280
- <2><695>: Abbrev Number: 24 (DW_TAG_member)
-    <696>   DW_AT_name        : (strp) (offset: 0xa5e): tp_dictoffset
-    <69a>   DW_AT_decl_file   : (data1) 19
-    <69b>   DW_AT_decl_line   : (data2) 256
-    <69d>   DW_AT_decl_column : (data1) 16
-    <69e>   DW_AT_type        : (ref4) <0x427>, Py_ssize_t, ssize_t, __ssize_t, long int
-    <6a2>   DW_AT_data_member_location: (data2) 288
- <2><6a4>: Abbrev Number: 24 (DW_TAG_member)
-    <6a5>   DW_AT_name        : (strp) (offset: 0xbf3): tp_init
-    <6a9>   DW_AT_decl_file   : (data1) 19
-    <6aa>   DW_AT_decl_line   : (data2) 257
-    <6ac>   DW_AT_decl_column : (data1) 14
-    <6ad>   DW_AT_type        : (ref4) <0xac3>, initproc, int
-    <6b1>   DW_AT_data_member_location: (data2) 296
- <2><6b3>: Abbrev Number: 24 (DW_TAG_member)
-    <6b4>   DW_AT_name        : (strp) (offset: 0x13e9): tp_alloc
-    <6b8>   DW_AT_decl_file   : (data1) 19
-    <6b9>   DW_AT_decl_line   : (data2) 258
-    <6bb>   DW_AT_decl_column : (data1) 15
-    <6bc>   DW_AT_type        : (ref4) <0xafa>, allocfunc, PyObject, _object
-    <6c0>   DW_AT_data_member_location: (data2) 304
- <2><6c2>: Abbrev Number: 24 (DW_TAG_member)
-    <6c3>   DW_AT_name        : (strp) (offset: 0x11a6): tp_new
-    <6c7>   DW_AT_decl_file   : (data1) 19
-    <6c8>   DW_AT_decl_line   : (data2) 259
-    <6ca>   DW_AT_decl_column : (data1) 13
-    <6cb>   DW_AT_type        : (ref4) <0xacf>, newfunc, PyObject, _object
-    <6cf>   DW_AT_data_member_location: (data2) 312
- <2><6d1>: Abbrev Number: 24 (DW_TAG_member)
-    <6d2>   DW_AT_name        : (strp) (offset: 0x6a1): tp_free
-    <6d6>   DW_AT_decl_file   : (data1) 19
-    <6d7>   DW_AT_decl_line   : (data2) 260
-    <6d9>   DW_AT_decl_column : (data1) 14
-    <6da>   DW_AT_type        : (ref4) <0x998>, freefunc
-    <6de>   DW_AT_data_member_location: (data2) 320
- <2><6e0>: Abbrev Number: 24 (DW_TAG_member)
-    <6e1>   DW_AT_name        : (strp) (offset: 0x1e7): tp_is_gc
-    <6e5>   DW_AT_decl_file   : (data1) 19
-    <6e6>   DW_AT_decl_line   : (data2) 261
-    <6e8>   DW_AT_decl_column : (data1) 13
-    <6e9>   DW_AT_type        : (ref4) <0x863>, inquiry, int
-    <6ed>   DW_AT_data_member_location: (data2) 328
- <2><6ef>: Abbrev Number: 24 (DW_TAG_member)
-    <6f0>   DW_AT_name        : (strp) (offset: 0x322): tp_bases
-    <6f4>   DW_AT_decl_file   : (data1) 19
-    <6f5>   DW_AT_decl_line   : (data2) 262
-    <6f7>   DW_AT_decl_column : (data1) 15
-    <6f8>   DW_AT_type        : (ref4) <0x807>, PyObject, _object
-    <6fc>   DW_AT_data_member_location: (data2) 336
- <2><6fe>: Abbrev Number: 24 (DW_TAG_member)
-    <6ff>   DW_AT_name        : (strp) (offset: 0x16a0): tp_mro
-    <703>   DW_AT_decl_file   : (data1) 19
-    <704>   DW_AT_decl_line   : (data2) 263
-    <706>   DW_AT_decl_column : (data1) 15
-    <707>   DW_AT_type        : (ref4) <0x807>, PyObject, _object
-    <70b>   DW_AT_data_member_location: (data2) 344
- <2><70d>: Abbrev Number: 24 (DW_TAG_member)
-    <70e>   DW_AT_name        : (strp) (offset: 0x2233): tp_cache
-    <712>   DW_AT_decl_file   : (data1) 19
-    <713>   DW_AT_decl_line   : (data2) 264
-    <715>   DW_AT_decl_column : (data1) 15
-    <716>   DW_AT_type        : (ref4) <0x807>, PyObject, _object
-    <71a>   DW_AT_data_member_location: (data2) 352
- <2><71c>: Abbrev Number: 24 (DW_TAG_member)
-    <71d>   DW_AT_name        : (strp) (offset: 0x1d24): tp_subclasses
-    <721>   DW_AT_decl_file   : (data1) 19
-    <722>   DW_AT_decl_line   : (data2) 265
-    <724>   DW_AT_decl_column : (data1) 15
-    <725>   DW_AT_type        : (ref4) <0x807>, PyObject, _object
-    <729>   DW_AT_data_member_location: (data2) 360
- <2><72b>: Abbrev Number: 24 (DW_TAG_member)
-    <72c>   DW_AT_name        : (strp) (offset: 0x1a2e): tp_weaklist
-    <730>   DW_AT_decl_file   : (data1) 19
-    <731>   DW_AT_decl_line   : (data2) 266
-    <733>   DW_AT_decl_column : (data1) 15
-    <734>   DW_AT_type        : (ref4) <0x807>, PyObject, _object
-    <738>   DW_AT_data_member_location: (data2) 368
- <2><73a>: Abbrev Number: 24 (DW_TAG_member)
-    <73b>   DW_AT_name        : (strp) (offset: 0x12c6): tp_del
-    <73f>   DW_AT_decl_file   : (data1) 19
-    <740>   DW_AT_decl_line   : (data2) 267
-    <742>   DW_AT_decl_column : (data1) 16
-    <743>   DW_AT_type        : (ref4) <0x9b5>, destructor
-    <747>   DW_AT_data_member_location: (data2) 376
- <2><749>: Abbrev Number: 24 (DW_TAG_member)
-    <74a>   DW_AT_name        : (strp) (offset: 0x1bc4): tp_version_tag
-    <74e>   DW_AT_decl_file   : (data1) 19
-    <74f>   DW_AT_decl_line   : (data2) 270
-    <751>   DW_AT_decl_column : (data1) 18
-    <752>   DW_AT_type        : (ref4) <0x47>, unsigned int
-    <756>   DW_AT_data_member_location: (data2) 384
- <2><758>: Abbrev Number: 24 (DW_TAG_member)
-    <759>   DW_AT_name        : (strp) (offset: 0xa9c): tp_finalize
-    <75d>   DW_AT_decl_file   : (data1) 19
-    <75e>   DW_AT_decl_line   : (data2) 272
-    <760>   DW_AT_decl_column : (data1) 16
-    <761>   DW_AT_type        : (ref4) <0x9b5>, destructor
-    <765>   DW_AT_data_member_location: (data2) 392
- <2><767>: Abbrev Number: 24 (DW_TAG_member)
-    <768>   DW_AT_name        : (strp) (offset: 0x1ba1): tp_vectorcall
-    <76c>   DW_AT_decl_file   : (data1) 19
-    <76d>   DW_AT_decl_line   : (data2) 273
-    <76f>   DW_AT_decl_column : (data1) 20
-    <770>   DW_AT_type        : (ref4) <0xc60>, vectorcallfunc, PyObject, _object
-    <774>   DW_AT_data_member_location: (data2) 400
- <2><776>: Abbrev Number: 0
- <1><777>: Abbrev Number: 8 (DW_TAG_structure_type)
-    <778>   DW_AT_name        : (strp) (offset: 0x20dc): _object
-    <77c>   DW_AT_byte_size   : (data1) 16
-    <77d>   DW_AT_decl_file   : (data1) 3
-    <77e>   DW_AT_decl_line   : (data1) 105
-    <77f>   DW_AT_decl_column : (data1) 16
-    <780>   DW_AT_sibling     : (ref4) <0x79f>
- <2><784>: Abbrev Number: 9 (DW_TAG_member)
-    <785>   DW_AT_name        : (strp) (offset: 0x111): ob_refcnt
-    <789>   DW_AT_decl_file   : (data1) 3
-    <78a>   DW_AT_decl_line   : (data1) 107
-    <78b>   DW_AT_decl_column : (data1) 16
-    <78c>   DW_AT_type        : (ref4) <0x427>, Py_ssize_t, ssize_t, __ssize_t, long int
-    <790>   DW_AT_data_member_location: (data1) 0
- <2><791>: Abbrev Number: 9 (DW_TAG_member)
-    <792>   DW_AT_name        : (strp) (offset: 0x679): ob_type
-    <796>   DW_AT_decl_file   : (data1) 3
-    <797>   DW_AT_decl_line   : (data1) 108
-    <798>   DW_AT_decl_column : (data1) 19
-    <799>   DW_AT_type        : (ref4) <0x79f>, PyTypeObject, _typeobject
-    <79d>   DW_AT_data_member_location: (data1) 8
- <2><79e>: Abbrev Number: 0
- <1><79f>: Abbrev Number: 7 (DW_TAG_pointer_type)
-    <7a0>   DW_AT_byte_size   : (data1) 8
-    <7a1>   DW_AT_type        : (ref4) <0x4b8>, PyTypeObject, _typeobject
- <1><7a5>: Abbrev Number: 3 (DW_TAG_typedef)
-    <7a6>   DW_AT_name        : (strp) (offset: 0xff3): PyObject
-    <7aa>   DW_AT_decl_file   : (data1) 3
-    <7ab>   DW_AT_decl_line   : (data1) 109
-    <7ac>   DW_AT_decl_column : (data1) 3
-    <7ad>   DW_AT_type        : (ref4) <0x777>, _object
- <1><7b1>: Abbrev Number: 4 (DW_TAG_const_type)
-    <7b2>   DW_AT_type        : (ref4) <0x7a5>, PyObject, _object
- <1><7b6>: Abbrev Number: 25 (DW_TAG_structure_type)
-    <7b7>   DW_AT_byte_size   : (data1) 24
-    <7b8>   DW_AT_decl_file   : (data1) 3
-    <7b9>   DW_AT_decl_line   : (data1) 115
-    <7ba>   DW_AT_decl_column : (data1) 9
-    <7bb>   DW_AT_sibling     : (ref4) <0x7da>
- <2><7bf>: Abbrev Number: 9 (DW_TAG_member)
-    <7c0>   DW_AT_name        : (strp) (offset: 0x871): ob_base
-    <7c4>   DW_AT_decl_file   : (data1) 3
-    <7c5>   DW_AT_decl_line   : (data1) 116
-    <7c6>   DW_AT_decl_column : (data1) 14
-    <7c7>   DW_AT_type        : (ref4) <0x7a5>, PyObject, _object
-    <7cb>   DW_AT_data_member_location: (data1) 0
- <2><7cc>: Abbrev Number: 9 (DW_TAG_member)
-    <7cd>   DW_AT_name        : (strp) (offset: 0xc09): ob_size
-    <7d1>   DW_AT_decl_file   : (data1) 3
-    <7d2>   DW_AT_decl_line   : (data1) 117
-    <7d3>   DW_AT_decl_column : (data1) 16
-    <7d4>   DW_AT_type        : (ref4) <0x427>, Py_ssize_t, ssize_t, __ssize_t, long int
-    <7d8>   DW_AT_data_member_location: (data1) 16
- <2><7d9>: Abbrev Number: 0
- <1><7da>: Abbrev Number: 3 (DW_TAG_typedef)
-    <7db>   DW_AT_name        : (strp) (offset: 0x719): PyVarObject
-    <7df>   DW_AT_decl_file   : (data1) 3
-    <7e0>   DW_AT_decl_line   : (data1) 118
-    <7e1>   DW_AT_decl_column : (data1) 3
-    <7e2>   DW_AT_type        : (ref4) <0x7b6>
- <1><7e6>: Abbrev Number: 3 (DW_TAG_typedef)
-    <7e7>   DW_AT_name        : (strp) (offset: 0x17a2): unaryfunc
-    <7eb>   DW_AT_decl_file   : (data1) 3
-    <7ec>   DW_AT_decl_line   : (data1) 163
-    <7ed>   DW_AT_decl_column : (data1) 22
-    <7ee>   DW_AT_type        : (ref4) <0x7f2>, PyObject, _object
- <1><7f2>: Abbrev Number: 7 (DW_TAG_pointer_type)
-    <7f3>   DW_AT_byte_size   : (data1) 8
-    <7f4>   DW_AT_type        : (ref4) <0x7f8>, PyObject, _object
- <1><7f8>: Abbrev Number: 15 (DW_TAG_subroutine_type)
-    <7f9>   DW_AT_prototyped  : (flag_present) 1
-    <7f9>   DW_AT_type        : (ref4) <0x807>, PyObject, _object
-    <7fd>   DW_AT_sibling     : (ref4) <0x807>
- <2><801>: Abbrev Number: 16 (DW_TAG_formal_parameter)
-    <802>   DW_AT_type        : (ref4) <0x807>, PyObject, _object
- <2><806>: Abbrev Number: 0
- <1><807>: Abbrev Number: 7 (DW_TAG_pointer_type)
-    <808>   DW_AT_byte_size   : (data1) 8
-    <809>   DW_AT_type        : (ref4) <0x7a5>, PyObject, _object
- <1><80d>: Abbrev Number: 4 (DW_TAG_const_type)
-    <80e>   DW_AT_type        : (ref4) <0x807>, PyObject, _object
- <1><812>: Abbrev Number: 3 (DW_TAG_typedef)
-    <813>   DW_AT_name        : (strp) (offset: 0xc97): binaryfunc
-    <817>   DW_AT_decl_file   : (data1) 3
-    <818>   DW_AT_decl_line   : (data1) 164
-    <819>   DW_AT_decl_column : (data1) 22
-    <81a>   DW_AT_type        : (ref4) <0x81e>, PyObject, _object
- <1><81e>: Abbrev Number: 7 (DW_TAG_pointer_type)
-    <81f>   DW_AT_byte_size   : (data1) 8
-    <820>   DW_AT_type        : (ref4) <0x824>, PyObject, _object
- <1><824>: Abbrev Number: 15 (DW_TAG_subroutine_type)
-    <825>   DW_AT_prototyped  : (flag_present) 1
-    <825>   DW_AT_type        : (ref4) <0x807>, PyObject, _object
-    <829>   DW_AT_sibling     : (ref4) <0x838>
- <2><82d>: Abbrev Number: 16 (DW_TAG_formal_parameter)
-    <82e>   DW_AT_type        : (ref4) <0x807>, PyObject, _object
- <2><832>: Abbrev Number: 16 (DW_TAG_formal_parameter)
-    <833>   DW_AT_type        : (ref4) <0x807>, PyObject, _object
- <2><837>: Abbrev Number: 0
- <1><838>: Abbrev Number: 3 (DW_TAG_typedef)
-    <839>   DW_AT_name        : (strp) (offset: 0x84f): ternaryfunc
-    <83d>   DW_AT_decl_file   : (data1) 3
-    <83e>   DW_AT_decl_line   : (data1) 165
-    <83f>   DW_AT_decl_column : (data1) 22
-    <840>   DW_AT_type        : (ref4) <0x844>, PyObject, _object
- <1><844>: Abbrev Number: 7 (DW_TAG_pointer_type)
-    <845>   DW_AT_byte_size   : (data1) 8
-    <846>   DW_AT_type        : (ref4) <0x84a>, PyObject, _object
- <1><84a>: Abbrev Number: 15 (DW_TAG_subroutine_type)
-    <84b>   DW_AT_prototyped  : (flag_present) 1
-    <84b>   DW_AT_type        : (ref4) <0x807>, PyObject, _object
-    <84f>   DW_AT_sibling     : (ref4) <0x863>
- <2><853>: Abbrev Number: 16 (DW_TAG_formal_parameter)
-    <854>   DW_AT_type        : (ref4) <0x807>, PyObject, _object
- <2><858>: Abbrev Number: 16 (DW_TAG_formal_parameter)
-    <859>   DW_AT_type        : (ref4) <0x807>, PyObject, _object
- <2><85d>: Abbrev Number: 16 (DW_TAG_formal_parameter)
-    <85e>   DW_AT_type        : (ref4) <0x807>, PyObject, _object
- <2><862>: Abbrev Number: 0
- <1><863>: Abbrev Number: 3 (DW_TAG_typedef)
-    <864>   DW_AT_name        : (strp) (offset: 0x1853): inquiry
-    <868>   DW_AT_decl_file   : (data1) 3
-    <869>   DW_AT_decl_line   : (data1) 166
-    <86a>   DW_AT_decl_column : (data1) 15
-    <86b>   DW_AT_type        : (ref4) <0x86f>, int
- <1><86f>: Abbrev Number: 7 (DW_TAG_pointer_type)
-    <870>   DW_AT_byte_size   : (data1) 8
-    <871>   DW_AT_type        : (ref4) <0x875>, int
- <1><875>: Abbrev Number: 15 (DW_TAG_subroutine_type)
-    <876>   DW_AT_prototyped  : (flag_present) 1
-    <876>   DW_AT_type        : (ref4) <0x76>, int
-    <87a>   DW_AT_sibling     : (ref4) <0x884>
- <2><87e>: Abbrev Number: 16 (DW_TAG_formal_parameter)
-    <87f>   DW_AT_type        : (ref4) <0x807>, PyObject, _object
- <2><883>: Abbrev Number: 0
- <1><884>: Abbrev Number: 3 (DW_TAG_typedef)
-    <885>   DW_AT_name        : (strp) (offset: 0x51): lenfunc
-    <889>   DW_AT_decl_file   : (data1) 3
-    <88a>   DW_AT_decl_line   : (data1) 167
-    <88b>   DW_AT_decl_column : (data1) 22
-    <88c>   DW_AT_type        : (ref4) <0x890>, Py_ssize_t, ssize_t, __ssize_t, long int
- <1><890>: Abbrev Number: 7 (DW_TAG_pointer_type)
-    <891>   DW_AT_byte_size   : (data1) 8
-    <892>   DW_AT_type        : (ref4) <0x896>, Py_ssize_t, ssize_t, __ssize_t, long int
- <1><896>: Abbrev Number: 15 (DW_TAG_subroutine_type)
-    <897>   DW_AT_prototyped  : (flag_present) 1
-    <897>   DW_AT_type        : (ref4) <0x427>, Py_ssize_t, ssize_t, __ssize_t, long int
-    <89b>   DW_AT_sibling     : (ref4) <0x8a5>
- <2><89f>: Abbrev Number: 16 (DW_TAG_formal_parameter)
-    <8a0>   DW_AT_type        : (ref4) <0x807>, PyObject, _object
- <2><8a4>: Abbrev Number: 0
- <1><8a5>: Abbrev Number: 3 (DW_TAG_typedef)
-    <8a6>   DW_AT_name        : (strp) (offset: 0xd4b): ssizeargfunc
-    <8aa>   DW_AT_decl_file   : (data1) 3
-    <8ab>   DW_AT_decl_line   : (data1) 168
-    <8ac>   DW_AT_decl_column : (data1) 21
-    <8ad>   DW_AT_type        : (ref4) <0x8b1>, PyObject, _object
- <1><8b1>: Abbrev Number: 7 (DW_TAG_pointer_type)
-    <8b2>   DW_AT_byte_size   : (data1) 8
-    <8b3>   DW_AT_type        : (ref4) <0x8b7>, PyObject, _object
- <1><8b7>: Abbrev Number: 15 (DW_TAG_subroutine_type)
-    <8b8>   DW_AT_prototyped  : (flag_present) 1
-    <8b8>   DW_AT_type        : (ref4) <0x807>, PyObject, _object
-    <8bc>   DW_AT_sibling     : (ref4) <0x8cb>
- <2><8c0>: Abbrev Number: 16 (DW_TAG_formal_parameter)
-    <8c1>   DW_AT_type        : (ref4) <0x807>, PyObject, _object
- <2><8c5>: Abbrev Number: 16 (DW_TAG_formal_parameter)
-    <8c6>   DW_AT_type        : (ref4) <0x427>, Py_ssize_t, ssize_t, __ssize_t, long int
- <2><8ca>: Abbrev Number: 0
- <1><8cb>: Abbrev Number: 3 (DW_TAG_typedef)
-    <8cc>   DW_AT_name        : (strp) (offset: 0x1b91): ssizeobjargproc
-    <8d0>   DW_AT_decl_file   : (data1) 3
-    <8d1>   DW_AT_decl_line   : (data1) 170
-    <8d2>   DW_AT_decl_column : (data1) 14
-    <8d3>   DW_AT_type        : (ref4) <0x8d7>, int
- <1><8d7>: Abbrev Number: 7 (DW_TAG_pointer_type)
-    <8d8>   DW_AT_byte_size   : (data1) 8
-    <8d9>   DW_AT_type        : (ref4) <0x8dd>, int
- <1><8dd>: Abbrev Number: 15 (DW_TAG_subroutine_type)
-    <8de>   DW_AT_prototyped  : (flag_present) 1
-    <8de>   DW_AT_type        : (ref4) <0x76>, int
-    <8e2>   DW_AT_sibling     : (ref4) <0x8f6>
- <2><8e6>: Abbrev Number: 16 (DW_TAG_formal_parameter)
-    <8e7>   DW_AT_type        : (ref4) <0x807>, PyObject, _object
- <2><8eb>: Abbrev Number: 16 (DW_TAG_formal_parameter)
-    <8ec>   DW_AT_type        : (ref4) <0x427>, Py_ssize_t, ssize_t, __ssize_t, long int
- <2><8f0>: Abbrev Number: 16 (DW_TAG_formal_parameter)
-    <8f1>   DW_AT_type        : (ref4) <0x807>, PyObject, _object
- <2><8f5>: Abbrev Number: 0
- <1><8f6>: Abbrev Number: 3 (DW_TAG_typedef)
-    <8f7>   DW_AT_name        : (strp) (offset: 0xbfb): objobjargproc
-    <8fb>   DW_AT_decl_file   : (data1) 3
-    <8fc>   DW_AT_decl_line   : (data1) 172
-    <8fd>   DW_AT_decl_column : (data1) 14
-    <8fe>   DW_AT_type        : (ref4) <0x902>, int
- <1><902>: Abbrev Number: 7 (DW_TAG_pointer_type)
-    <903>   DW_AT_byte_size   : (data1) 8
-    <904>   DW_AT_type        : (ref4) <0x908>, int
- <1><908>: Abbrev Number: 15 (DW_TAG_subroutine_type)
-    <909>   DW_AT_prototyped  : (flag_present) 1
-    <909>   DW_AT_type        : (ref4) <0x76>, int
-    <90d>   DW_AT_sibling     : (ref4) <0x921>
- <2><911>: Abbrev Number: 16 (DW_TAG_formal_parameter)
-    <912>   DW_AT_type        : (ref4) <0x807>, PyObject, _object
- <2><916>: Abbrev Number: 16 (DW_TAG_formal_parameter)
-    <917>   DW_AT_type        : (ref4) <0x807>, PyObject, _object
+ <1><4b8>: Abbrev Number: 22 (DW_TAG_enumeration_type)
+    <4b9>   DW_AT_encoding    : (data1) 7	(unsigned)
+    <4ba>   DW_AT_byte_size   : (data1) 4
+    <4bb>   DW_AT_type        : (ref4) <0x47>, unsigned int
+    <4bf>   DW_AT_decl_file   : (data1) 19
+    <4c0>   DW_AT_decl_line   : (data1) 112
+    <4c1>   DW_AT_decl_column : (data1) 10
+    <4c2>   DW_AT_sibling     : (ref4) <0x4d9>
+ <2><4c6>: Abbrev Number: 23 (DW_TAG_enumerator)
+    <4c7>   DW_AT_name        : (strp) (offset: 0x3ea): TRACEMALLOC_NOT_INITIALIZED
+    <4cb>   DW_AT_const_value : (data1) 0
+ <2><4cc>: Abbrev Number: 23 (DW_TAG_enumerator)
+    <4cd>   DW_AT_name        : (strp) (offset: 0x77f): TRACEMALLOC_INITIALIZED
+    <4d1>   DW_AT_const_value : (data1) 1
+ <2><4d2>: Abbrev Number: 23 (DW_TAG_enumerator)
+    <4d3>   DW_AT_name        : (strp) (offset: 0xddf): TRACEMALLOC_FINALIZED
+    <4d7>   DW_AT_const_value : (data1) 2
+ <2><4d8>: Abbrev Number: 0
+ <1><4d9>: Abbrev Number: 8 (DW_TAG_structure_type)
+    <4da>   DW_AT_name        : (strp) (offset: 0x111b): _PyTraceMalloc_Config
+    <4de>   DW_AT_byte_size   : (data1) 16
+    <4df>   DW_AT_decl_file   : (data1) 19
+    <4e0>   DW_AT_decl_line   : (data1) 109
+    <4e1>   DW_AT_decl_column : (data1) 8
+    <4e2>   DW_AT_sibling     : (ref4) <0x51b>
+ <2><4e6>: Abbrev Number: 9 (DW_TAG_member)
+    <4e7>   DW_AT_name        : (strp) (offset: 0xa95): initialized
+    <4eb>   DW_AT_decl_file   : (data1) 19
+    <4ec>   DW_AT_decl_line   : (data1) 116
+    <4ed>   DW_AT_decl_column : (data1) 7
+    <4ee>   DW_AT_type        : (ref4) <0x4b8>, unsigned int
+    <4f2>   DW_AT_data_member_location: (data1) 0
+ <2><4f3>: Abbrev Number: 9 (DW_TAG_member)
+    <4f4>   DW_AT_name        : (strp) (offset: 0xc05): tracing
+    <4f8>   DW_AT_decl_file   : (data1) 19
+    <4f9>   DW_AT_decl_line   : (data1) 120
+    <4fa>   DW_AT_decl_column : (data1) 9
+    <4fb>   DW_AT_type        : (ref4) <0x76>, int
+    <4ff>   DW_AT_data_member_location: (data1) 4
+ <2><500>: Abbrev Number: 9 (DW_TAG_member)
+    <501>   DW_AT_name        : (strp) (offset: 0x1735): max_nframe
+    <505>   DW_AT_decl_file   : (data1) 19
+    <506>   DW_AT_decl_line   : (data1) 124
+    <507>   DW_AT_decl_column : (data1) 9
+    <508>   DW_AT_type        : (ref4) <0x76>, int
+    <50c>   DW_AT_data_member_location: (data1) 8
+ <2><50d>: Abbrev Number: 9 (DW_TAG_member)
+    <50e>   DW_AT_name        : (strp) (offset: 0x13ee): use_domain
+    <512>   DW_AT_decl_file   : (data1) 19
+    <513>   DW_AT_decl_line   : (data1) 128
+    <514>   DW_AT_decl_column : (data1) 9
+    <515>   DW_AT_type        : (ref4) <0x76>, int
+    <519>   DW_AT_data_member_location: (data1) 12
+ <2><51a>: Abbrev Number: 0
+ <1><51b>: Abbrev Number: 17 (DW_TAG_variable)
+    <51c>   DW_AT_name        : (strp) (offset: 0xff5): _Py_tracemalloc_config
+    <520>   DW_AT_decl_file   : (data1) 19
+    <521>   DW_AT_decl_line   : (data1) 131
+    <522>   DW_AT_decl_column : (data1) 42
+    <523>   DW_AT_type        : (ref4) <0x4d9>, _PyTraceMalloc_Config
+    <527>   DW_AT_external    : (flag_present) 1
+    <527>   DW_AT_declaration : (flag_present) 1
+ <1><527>: Abbrev Number: 8 (DW_TAG_structure_type)
+    <528>   DW_AT_name        : (strp) (offset: 0x21c0): _object
+    <52c>   DW_AT_byte_size   : (data1) 16
+    <52d>   DW_AT_decl_file   : (data1) 3
+    <52e>   DW_AT_decl_line   : (data1) 104
+    <52f>   DW_AT_decl_column : (data1) 16
+    <530>   DW_AT_sibling     : (ref4) <0x54f>
+ <2><534>: Abbrev Number: 9 (DW_TAG_member)
+    <535>   DW_AT_name        : (strp) (offset: 0x111): ob_refcnt
+    <539>   DW_AT_decl_file   : (data1) 3
+    <53a>   DW_AT_decl_line   : (data1) 106
+    <53b>   DW_AT_decl_column : (data1) 16
+    <53c>   DW_AT_type        : (ref4) <0x427>, Py_ssize_t, ssize_t, __ssize_t, long int
+    <540>   DW_AT_data_member_location: (data1) 0
+ <2><541>: Abbrev Number: 9 (DW_TAG_member)
+    <542>   DW_AT_name        : (strp) (offset: 0x6c8): ob_type
+    <546>   DW_AT_decl_file   : (data1) 3
+    <547>   DW_AT_decl_line   : (data1) 107
+    <548>   DW_AT_decl_column : (data1) 25
+    <549>   DW_AT_type        : (ref4) <0x7ff>, _typeobject
+    <54d>   DW_AT_data_member_location: (data1) 8
+ <2><54e>: Abbrev Number: 0
+ <1><54f>: Abbrev Number: 24 (DW_TAG_structure_type)
+    <550>   DW_AT_name        : (strp) (offset: 0x420): _typeobject
+    <554>   DW_AT_byte_size   : (data2) 416
+    <556>   DW_AT_decl_file   : (data1) 20
+    <557>   DW_AT_decl_line   : (data1) 177
+    <558>   DW_AT_decl_column : (data1) 16
+    <559>   DW_AT_sibling     : (ref4) <0x7ff>
+ <2><55d>: Abbrev Number: 9 (DW_TAG_member)
+    <55e>   DW_AT_name        : (strp) (offset: 0x8cd): ob_base
+    <562>   DW_AT_decl_file   : (data1) 20
+    <563>   DW_AT_decl_line   : (data1) 178
+    <564>   DW_AT_decl_column : (data1) 5
+    <565>   DW_AT_type        : (ref4) <0x835>, PyVarObject
+    <569>   DW_AT_data_member_location: (data1) 0
+ <2><56a>: Abbrev Number: 9 (DW_TAG_member)
+    <56b>   DW_AT_name        : (strp) (offset: 0x1400): tp_name
+    <56f>   DW_AT_decl_file   : (data1) 20
+    <570>   DW_AT_decl_line   : (data1) 179
+    <571>   DW_AT_decl_column : (data1) 17
+    <572>   DW_AT_type        : (ref4) <0x2c6>, char
+    <576>   DW_AT_data_member_location: (data1) 24
+ <2><577>: Abbrev Number: 9 (DW_TAG_member)
+    <578>   DW_AT_name        : (strp) (offset: 0x2793): tp_basicsize
+    <57c>   DW_AT_decl_file   : (data1) 20
+    <57d>   DW_AT_decl_line   : (data1) 180
+    <57e>   DW_AT_decl_column : (data1) 16
+    <57f>   DW_AT_type        : (ref4) <0x427>, Py_ssize_t, ssize_t, __ssize_t, long int
+    <583>   DW_AT_data_member_location: (data1) 32
+ <2><584>: Abbrev Number: 9 (DW_TAG_member)
+    <585>   DW_AT_name        : (strp) (offset: 0x2ad): tp_itemsize
+    <589>   DW_AT_decl_file   : (data1) 20
+    <58a>   DW_AT_decl_line   : (data1) 180
+    <58b>   DW_AT_decl_column : (data1) 30
+    <58c>   DW_AT_type        : (ref4) <0x427>, Py_ssize_t, ssize_t, __ssize_t, long int
+    <590>   DW_AT_data_member_location: (data1) 40
+ <2><591>: Abbrev Number: 9 (DW_TAG_member)
+    <592>   DW_AT_name        : (strp) (offset: 0x3df): tp_dealloc
+    <596>   DW_AT_decl_file   : (data1) 20
+    <597>   DW_AT_decl_line   : (data1) 184
+    <598>   DW_AT_decl_column : (data1) 16
+    <599>   DW_AT_type        : (ref4) <0xa10>, destructor
+    <59d>   DW_AT_data_member_location: (data1) 48
+ <2><59e>: Abbrev Number: 9 (DW_TAG_member)
+    <59f>   DW_AT_name        : (strp) (offset: 0x192a): tp_vectorcall_offset
+    <5a3>   DW_AT_decl_file   : (data1) 20
+    <5a4>   DW_AT_decl_line   : (data1) 185
+    <5a5>   DW_AT_decl_column : (data1) 16
+    <5a6>   DW_AT_type        : (ref4) <0x427>, Py_ssize_t, ssize_t, __ssize_t, long int
+    <5aa>   DW_AT_data_member_location: (data1) 56
+ <2><5ab>: Abbrev Number: 9 (DW_TAG_member)
+    <5ac>   DW_AT_name        : (strp) (offset: 0x8b): tp_getattr
+    <5b0>   DW_AT_decl_file   : (data1) 20
+    <5b1>   DW_AT_decl_line   : (data1) 186
+    <5b2>   DW_AT_decl_column : (data1) 17
+    <5b3>   DW_AT_type        : (ref4) <0xa2d>, getattrfunc, PyObject, _object
+    <5b7>   DW_AT_data_member_location: (data1) 64
+ <2><5b8>: Abbrev Number: 9 (DW_TAG_member)
+    <5b9>   DW_AT_name        : (strp) (offset: 0x9bc): tp_setattr
+    <5bd>   DW_AT_decl_file   : (data1) 20
+    <5be>   DW_AT_decl_line   : (data1) 187
+    <5bf>   DW_AT_decl_column : (data1) 17
+    <5c0>   DW_AT_type        : (ref4) <0xa5f>, setattrfunc, int
+    <5c4>   DW_AT_data_member_location: (data1) 72
+ <2><5c5>: Abbrev Number: 9 (DW_TAG_member)
+    <5c6>   DW_AT_name        : (strp) (offset: 0x196): tp_as_async
+    <5ca>   DW_AT_decl_file   : (data1) 20
+    <5cb>   DW_AT_decl_line   : (data1) 188
+    <5cc>   DW_AT_decl_column : (data1) 21
+    <5cd>   DW_AT_type        : (ref4) <0x1022>, PyAsyncMethods
+    <5d1>   DW_AT_data_member_location: (data1) 80
+ <2><5d2>: Abbrev Number: 9 (DW_TAG_member)
+    <5d3>   DW_AT_name        : (strp) (offset: 0x22f1): tp_repr
+    <5d7>   DW_AT_decl_file   : (data1) 20
+    <5d8>   DW_AT_decl_line   : (data1) 190
+    <5d9>   DW_AT_decl_column : (data1) 14
+    <5da>   DW_AT_type        : (ref4) <0xa96>, reprfunc, PyObject, _object
+    <5de>   DW_AT_data_member_location: (data1) 88
+ <2><5df>: Abbrev Number: 9 (DW_TAG_member)
+    <5e0>   DW_AT_name        : (strp) (offset: 0x19f4): tp_as_number
+    <5e4>   DW_AT_decl_file   : (data1) 20
+    <5e5>   DW_AT_decl_line   : (data1) 194
+    <5e6>   DW_AT_decl_column : (data1) 22
+    <5e7>   DW_AT_type        : (ref4) <0x1028>, PyNumberMethods
+    <5eb>   DW_AT_data_member_location: (data1) 96
+ <2><5ec>: Abbrev Number: 9 (DW_TAG_member)
+    <5ed>   DW_AT_name        : (strp) (offset: 0x1442): tp_as_sequence
+    <5f1>   DW_AT_decl_file   : (data1) 20
+    <5f2>   DW_AT_decl_line   : (data1) 195
+    <5f3>   DW_AT_decl_column : (data1) 24
+    <5f4>   DW_AT_type        : (ref4) <0x102e>, PySequenceMethods
+    <5f8>   DW_AT_data_member_location: (data1) 104
+ <2><5f9>: Abbrev Number: 9 (DW_TAG_member)
+    <5fa>   DW_AT_name        : (strp) (offset: 0xcc2): tp_as_mapping
+    <5fe>   DW_AT_decl_file   : (data1) 20
+    <5ff>   DW_AT_decl_line   : (data1) 196
+    <600>   DW_AT_decl_column : (data1) 23
+    <601>   DW_AT_type        : (ref4) <0x1034>, PyMappingMethods
+    <605>   DW_AT_data_member_location: (data1) 112
+ <2><606>: Abbrev Number: 9 (DW_TAG_member)
+    <607>   DW_AT_name        : (strp) (offset: 0x1c25): tp_hash
+    <60b>   DW_AT_decl_file   : (data1) 20
+    <60c>   DW_AT_decl_line   : (data1) 200
+    <60d>   DW_AT_decl_column : (data1) 14
+    <60e>   DW_AT_type        : (ref4) <0xaa2>, hashfunc, Py_hash_t, Py_ssize_t, ssize_t, __ssize_t, long int
+    <612>   DW_AT_data_member_location: (data1) 120
+ <2><613>: Abbrev Number: 9 (DW_TAG_member)
+    <614>   DW_AT_name        : (strp) (offset: 0x826): tp_call
+    <618>   DW_AT_decl_file   : (data1) 20
+    <619>   DW_AT_decl_line   : (data1) 201
+    <61a>   DW_AT_decl_column : (data1) 17
+    <61b>   DW_AT_type        : (ref4) <0x893>, ternaryfunc, PyObject, _object
+    <61f>   DW_AT_data_member_location: (data1) 128
+ <2><620>: Abbrev Number: 9 (DW_TAG_member)
+    <621>   DW_AT_name        : (strp) (offset: 0x856): tp_str
+    <625>   DW_AT_decl_file   : (data1) 20
+    <626>   DW_AT_decl_line   : (data1) 202
+    <627>   DW_AT_decl_column : (data1) 14
+    <628>   DW_AT_type        : (ref4) <0xa96>, reprfunc, PyObject, _object
+    <62c>   DW_AT_data_member_location: (data1) 136
+ <2><62d>: Abbrev Number: 9 (DW_TAG_member)
+    <62e>   DW_AT_name        : (strp) (offset: 0x16c8): tp_getattro
+    <632>   DW_AT_decl_file   : (data1) 20
+    <633>   DW_AT_decl_line   : (data1) 203
+    <634>   DW_AT_decl_column : (data1) 18
+    <635>   DW_AT_type        : (ref4) <0xa53>, getattrofunc, PyObject, _object
+    <639>   DW_AT_data_member_location: (data1) 144
+ <2><63a>: Abbrev Number: 9 (DW_TAG_member)
+    <63b>   DW_AT_name        : (strp) (offset: 0x1e57): tp_setattro
+    <63f>   DW_AT_decl_file   : (data1) 20
+    <640>   DW_AT_decl_line   : (data1) 204
+    <641>   DW_AT_decl_column : (data1) 18
+    <642>   DW_AT_type        : (ref4) <0xa8a>, setattrofunc, int
+    <646>   DW_AT_data_member_location: (data1) 152
+ <2><647>: Abbrev Number: 9 (DW_TAG_member)
+    <648>   DW_AT_name        : (strp) (offset: 0x1451): tp_as_buffer
+    <64c>   DW_AT_decl_file   : (data1) 20
+    <64d>   DW_AT_decl_line   : (data1) 207
+    <64e>   DW_AT_decl_column : (data1) 20
+    <64f>   DW_AT_type        : (ref4) <0x103a>, PyBufferProcs
+    <653>   DW_AT_data_member_location: (data1) 160
+ <2><654>: Abbrev Number: 9 (DW_TAG_member)
+    <655>   DW_AT_name        : (strp) (offset: 0x2526): tp_flags
+    <659>   DW_AT_decl_file   : (data1) 20
+    <65a>   DW_AT_decl_line   : (data1) 210
+    <65b>   DW_AT_decl_column : (data1) 19
+    <65c>   DW_AT_type        : (ref4) <0x40>, long unsigned int
+    <660>   DW_AT_data_member_location: (data1) 168
+ <2><661>: Abbrev Number: 9 (DW_TAG_member)
+    <662>   DW_AT_name        : (strp) (offset: 0x1a7c): tp_doc
+    <666>   DW_AT_decl_file   : (data1) 20
+    <667>   DW_AT_decl_line   : (data1) 212
+    <668>   DW_AT_decl_column : (data1) 17
+    <669>   DW_AT_type        : (ref4) <0x2c6>, char
+    <66d>   DW_AT_data_member_location: (data1) 176
+ <2><66e>: Abbrev Number: 9 (DW_TAG_member)
+    <66f>   DW_AT_name        : (strp) (offset: 0x1da0): tp_traverse
+    <673>   DW_AT_decl_file   : (data1) 20
+    <674>   DW_AT_decl_line   : (data1) 216
+    <675>   DW_AT_decl_column : (data1) 18
+    <676>   DW_AT_type        : (ref4) <0x9c8>, traverseproc, int
+    <67a>   DW_AT_data_member_location: (data1) 184
+ <2><67b>: Abbrev Number: 9 (DW_TAG_member)
+    <67c>   DW_AT_name        : (strp) (offset: 0xb62): tp_clear
+    <680>   DW_AT_decl_file   : (data1) 20
+    <681>   DW_AT_decl_line   : (data1) 219
+    <682>   DW_AT_decl_column : (data1) 13
+    <683>   DW_AT_type        : (ref4) <0x8be>, inquiry, int
+    <687>   DW_AT_data_member_location: (data1) 192
+ <2><688>: Abbrev Number: 9 (DW_TAG_member)
+    <689>   DW_AT_name        : (strp) (offset: 0x565): tp_richcompare
+    <68d>   DW_AT_decl_file   : (data1) 20
+    <68e>   DW_AT_decl_line   : (data1) 223
+    <68f>   DW_AT_decl_column : (data1) 17
+    <690>   DW_AT_type        : (ref4) <0xac3>, richcmpfunc, PyObject, _object
+    <694>   DW_AT_data_member_location: (data1) 200
+ <2><695>: Abbrev Number: 9 (DW_TAG_member)
+    <696>   DW_AT_name        : (strp) (offset: 0x1a48): tp_weaklistoffset
+    <69a>   DW_AT_decl_file   : (data1) 20
+    <69b>   DW_AT_decl_line   : (data1) 226
+    <69c>   DW_AT_decl_column : (data1) 16
+    <69d>   DW_AT_type        : (ref4) <0x427>, Py_ssize_t, ssize_t, __ssize_t, long int
+    <6a1>   DW_AT_data_member_location: (data1) 208
+ <2><6a2>: Abbrev Number: 9 (DW_TAG_member)
+    <6a3>   DW_AT_name        : (strp) (offset: 0x1f8c): tp_iter
+    <6a7>   DW_AT_decl_file   : (data1) 20
+    <6a8>   DW_AT_decl_line   : (data1) 229
+    <6a9>   DW_AT_decl_column : (data1) 17
+    <6aa>   DW_AT_type        : (ref4) <0xaee>, getiterfunc, PyObject, _object
+    <6ae>   DW_AT_data_member_location: (data1) 216
+ <2><6af>: Abbrev Number: 9 (DW_TAG_member)
+    <6b0>   DW_AT_name        : (strp) (offset: 0x1f10): tp_iternext
+    <6b4>   DW_AT_decl_file   : (data1) 20
+    <6b5>   DW_AT_decl_line   : (data1) 230
+    <6b6>   DW_AT_decl_column : (data1) 18
+    <6b7>   DW_AT_type        : (ref4) <0xafa>, iternextfunc, PyObject, _object
+    <6bb>   DW_AT_data_member_location: (data1) 224
+ <2><6bc>: Abbrev Number: 9 (DW_TAG_member)
+    <6bd>   DW_AT_name        : (strp) (offset: 0x1756): tp_methods
+    <6c1>   DW_AT_decl_file   : (data1) 20
+    <6c2>   DW_AT_decl_line   : (data1) 233
+    <6c3>   DW_AT_decl_column : (data1) 25
+    <6c4>   DW_AT_type        : (ref4) <0x1082>, PyMethodDef
+    <6c8>   DW_AT_data_member_location: (data1) 232
+ <2><6c9>: Abbrev Number: 9 (DW_TAG_member)
+    <6ca>   DW_AT_name        : (strp) (offset: 0x1d95): tp_members
+    <6ce>   DW_AT_decl_file   : (data1) 20
+    <6cf>   DW_AT_decl_line   : (data1) 234
+    <6d0>   DW_AT_decl_column : (data1) 25
+    <6d1>   DW_AT_type        : (ref4) <0x108d>, PyMemberDef
+    <6d5>   DW_AT_data_member_location: (data1) 240
+ <2><6d6>: Abbrev Number: 9 (DW_TAG_member)
+    <6d7>   DW_AT_name        : (strp) (offset: 0x1ed1): tp_getset
+    <6db>   DW_AT_decl_file   : (data1) 20
+    <6dc>   DW_AT_decl_line   : (data1) 235
+    <6dd>   DW_AT_decl_column : (data1) 25
+    <6de>   DW_AT_type        : (ref4) <0x10e2>, PyGetSetDef
+    <6e2>   DW_AT_data_member_location: (data1) 248
+ <2><6e3>: Abbrev Number: 25 (DW_TAG_member)
+    <6e4>   DW_AT_name        : (strp) (offset: 0x2064): tp_base
+    <6e8>   DW_AT_decl_file   : (data1) 20
+    <6e9>   DW_AT_decl_line   : (data1) 236
+    <6ea>   DW_AT_decl_column : (data1) 25
+    <6eb>   DW_AT_type        : (ref4) <0x7ff>, _typeobject
+    <6ef>   DW_AT_data_member_location: (data2) 256
+ <2><6f1>: Abbrev Number: 25 (DW_TAG_member)
+    <6f2>   DW_AT_name        : (strp) (offset: 0xc8e): tp_dict
+    <6f6>   DW_AT_decl_file   : (data1) 20
+    <6f7>   DW_AT_decl_line   : (data1) 237
+    <6f8>   DW_AT_decl_column : (data1) 15
+    <6f9>   DW_AT_type        : (ref4) <0x862>, PyObject, _object
+    <6fd>   DW_AT_data_member_location: (data2) 264
+ <2><6ff>: Abbrev Number: 25 (DW_TAG_member)
+    <700>   DW_AT_name        : (strp) (offset: 0x1f71): tp_descr_get
+    <704>   DW_AT_decl_file   : (data1) 20
+    <705>   DW_AT_decl_line   : (data1) 238
+    <706>   DW_AT_decl_column : (data1) 18
+    <707>   DW_AT_type        : (ref4) <0xb06>, descrgetfunc, PyObject, _object
+    <70b>   DW_AT_data_member_location: (data2) 272
+ <2><70d>: Abbrev Number: 25 (DW_TAG_member)
+    <70e>   DW_AT_name        : (strp) (offset: 0x26fb): tp_descr_set
+    <712>   DW_AT_decl_file   : (data1) 20
+    <713>   DW_AT_decl_line   : (data1) 239
+    <714>   DW_AT_decl_column : (data1) 18
+    <715>   DW_AT_type        : (ref4) <0xb12>, descrsetfunc, int
+    <719>   DW_AT_data_member_location: (data2) 280
+ <2><71b>: Abbrev Number: 25 (DW_TAG_member)
+    <71c>   DW_AT_name        : (strp) (offset: 0xadb): tp_dictoffset
+    <720>   DW_AT_decl_file   : (data1) 20
+    <721>   DW_AT_decl_line   : (data1) 240
+    <722>   DW_AT_decl_column : (data1) 16
+    <723>   DW_AT_type        : (ref4) <0x427>, Py_ssize_t, ssize_t, __ssize_t, long int
+    <727>   DW_AT_data_member_location: (data2) 288
+ <2><729>: Abbrev Number: 25 (DW_TAG_member)
+    <72a>   DW_AT_name        : (strp) (offset: 0xc70): tp_init
+    <72e>   DW_AT_decl_file   : (data1) 20
+    <72f>   DW_AT_decl_line   : (data1) 241
+    <730>   DW_AT_decl_column : (data1) 14
+    <731>   DW_AT_type        : (ref4) <0xb1e>, initproc, int
+    <735>   DW_AT_data_member_location: (data2) 296
+ <2><737>: Abbrev Number: 25 (DW_TAG_member)
+    <738>   DW_AT_name        : (strp) (offset: 0x14ca): tp_alloc
+    <73c>   DW_AT_decl_file   : (data1) 20
+    <73d>   DW_AT_decl_line   : (data1) 242
+    <73e>   DW_AT_decl_column : (data1) 15
+    <73f>   DW_AT_type        : (ref4) <0xb55>, allocfunc, PyObject, _object
+    <743>   DW_AT_data_member_location: (data2) 304
+ <2><745>: Abbrev Number: 25 (DW_TAG_member)
+    <746>   DW_AT_name        : (strp) (offset: 0x127c): tp_new
+    <74a>   DW_AT_decl_file   : (data1) 20
+    <74b>   DW_AT_decl_line   : (data1) 243
+    <74c>   DW_AT_decl_column : (data1) 13
+    <74d>   DW_AT_type        : (ref4) <0xb2a>, newfunc, PyObject, _object
+    <751>   DW_AT_data_member_location: (data2) 312
+ <2><753>: Abbrev Number: 25 (DW_TAG_member)
+    <754>   DW_AT_name        : (strp) (offset: 0x6f0): tp_free
+    <758>   DW_AT_decl_file   : (data1) 20
+    <759>   DW_AT_decl_line   : (data1) 244
+    <75a>   DW_AT_decl_column : (data1) 14
+    <75b>   DW_AT_type        : (ref4) <0x9f3>, freefunc
+    <75f>   DW_AT_data_member_location: (data2) 320
+ <2><761>: Abbrev Number: 25 (DW_TAG_member)
+    <762>   DW_AT_name        : (strp) (offset: 0x1ee): tp_is_gc
+    <766>   DW_AT_decl_file   : (data1) 20
+    <767>   DW_AT_decl_line   : (data1) 245
+    <768>   DW_AT_decl_column : (data1) 13
+    <769>   DW_AT_type        : (ref4) <0x8be>, inquiry, int
+    <76d>   DW_AT_data_member_location: (data2) 328
+ <2><76f>: Abbrev Number: 25 (DW_TAG_member)
+    <770>   DW_AT_name        : (strp) (offset: 0x33d): tp_bases
+    <774>   DW_AT_decl_file   : (data1) 20
+    <775>   DW_AT_decl_line   : (data1) 246
+    <776>   DW_AT_decl_column : (data1) 15
+    <777>   DW_AT_type        : (ref4) <0x862>, PyObject, _object
+    <77b>   DW_AT_data_member_location: (data2) 336
+ <2><77d>: Abbrev Number: 25 (DW_TAG_member)
+    <77e>   DW_AT_name        : (strp) (offset: 0x177f): tp_mro
+    <782>   DW_AT_decl_file   : (data1) 20
+    <783>   DW_AT_decl_line   : (data1) 247
+    <784>   DW_AT_decl_column : (data1) 15
+    <785>   DW_AT_type        : (ref4) <0x862>, PyObject, _object
+    <789>   DW_AT_data_member_location: (data2) 344
+ <2><78b>: Abbrev Number: 25 (DW_TAG_member)
+    <78c>   DW_AT_name        : (strp) (offset: 0x230e): tp_cache
+    <790>   DW_AT_decl_file   : (data1) 20
+    <791>   DW_AT_decl_line   : (data1) 248
+    <792>   DW_AT_decl_column : (data1) 15
+    <793>   DW_AT_type        : (ref4) <0x862>, PyObject, _object
+    <797>   DW_AT_data_member_location: (data2) 352
+ <2><799>: Abbrev Number: 25 (DW_TAG_member)
+    <79a>   DW_AT_name        : (strp) (offset: 0x1df6): tp_subclasses
+    <79e>   DW_AT_decl_file   : (data1) 20
+    <79f>   DW_AT_decl_line   : (data1) 249
+    <7a0>   DW_AT_decl_column : (data1) 15
+    <7a1>   DW_AT_type        : (ref4) <0x862>, PyObject, _object
+    <7a5>   DW_AT_data_member_location: (data2) 360
+ <2><7a7>: Abbrev Number: 25 (DW_TAG_member)
+    <7a8>   DW_AT_name        : (strp) (offset: 0x1b0c): tp_weaklist
+    <7ac>   DW_AT_decl_file   : (data1) 20
+    <7ad>   DW_AT_decl_line   : (data1) 250
+    <7ae>   DW_AT_decl_column : (data1) 15
+    <7af>   DW_AT_type        : (ref4) <0x862>, PyObject, _object
+    <7b3>   DW_AT_data_member_location: (data2) 368
+ <2><7b5>: Abbrev Number: 25 (DW_TAG_member)
+    <7b6>   DW_AT_name        : (strp) (offset: 0x139c): tp_del
+    <7ba>   DW_AT_decl_file   : (data1) 20
+    <7bb>   DW_AT_decl_line   : (data1) 251
+    <7bc>   DW_AT_decl_column : (data1) 16
+    <7bd>   DW_AT_type        : (ref4) <0xa10>, destructor
+    <7c1>   DW_AT_data_member_location: (data2) 376
+ <2><7c3>: Abbrev Number: 25 (DW_TAG_member)
+    <7c4>   DW_AT_name        : (strp) (offset: 0x1c96): tp_version_tag
+    <7c8>   DW_AT_decl_file   : (data1) 20
+    <7c9>   DW_AT_decl_line   : (data1) 254
+    <7ca>   DW_AT_decl_column : (data1) 18
+    <7cb>   DW_AT_type        : (ref4) <0x47>, unsigned int
+    <7cf>   DW_AT_data_member_location: (data2) 384
+ <2><7d1>: Abbrev Number: 26 (DW_TAG_member)
+    <7d2>   DW_AT_name        : (strp) (offset: 0xb19): tp_finalize
+    <7d6>   DW_AT_decl_file   : (data1) 20
+    <7d7>   DW_AT_decl_line   : (data2) 256
+    <7d9>   DW_AT_decl_column : (data1) 16
+    <7da>   DW_AT_type        : (ref4) <0xa10>, destructor
+    <7de>   DW_AT_data_member_location: (data2) 392
+ <2><7e0>: Abbrev Number: 26 (DW_TAG_member)
+    <7e1>   DW_AT_name        : (strp) (offset: 0x1c73): tp_vectorcall
+    <7e5>   DW_AT_decl_file   : (data1) 20
+    <7e6>   DW_AT_decl_line   : (data2) 257
+    <7e8>   DW_AT_decl_column : (data1) 20
+    <7e9>   DW_AT_type        : (ref4) <0xcbb>, vectorcallfunc, PyObject, _object
+    <7ed>   DW_AT_data_member_location: (data2) 400
+ <2><7ef>: Abbrev Number: 26 (DW_TAG_member)
+    <7f0>   DW_AT_name        : (strp) (offset: 0x2122): tp_print
+    <7f4>   DW_AT_decl_file   : (data1) 20
+    <7f5>   DW_AT_decl_line   : (data2) 260
+    <7f7>   DW_AT_decl_column : (data1) 30
+    <7f8>   DW_AT_type        : (ref4) <0x1101>, int
+    <7fc>   DW_AT_data_member_location: (data2) 408
+ <2><7fe>: Abbrev Number: 0
+ <1><7ff>: Abbrev Number: 7 (DW_TAG_pointer_type)
+    <800>   DW_AT_byte_size   : (data1) 8
+    <801>   DW_AT_type        : (ref4) <0x54f>, _typeobject
+ <1><805>: Abbrev Number: 3 (DW_TAG_typedef)
+    <806>   DW_AT_name        : (strp) (offset: 0x10a1): PyObject
+    <80a>   DW_AT_decl_file   : (data1) 3
+    <80b>   DW_AT_decl_line   : (data1) 108
+    <80c>   DW_AT_decl_column : (data1) 3
+    <80d>   DW_AT_type        : (ref4) <0x527>, _object
+ <1><811>: Abbrev Number: 27 (DW_TAG_structure_type)
+    <812>   DW_AT_byte_size   : (data1) 24
+    <813>   DW_AT_decl_file   : (data1) 3
+    <814>   DW_AT_decl_line   : (data1) 113
+    <815>   DW_AT_decl_column : (data1) 9
+    <816>   DW_AT_sibling     : (ref4) <0x835>
+ <2><81a>: Abbrev Number: 9 (DW_TAG_member)
+    <81b>   DW_AT_name        : (strp) (offset: 0x8cd): ob_base
+    <81f>   DW_AT_decl_file   : (data1) 3
+    <820>   DW_AT_decl_line   : (data1) 114
+    <821>   DW_AT_decl_column : (data1) 14
+    <822>   DW_AT_type        : (ref4) <0x805>, PyObject, _object
+    <826>   DW_AT_data_member_location: (data1) 0
+ <2><827>: Abbrev Number: 9 (DW_TAG_member)
+    <828>   DW_AT_name        : (strp) (offset: 0xc86): ob_size
+    <82c>   DW_AT_decl_file   : (data1) 3
+    <82d>   DW_AT_decl_line   : (data1) 115
+    <82e>   DW_AT_decl_column : (data1) 16
+    <82f>   DW_AT_type        : (ref4) <0x427>, Py_ssize_t, ssize_t, __ssize_t, long int
+    <833>   DW_AT_data_member_location: (data1) 16
+ <2><834>: Abbrev Number: 0
+ <1><835>: Abbrev Number: 3 (DW_TAG_typedef)
+    <836>   DW_AT_name        : (strp) (offset: 0x75d): PyVarObject
+    <83a>   DW_AT_decl_file   : (data1) 3
+    <83b>   DW_AT_decl_line   : (data1) 116
+    <83c>   DW_AT_decl_column : (data1) 3
+    <83d>   DW_AT_type        : (ref4) <0x811>
+ <1><841>: Abbrev Number: 3 (DW_TAG_typedef)
+    <842>   DW_AT_name        : (strp) (offset: 0x188e): unaryfunc
+    <846>   DW_AT_decl_file   : (data1) 3
+    <847>   DW_AT_decl_line   : (data1) 140
+    <848>   DW_AT_decl_column : (data1) 22
+    <849>   DW_AT_type        : (ref4) <0x84d>, PyObject, _object
+ <1><84d>: Abbrev Number: 7 (DW_TAG_pointer_type)
+    <84e>   DW_AT_byte_size   : (data1) 8
+    <84f>   DW_AT_type        : (ref4) <0x853>, PyObject, _object
+ <1><853>: Abbrev Number: 15 (DW_TAG_subroutine_type)
+    <854>   DW_AT_prototyped  : (flag_present) 1
+    <854>   DW_AT_type        : (ref4) <0x862>, PyObject, _object
+    <858>   DW_AT_sibling     : (ref4) <0x862>
+ <2><85c>: Abbrev Number: 16 (DW_TAG_formal_parameter)
+    <85d>   DW_AT_type        : (ref4) <0x862>, PyObject, _object
+ <2><861>: Abbrev Number: 0
+ <1><862>: Abbrev Number: 7 (DW_TAG_pointer_type)
+    <863>   DW_AT_byte_size   : (data1) 8
+    <864>   DW_AT_type        : (ref4) <0x805>, PyObject, _object
+ <1><868>: Abbrev Number: 4 (DW_TAG_const_type)
+    <869>   DW_AT_type        : (ref4) <0x862>, PyObject, _object
+ <1><86d>: Abbrev Number: 3 (DW_TAG_typedef)
+    <86e>   DW_AT_name        : (strp) (offset: 0xd14): binaryfunc
+    <872>   DW_AT_decl_file   : (data1) 3
+    <873>   DW_AT_decl_line   : (data1) 141
+    <874>   DW_AT_decl_column : (data1) 22
+    <875>   DW_AT_type        : (ref4) <0x879>, PyObject, _object
+ <1><879>: Abbrev Number: 7 (DW_TAG_pointer_type)
+    <87a>   DW_AT_byte_size   : (data1) 8
+    <87b>   DW_AT_type        : (ref4) <0x87f>, PyObject, _object
+ <1><87f>: Abbrev Number: 15 (DW_TAG_subroutine_type)
+    <880>   DW_AT_prototyped  : (flag_present) 1
+    <880>   DW_AT_type        : (ref4) <0x862>, PyObject, _object
+    <884>   DW_AT_sibling     : (ref4) <0x893>
+ <2><888>: Abbrev Number: 16 (DW_TAG_formal_parameter)
+    <889>   DW_AT_type        : (ref4) <0x862>, PyObject, _object
+ <2><88d>: Abbrev Number: 16 (DW_TAG_formal_parameter)
+    <88e>   DW_AT_type        : (ref4) <0x862>, PyObject, _object
+ <2><892>: Abbrev Number: 0
+ <1><893>: Abbrev Number: 3 (DW_TAG_typedef)
+    <894>   DW_AT_name        : (strp) (offset: 0x8ab): ternaryfunc
+    <898>   DW_AT_decl_file   : (data1) 3
+    <899>   DW_AT_decl_line   : (data1) 142
+    <89a>   DW_AT_decl_column : (data1) 22
+    <89b>   DW_AT_type        : (ref4) <0x89f>, PyObject, _object
+ <1><89f>: Abbrev Number: 7 (DW_TAG_pointer_type)
+    <8a0>   DW_AT_byte_size   : (data1) 8
+    <8a1>   DW_AT_type        : (ref4) <0x8a5>, PyObject, _object
+ <1><8a5>: Abbrev Number: 15 (DW_TAG_subroutine_type)
+    <8a6>   DW_AT_prototyped  : (flag_present) 1
+    <8a6>   DW_AT_type        : (ref4) <0x862>, PyObject, _object
+    <8aa>   DW_AT_sibling     : (ref4) <0x8be>
+ <2><8ae>: Abbrev Number: 16 (DW_TAG_formal_parameter)
+    <8af>   DW_AT_type        : (ref4) <0x862>, PyObject, _object
+ <2><8b3>: Abbrev Number: 16 (DW_TAG_formal_parameter)
+    <8b4>   DW_AT_type        : (ref4) <0x862>, PyObject, _object
+ <2><8b8>: Abbrev Number: 16 (DW_TAG_formal_parameter)
+    <8b9>   DW_AT_type        : (ref4) <0x862>, PyObject, _object
+ <2><8bd>: Abbrev Number: 0
+ <1><8be>: Abbrev Number: 3 (DW_TAG_typedef)
+    <8bf>   DW_AT_name        : (strp) (offset: 0x193f): inquiry
+    <8c3>   DW_AT_decl_file   : (data1) 3
+    <8c4>   DW_AT_decl_line   : (data1) 143
+    <8c5>   DW_AT_decl_column : (data1) 15
+    <8c6>   DW_AT_type        : (ref4) <0x8ca>, int
+ <1><8ca>: Abbrev Number: 7 (DW_TAG_pointer_type)
+    <8cb>   DW_AT_byte_size   : (data1) 8
+    <8cc>   DW_AT_type        : (ref4) <0x8d0>, int
+ <1><8d0>: Abbrev Number: 15 (DW_TAG_subroutine_type)
+    <8d1>   DW_AT_prototyped  : (flag_present) 1
+    <8d1>   DW_AT_type        : (ref4) <0x76>, int
+    <8d5>   DW_AT_sibling     : (ref4) <0x8df>
+ <2><8d9>: Abbrev Number: 16 (DW_TAG_formal_parameter)
+    <8da>   DW_AT_type        : (ref4) <0x862>, PyObject, _object
+ <2><8de>: Abbrev Number: 0
+ <1><8df>: Abbrev Number: 3 (DW_TAG_typedef)
+    <8e0>   DW_AT_name        : (strp) (offset: 0x51): lenfunc
+    <8e4>   DW_AT_decl_file   : (data1) 3
+    <8e5>   DW_AT_decl_line   : (data1) 144
+    <8e6>   DW_AT_decl_column : (data1) 22
+    <8e7>   DW_AT_type        : (ref4) <0x8eb>, Py_ssize_t, ssize_t, __ssize_t, long int
+ <1><8eb>: Abbrev Number: 7 (DW_TAG_pointer_type)
+    <8ec>   DW_AT_byte_size   : (data1) 8
+    <8ed>   DW_AT_type        : (ref4) <0x8f1>, Py_ssize_t, ssize_t, __ssize_t, long int
+ <1><8f1>: Abbrev Number: 15 (DW_TAG_subroutine_type)
+    <8f2>   DW_AT_prototyped  : (flag_present) 1
+    <8f2>   DW_AT_type        : (ref4) <0x427>, Py_ssize_t, ssize_t, __ssize_t, long int
+    <8f6>   DW_AT_sibling     : (ref4) <0x900>
+ <2><8fa>: Abbrev Number: 16 (DW_TAG_formal_parameter)
+    <8fb>   DW_AT_type        : (ref4) <0x862>, PyObject, _object
+ <2><8ff>: Abbrev Number: 0
+ <1><900>: Abbrev Number: 3 (DW_TAG_typedef)
+    <901>   DW_AT_name        : (strp) (offset: 0xdc8): ssizeargfunc
+    <905>   DW_AT_decl_file   : (data1) 3
+    <906>   DW_AT_decl_line   : (data1) 145
+    <907>   DW_AT_decl_column : (data1) 21
+    <908>   DW_AT_type        : (ref4) <0x90c>, PyObject, _object
+ <1><90c>: Abbrev Number: 7 (DW_TAG_pointer_type)
+    <90d>   DW_AT_byte_size   : (data1) 8
+    <90e>   DW_AT_type        : (ref4) <0x912>, PyObject, _object
+ <1><912>: Abbrev Number: 15 (DW_TAG_subroutine_type)
+    <913>   DW_AT_prototyped  : (flag_present) 1
+    <913>   DW_AT_type        : (ref4) <0x862>, PyObject, _object
+    <917>   DW_AT_sibling     : (ref4) <0x926>
  <2><91b>: Abbrev Number: 16 (DW_TAG_formal_parameter)
-    <91c>   DW_AT_type        : (ref4) <0x807>, PyObject, _object
- <2><920>: Abbrev Number: 0
- <1><921>: Abbrev Number: 3 (DW_TAG_typedef)
-    <922>   DW_AT_name        : (strp) (offset: 0x2708): objobjproc
-    <926>   DW_AT_decl_file   : (data1) 3
-    <927>   DW_AT_decl_line   : (data1) 174
-    <928>   DW_AT_decl_column : (data1) 15
-    <929>   DW_AT_type        : (ref4) <0x92d>, int
- <1><92d>: Abbrev Number: 7 (DW_TAG_pointer_type)
-    <92e>   DW_AT_byte_size   : (data1) 8
-    <92f>   DW_AT_type        : (ref4) <0x933>, int
- <1><933>: Abbrev Number: 15 (DW_TAG_subroutine_type)
-    <934>   DW_AT_prototyped  : (flag_present) 1
-    <934>   DW_AT_type        : (ref4) <0x76>, int
-    <938>   DW_AT_sibling     : (ref4) <0x947>
- <2><93c>: Abbrev Number: 16 (DW_TAG_formal_parameter)
-    <93d>   DW_AT_type        : (ref4) <0x807>, PyObject, _object
+    <91c>   DW_AT_type        : (ref4) <0x862>, PyObject, _object
+ <2><920>: Abbrev Number: 16 (DW_TAG_formal_parameter)
+    <921>   DW_AT_type        : (ref4) <0x427>, Py_ssize_t, ssize_t, __ssize_t, long int
+ <2><925>: Abbrev Number: 0
+ <1><926>: Abbrev Number: 3 (DW_TAG_typedef)
+    <927>   DW_AT_name        : (strp) (offset: 0x1c63): ssizeobjargproc
+    <92b>   DW_AT_decl_file   : (data1) 3
+    <92c>   DW_AT_decl_line   : (data1) 147
+    <92d>   DW_AT_decl_column : (data1) 14
+    <92e>   DW_AT_type        : (ref4) <0x932>, int
+ <1><932>: Abbrev Number: 7 (DW_TAG_pointer_type)
+    <933>   DW_AT_byte_size   : (data1) 8
+    <934>   DW_AT_type        : (ref4) <0x938>, int
+ <1><938>: Abbrev Number: 15 (DW_TAG_subroutine_type)
+    <939>   DW_AT_prototyped  : (flag_present) 1
+    <939>   DW_AT_type        : (ref4) <0x76>, int
+    <93d>   DW_AT_sibling     : (ref4) <0x951>
  <2><941>: Abbrev Number: 16 (DW_TAG_formal_parameter)
